{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "O Prophet, why do you prohibit what God has made lawful for you, seeking the approval of your wives? And God is Forgiving, Merciful.",
            "verseStringReplacedWithAllah": "O Prophet, why do you prohibit what Allah has made lawful for you, seeking the approval of your wives? And Allah is Forgiving, Merciful."
        },
        {
            "verseNumber": 2,
            "verseString": "God has already ordained for you the dissolution of your oaths. And God is your protector, He is the All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "Allah has already ordained for you the dissolution of your oaths. And Allah is your protector, He is the All-Knowing, All-Wise."
        },
        {
            "verseNumber": 3,
            "verseString": "When the Prophet disclosed a matter in confidence to one of his wives, but when she disclosed it, and God made it known to him, he shared some of it and avoided part. Then, when he told her about it, she said, “Who informed you of this?” He said, “The All-Knowing, the All-Aware informed me.”",
            "verseStringReplacedWithAllah": "When the Prophet disclosed a matter in confidence to one of his wives, but when she disclosed it, and Allah made it known to him, he shared some of it and avoided part. Then, when he told her about it, she said, “Who informed you of this?” He said, “The All-Knowing, the All-Aware informed me.”"
        },
        {
            "verseNumber": 4,
            "verseString": "If you two repent to God, then your hearts have inclined. But if you cooperate against him—then God is his protector, and Gabriel and the righteous believers and the angels, moreover, are his helpers.",
            "verseStringReplacedWithAllah": "If you two repent to Allah, then your hearts have inclined. But if you cooperate against him—then Allah is his protector, and Gabriel and the righteous believers and the angels, moreover, are his helpers."
        },
        {
            "verseNumber": 5,
            "verseString": "It may be if he divorced you, that his Lord will give him instead of you, wives better than you: submissive, faithful, obedient, penitent, worshippers, fasters, previously married and virgins."
        },
        {
            "verseNumber": 6,
            "verseString": "O you who believe, protect yourselves and your families from a Fire whose fuel is people and stones, over which are angels, harsh and severe; they don’t disobey God in what He commands them, but they do what they are commanded.",
            "verseStringReplacedWithAllah": "O you who believe, protect yourselves and your families from a Fire whose fuel is people and stones, over which are angels, harsh and severe; they don’t disobey Allah in what He commands them, but they do what they are commanded."
        },
        {
            "verseNumber": 7,
            "verseString": "O you who have disbelieved, make no excuses today. You are only being recompensed for what you used to do."
        },
        {
            "verseNumber": 8,
            "verseString": "O you who have believed, repent to God with sincere repentance. Perhaps your Lord will remit your sins and admit you into Gardens through which rivers flow. On that Day, God won’t disappoint the Prophet and those who believed with him. Their light will proceed before them, and on their right, they will say, “Our Lord, perfect our light for us and forgive us. You are over all things competent.”",
            "verseStringReplacedWithAllah": "O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remit your sins and admit you into Gardens through which rivers flow. On that Day, Allah won’t disappoint the Prophet and those who believed with him. Their light will proceed before them, and on their right, they will say, “Our Lord, perfect our light for us and forgive us. You are over all things competent.”"
        },
        {
            "verseNumber": 9,
            "verseString": "O Prophet, strive against the unbelievers and the hypocrites, and be harsh with them. Their abode is Hell, and wretched is the destination."
        },
        {
            "verseNumber": 10,
            "verseString": "God presents an example for those who disbelieve: the wife of Noah and the wife of Lot. They were under two of our righteous servants, but they betrayed them, so they didn’t avail them from God at all, and it was said, “Enter the Fire with those who enter.”",
            "verseStringReplacedWithAllah": "Allah presents an example for those who disbelieve: the wife of Noah and the wife of Lot. They were under two of our righteous servants, but they betrayed them, so they didn’t avail them from Allah at all, and it was said, “Enter the Fire with those who enter.”"
        },
        {
            "verseNumber": 11,
            "verseString": "And God presents an example for those who believe: the wife of Pharaoh, when she said, “My Lord, build for me near You a house in Paradise, save me from Pharaoh and his actions, and save me from the wrongdoing people.”",
            "verseStringReplacedWithAllah": "And Allah presents an example for those who believe: the wife of Pharaoh, when she said, “My Lord, build for me near You a house in Paradise, save me from Pharaoh and his actions, and save me from the wrongdoing people.”"
        },
        {
            "verseNumber": 12,
            "verseString": "And Mary, the daughter of Imran, who guarded her chastity, so We breathed into her of Our Spirit. And she believed in the words of her Lord and His scriptures, and she was devoutly obedient."
        }
    ],
    "chapterNumber": 66,
    "nameInEnglish": "Prohibition",
    "nameInTransliteration": "At Tahrim",
    "nameInArabic": "الـتحريم",
    "numberOfVerses": 12
}