{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Blessed is He who revealed the Criterion upon His servant, serving as a Warner to the worlds."
        },
        {
            "verseNumber": 2,
            "verseString": "He to whom belongs the sovereignty of the heavens and the earth, who has not begotten a son, who has no partner in His dominion, and who created everything and ordained its destiny."
        },
        {
            "verseNumber": 3,
            "verseString": "Yet, they choose gods other than Him that create nothing but are themselves created, possess no power to harm or benefit themselves, and cannot control death, life, or resurrection."
        },
        {
            "verseNumber": 4,
            "verseString": "The unbelievers say, “This is nothing but a lie he lied, and others have helped him with it.” They committed an injustice and a falsehood."
        },
        {
            "verseNumber": 5,
            "verseString": "They also say, “Legends of the ancients, which he wrote down, and they are being dictated to him morning and evening.”"
        },
        {
            "verseNumber": 6,
            "verseString": "Respond, “It was revealed by He who knows the secrets of the heavens and the earth. Indeed, He is Forgiving, Merciful.”"
        },
        {
            "verseNumber": 7,
            "verseString": "They ask, “What sort of messenger is this, who eats food and walks in the markets? Why wasn’t an angel sent down to be a co-warner with him?”"
        },
        {
            "verseNumber": 8,
            "verseString": "Or they ask, “Why wasn’t a treasure dropped on him?” Or, “Why doesn’t he have a garden from which he eats?” The wrongdoers also say, “You are only following a man who is bewitched.”"
        },
        {
            "verseNumber": 9,
            "verseString": "See how they make comparisons for you; they are astray and can’t find a way."
        },
        {
            "verseNumber": 10,
            "verseString": "Blessed is He, who, if He wills, can give you better than that: Gardens through which rivers flow, and He will give you palaces."
        },
        {
            "verseNumber": 11,
            "verseString": "They deny the Hour, and for those who deny the Hour, We prepared a scorching fire."
        },
        {
            "verseNumber": 12,
            "verseString": "When it sees them from a distant place, they will hear its fury and roaring."
        },
        {
            "verseNumber": 13,
            "verseString": "When they are thrown into a narrow place, bound in chains, they will plead for annihilation there and then."
        },
        {
            "verseNumber": 14,
            "verseString": "“Don’t plead for a single annihilation today, but plead for many annihilations.”"
        },
        {
            "verseNumber": 15,
            "verseString": "Say, “Is that better, or the Eternal Garden, which is promised to the righteous?” It will be their reward and final destination."
        },
        {
            "verseNumber": 16,
            "verseString": "There, they will have all they desire, forever. This is a promise binding upon your Lord."
        },
        {
            "verseNumber": 17,
            "verseString": "On the Day He gathers them and whatever they worshiped besides God, He will ask, “Was it you who misled these servants of Mine, or did they stray from the path themselves?”",
            "verseStringReplacedWithAllah": "On the Day He gathers them and whatever they worshiped besides Allah, He will ask, “Was it you who misled these servants of Mine, or did they stray from the path themselves?”"
        },
        {
            "verseNumber": 18,
            "verseString": "They will respond, “Glory be to You! It wasn’t for us to take any allies besides You. You gave them and their ancestors pleasures, until they forgot the Remembrance and became a ruined people.”"
        },
        {
            "verseNumber": 19,
            "verseString": "Thus, they will deny you because of what you say, and you won’t be able to avert or help. Whoever among you commits wrongdoing, We will make him taste a severe punishment."
        },
        {
            "verseNumber": 20,
            "verseString": "We never sent messengers before you who didn’t eat food and walk in the markets. We test you through each other—will you have patience? Your Lord is ever Watchful."
        },
        {
            "verseNumber": 21,
            "verseString": "Those who don’t anticipate Our meeting say, “If only the angels were sent down to us, or we could see our Lord.” They’ve grown inwardly arrogant, and have come with great arrogance."
        },
        {
            "verseNumber": 22,
            "verseString": "On the Day they see the angels, there will be no joy for the transgressors, and they will exclaim, “This is an insurmountable barrier!”"
        },
        {
            "verseNumber": 23,
            "verseString": "We will then turn to the deeds they’ve committed and reduce them to scattered dust."
        },
        {
            "verseNumber": 24,
            "verseString": "On that Day, the inhabitants of Paradise will have the best residence, and the finest place of rest."
        },
        {
            "verseNumber": 25,
            "verseString": "On the Day when the sky and its clouds are ripped apart, the angels descend in continuous streams."
        },
        {
            "verseNumber": 26,
            "verseString": "On that Day, sovereignty will belong to the Most Merciful. It will be a difficult Day for the disbelievers."
        },
        {
            "verseNumber": 27,
            "verseString": "On that Day, the wrongdoer will bite on his hands in despair, he will say, “I wish I had taken a path with the Messenger."
        },
        {
            "verseNumber": 28,
            "verseString": "Alas, for me! I wish I had never taken so-and-so as a friend."
        },
        {
            "verseNumber": 29,
            "verseString": "He led me away from the Reminder after it had reached me. Satan has always been a betrayer of man.”"
        },
        {
            "verseNumber": 30,
            "verseString": "The Messenger will say, “O my Lord, my people have treated this Quran as something to be disregarded.”"
        },
        {
            "verseNumber": 31,
            "verseString": "For every prophet, We assigned adversaries from among the guilty. Yet, your Lord is sufficient as a Guide and Helper."
        },
        {
            "verseNumber": 32,
            "verseString": "The disbelievers question, “Why wasn’t the Quran revealed to him all at once?” It was thus, to strengthen your heart, that We revealed it in stages."
        },
        {
            "verseNumber": 33,
            "verseString": "They can’t bring you any argument, but We bring you the truth and the best explanation."
        },
        {
            "verseNumber": 34,
            "verseString": "Those who are dragged face down to Hell, are in the worst position, and are most astray from the path."
        },
        {
            "verseNumber": 35,
            "verseString": "We gave Moses the Scripture and appointed his brother Aaron as his assistant."
        },
        {
            "verseNumber": 36,
            "verseString": "We instructed, “Go to the people who denied Our signs.” Then, We destroyed them utterly."
        },
        {
            "verseNumber": 37,
            "verseString": "And the people of Noah—when they rejected the messengers, We drowned them, and made them a sign for all people. For the wrongdoers, We prepared a severe punishment."
        },
        {
            "verseNumber": 38,
            "verseString": "And Aad, Thamud, the inhabitants of Rass, and many generations in between."
        },
        {
            "verseNumber": 39,
            "verseString": "We presented each of them with parables, and then We obliterated them completely."
        },
        {
            "verseNumber": 40,
            "verseString": "They passed by the town that was drenched by the terrible downpour. Didn’t they see it? Yet, they don’t expect resurrection."
        },
        {
            "verseNumber": 41,
            "verseString": "When they see you, they mock, “Is this the one whom God has sent as a messenger?”",
            "verseStringReplacedWithAllah": "When they see you, they mock, “Is this the one whom Allah has sent as a messenger?”"
        },
        {
            "verseNumber": 42,
            "verseString": "“He almost led us away from our gods, had we not firmly adhered to them.” They will realize, when they witness the punishment, who strayed further."
        },
        {
            "verseNumber": 43,
            "verseString": "Have you considered the one who makes his own desire his god? Can you be responsible for him?"
        },
        {
            "verseNumber": 44,
            "verseString": "Do you think that most of them hear or understand? They are like cattle; in fact, they are even further astray from the path."
        },
        {
            "verseNumber": 45,
            "verseString": "Didn’t you see how your Lord causes the shadow to extend? Had He willed, He could’ve made it still. And We made the sun its indicator."
        },
        {
            "verseNumber": 46,
            "verseString": "Then We retract it towards Us in gradual stages."
        },
        {
            "verseNumber": 47,
            "verseString": "It is He who made the night a covering for you, sleep for rest, and the day a revival."
        },
        {
            "verseNumber": 48,
            "verseString": "It is He who sends the winds as heralds ahead of His mercy, and We send down from the sky pure water."
        },
        {
            "verseNumber": 49,
            "verseString": "To revive dead lands thereby and to provide drink for the multitude of creatures and humans We created."
        },
        {
            "verseNumber": 50,
            "verseString": "We distribute it among them for reflection, yet most people persist in ingratitude and disbelief."
        },
        {
            "verseNumber": 51,
            "verseString": "Had We willed, We could’ve sent a warner to every community."
        },
        {
            "verseNumber": 52,
            "verseString": "So don’t obey the unbelievers, but strive against them vigorously."
        },
        {
            "verseNumber": 53,
            "verseString": "He is the one who has released two bodies of water, one sweet and fresh, the other salty and bitter. He set a barrier and a prohibitive partition between them."
        },
        {
            "verseNumber": 54,
            "verseString": "It is He who created man from water, then made him relation by lineage and marriage. Your Lord is always Capable."
        },
        {
            "verseNumber": 55,
            "verseString": "Yet, they worship entities other than God, which can neither benefit nor harm them. The disbeliever is in open defiance of his Lord.",
            "verseStringReplacedWithAllah": "Yet, they worship entities other than Allah, which can neither benefit nor harm them. The disbeliever is in open defiance of his Lord."
        },
        {
            "verseNumber": 56,
            "verseString": "We sent you only to deliver good news and to issue warnings."
        },
        {
            "verseNumber": 57,
            "verseString": "Say, “I ask of you no recompense for this, except for whoever chooses to follow a path to his Lord.”"
        },
        {
            "verseNumber": 58,
            "verseString": "Put your trust in the Ever-Living One who never dies, and celebrate His praises. He is sufficient as the Well-Aware of the sins of his servants."
        },
        {
            "verseNumber": 59,
            "verseString": "He who created the heavens, the earth, and everything between them in six periods, then established Himself above the Throne—the Most Gracious. So ask about Him a well informed."
        },
        {
            "verseNumber": 60,
            "verseString": "When told to prostrate before the Merciful, they ask, “Who is this Merciful? Should we prostrate before whatever you command us?” And it intensifies their defiance."
        },
        {
            "verseNumber": 61,
            "verseString": "Blessed is He who placed constellations in the heavens, and set therein a radiant lamp and a luminous moon."
        },
        {
            "verseNumber": 62,
            "verseString": "He who made the night and the day follow each other—for anyone who wishes to reflect or express gratitude."
        },
        {
            "verseNumber": 63,
            "verseString": "The servants of the Most Gracious are those who walk gently upon the earth, and when the ignorant address them, they respond with words of peace."
        },
        {
            "verseNumber": 64,
            "verseString": "Those who spend the night before their Lord, prostrating and standing."
        },
        {
            "verseNumber": 65,
            "verseString": "Those who pray, “Our Lord, avert from us the torment of Hell, for its suffering is persistent."
        },
        {
            "verseNumber": 66,
            "verseString": "It is a dreadful dwelling and resting place.”"
        },
        {
            "verseNumber": 67,
            "verseString": "Those who, when they spend, are neither wasteful nor stingy, but are moderate."
        },
        {
            "verseNumber": 68,
            "verseString": "Those who don’t invoke any other god alongside God, nor take a life which God has sanctified—except in the pursuit of justice—nor commit adultery. Whoever does these will face penalties.",
            "verseStringReplacedWithAllah": "Those who don’t invoke any other god alongside Allah, nor take a life which Allah has sanctified—except in the pursuit of justice—nor commit adultery. Whoever does these will face penalties."
        },
        {
            "verseNumber": 69,
            "verseString": "The punishment will be doubled for him on Resurrection Day, and he will remain therein, humiliated."
        },
        {
            "verseNumber": 70,
            "verseString": "Except for those who repent, believe, and work righteousness—for them, God will change their bad things into good ones. God is Ever Forgiving, Most Merciful.",
            "verseStringReplacedWithAllah": "Except for those who repent, believe, and work righteousness—for them, Allah will change their bad things into good ones. Allah is Ever Forgiving, Most Merciful."
        },
        {
            "verseNumber": 71,
            "verseString": "Whoever repents and acts righteously has turned to God in repentance.",
            "verseStringReplacedWithAllah": "Whoever repents and acts righteously has turned to Allah in repentance."
        },
        {
            "verseNumber": 72,
            "verseString": "Those who don’t bear false witness, and when they come across vain talk, they pass by with dignity."
        },
        {
            "verseNumber": 73,
            "verseString": "Those who, when reminded of their Lord’s verses, don’t fall upon them deaf and blind."
        },
        {
            "verseNumber": 74,
            "verseString": "Those who pray, “Our Lord, from our spouses and offspring, make our eyes delightful, and make us exemplary for the righteous.”"
        },
        {
            "verseNumber": 75,
            "verseString": "These will be rewarded with the Chamber for their patience, where they will be received with greetings and words of peace."
        },
        {
            "verseNumber": 76,
            "verseString": "They will dwell therein forever. What an excellent abode and resting place it is!"
        },
        {
            "verseNumber": 77,
            "verseString": "Say, “What significance would you hold with my Lord if not for your prayers? You’ve denied, so the inevitable will come.”"
        }
    ],
    "chapterNumber": 25,
    "nameInEnglish": "The Criterion",
    "nameInTransliteration": "Al Furqan",
    "nameInArabic": "الفرقان",
    "numberOfVerses": 77
}