{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Qaf. By the glorious Quran."
        },
        {
            "verseNumber": 2,
            "verseString": "They marvel that a warner has emerged from their midst. The unbelievers exclaim, “This is a strange thing."
        },
        {
            "verseNumber": 3,
            "verseString": "When we have died and become dust? That is a far return.”"
        },
        {
            "verseNumber": 4,
            "verseString": "We know what the earth diminishes from them, and we have a preserving Book."
        },
        {
            "verseNumber": 5,
            "verseString": "They’ve denied the truth when it came to them; thus, they are in a state of confusion."
        },
        {
            "verseNumber": 6,
            "verseString": "Didn’t they observe the sky above them—how We constructed it, decorated it, and it has no cracks?"
        },
        {
            "verseNumber": 7,
            "verseString": "And the Earth—we expanded it, and placed upon it firm mountains, and made everything on it grow in a balanced way."
        },
        {
            "verseNumber": 8,
            "verseString": "Insight and a reminder for every devoted servant."
        },
        {
            "verseNumber": 9,
            "verseString": "And We send down from the sky blessed water, with which We produce gardens and grains of harvest."
        },
        {
            "verseNumber": 10,
            "verseString": "And tall palm trees with clusters of dates."
        },
        {
            "verseNumber": 11,
            "verseString": "This sustenance is for humankind. And with it, We revive barren land. Similarly, will be the resurrection."
        },
        {
            "verseNumber": 12,
            "verseString": "Before them, the people of Noah, the residents of Ar-Rass, and Thamud denied the truth."
        },
        {
            "verseNumber": 13,
            "verseString": "So did Aad, Pharaoh, and the brethren of Lot."
        },
        {
            "verseNumber": 14,
            "verseString": "The inhabitants of the Forest and the people of Tubba also rejected the messengers. So My promise was justified."
        },
        {
            "verseNumber": 15,
            "verseString": "Were We exhausted by the first creation? Yet they are in confusion about a new creation."
        },
        {
            "verseNumber": 16,
            "verseString": "We created man, and We know what his soul whispers to him. We are closer to him than his jugular vein."
        },
        {
            "verseNumber": 17,
            "verseString": "As the two receivers receive, seated on the right and left."
        },
        {
            "verseNumber": 18,
            "verseString": "Every word he utters is noted by a vigilant scribe nearby."
        },
        {
            "verseNumber": 19,
            "verseString": "The stupor of death arrives: “This is what you attempted to evade.”"
        },
        {
            "verseNumber": 20,
            "verseString": "And the trumpet will be blown. This is the Day of Promise."
        },
        {
            "verseNumber": 21,
            "verseString": "And every soul will come, with it an usher and a witness."
        },
        {
            "verseNumber": 22,
            "verseString": "“You were neglectful of this, so We’ve removed your veil, and your sight today is iron.”"
        },
        {
            "verseNumber": 23,
            "verseString": "And his companion will say, “This is what’s with me, prepared.”"
        },
        {
            "verseNumber": 24,
            "verseString": "“Throw in Hell every stubborn unbeliever."
        },
        {
            "verseNumber": 25,
            "verseString": "Obstructor of good, aggressor, doubter."
        },
        {
            "verseNumber": 26,
            "verseString": "Who set up another god alongside God, so throw him into severe suffering.”",
            "verseStringReplacedWithAllah": "Who set up another god alongside Allah, so throw him into severe suffering.”"
        },
        {
            "verseNumber": 27,
            "verseString": "His attendant will say, “Our Lord, I didn’t make him transgress, but he was far astray.”"
        },
        {
            "verseNumber": 28,
            "verseString": "He will say, “Don’t feud in my presence—I had already given you the warning."
        },
        {
            "verseNumber": 29,
            "verseString": "My word cannot be changed, and I am not unjust to the beings.”"
        },
        {
            "verseNumber": 30,
            "verseString": "On that Day, We will ask Hell, “Are you filled?” And it will reply, “Are there still more?”"
        },
        {
            "verseNumber": 31,
            "verseString": "And Paradise will be brought near to the righteous, not far away."
        },
        {
            "verseNumber": 32,
            "verseString": "“This is what you were promised—for every penitent preserver."
        },
        {
            "verseNumber": 33,
            "verseString": "Who revered the Most Merciful in secret and came with a repentant heart."
        },
        {
            "verseNumber": 34,
            "verseString": "Enter it in peace and security. This is the Day of Eternity.”"
        },
        {
            "verseNumber": 35,
            "verseString": "For them there is whatever they wish therein, and with Us is even more."
        },
        {
            "verseNumber": 36,
            "verseString": "How many generations, stronger than them, did We destroy before them? They explored the lands—was there any escape?"
        },
        {
            "verseNumber": 37,
            "verseString": "In this, there is a lesson for whoever has a heart, who listens attentively and bears witness."
        },
        {
            "verseNumber": 38,
            "verseString": "We created the heavens, the earth, and everything between them in six periods, and no fatigue touched Us."
        },
        {
            "verseNumber": 39,
            "verseString": "Patiently endure what they say, and glorify the praise of your Lord before the rising of the sun and before its setting."
        },
        {
            "verseNumber": 40,
            "verseString": "And exalt Him during the night, and after the prostrations."
        },
        {
            "verseNumber": 41,
            "verseString": "And listen on the Day when the caller calls from a place nearby."
        },
        {
            "verseNumber": 42,
            "verseString": "The Day when they will hear the blast in truth, that is the Day of Emergence."
        },
        {
            "verseNumber": 43,
            "verseString": "It’s We who give life and cause death, and to Us is the destination."
        },
        {
            "verseNumber": 44,
            "verseString": "The Day when the earth will crack open before them, hastening forth. That gathering is easy for Us."
        },
        {
            "verseNumber": 45,
            "verseString": "We are better informed about what they say, and you’re not a tyrant over them. But remind with the Quran whoever fears My warning."
        }
    ],
    "chapterNumber": 50,
    "nameInEnglish": "Qaf",
    "nameInTransliteration": "Qaf",
    "nameInArabic": "ق",
    "numberOfVerses": 45
}