{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "They ask you about the spoils. Say, “The spoils belong to God and the Messenger.” So fear God, settle your disputes, and obey God and His Messenger, if you are believers.",
            "verseStringReplacedWithAllah": "They ask you about the spoils. Say, “The spoils belong to Allah and the Messenger.” So fear Allah, settle your disputes, and obey Allah and His Messenger, if you are believers."
        },
        {
            "verseNumber": 2,
            "verseString": "The believers are those whose hearts tremble when God is mentioned, whose faith is strengthened when His verses are recited to them, and who trust their Lord.",
            "verseStringReplacedWithAllah": "The believers are those whose hearts tremble when Allah is mentioned, whose faith is strengthened when His verses are recited to them, and who trust their Lord."
        },
        {
            "verseNumber": 3,
            "verseString": "Those who perform the prayers and spend from what We provide for them."
        },
        {
            "verseNumber": 4,
            "verseString": "These are the true believers. They have elevated ranks with their Lord, forgiveness, and a generous provision."
        },
        {
            "verseNumber": 5,
            "verseString": "Just as your Lord brought you out of your home truthfully, despite the reluctance of some believers."
        },
        {
            "verseNumber": 6,
            "verseString": "They argued with you about the truth after it had become clear, as if they were driven towards death while they looked on."
        },
        {
            "verseNumber": 7,
            "verseString": "God promised you that one of the two parties would be yours, but you wished the unarmed one would be yours. However, God wanted to establish the truth by His words, and to root out the unbelievers.",
            "verseStringReplacedWithAllah": "Allah promised you that one of the two parties would be yours, but you wished the unarmed one would be yours. However, Allah wanted to establish the truth by His words, and to root out the unbelievers."
        },
        {
            "verseNumber": 8,
            "verseString": "To confirm the truth and to nullify falsehood, even if the guilty hate it."
        },
        {
            "verseNumber": 9,
            "verseString": "Recall when you implored your Lord for help, He responded, “I am sending you a thousand angels in ranks.”"
        },
        {
            "verseNumber": 10,
            "verseString": "God made this but good news, and an assurance to your hearts. Victory comes only from God. God is Mighty and Wise.",
            "verseStringReplacedWithAllah": "Allah made this but good news, and an assurance to your hearts. Victory comes only from Allah. Allah is Mighty and Wise."
        },
        {
            "verseNumber": 11,
            "verseString": "He caused drowsiness to overcome you, granting you tranquility from Himself. He sent down rain from the sky to purify you, to rid you of Satan’s pollution, to strengthen your hearts, and to steady your steps."
        },
        {
            "verseNumber": 12,
            "verseString": "Your Lord inspired the angels: “I am with you, so firm up those who believe. I will instill terror into the hearts of those who disbelieve. Strike at the necks, and strike off every fingertip of theirs.”"
        },
        {
            "verseNumber": 13,
            "verseString": "This is because they defied God and His Messenger. Whoever defies God and His Messenger—surely, God is severe in retribution.",
            "verseStringReplacedWithAllah": "This is because they defied Allah and His Messenger. Whoever defies Allah and His Messenger—surely, Allah is severe in retribution."
        },
        {
            "verseNumber": 14,
            "verseString": "“This is yours, so taste it.” And for the unbelievers is the punishment of the Fire."
        },
        {
            "verseNumber": 15,
            "verseString": "O you who believe, when you confront the unbelievers on the march, never turn your backs to them."
        },
        {
            "verseNumber": 16,
            "verseString": "On that day, whoever turns their back to them—unless maneuvering for battle or intending to join another group—has incurred wrath from God, and his abode is Hell, a most terrible destination.",
            "verseStringReplacedWithAllah": "On that day, whoever turns their back to them—unless maneuvering for battle or intending to join another group—has incurred wrath from Allah, and his abode is Hell, a most terrible destination."
        },
        {
            "verseNumber": 17,
            "verseString": "You didn’t kill them, but it was God who killed them. And you threw not when you threw, but it was God who threw—to test the believers with a good test from Him. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "You didn’t kill them, but it was Allah who killed them. And you threw not when you threw, but it was Allah who threw—to test the believers with a good test from Him. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 18,
            "verseString": "Thus, God thwarts the schemes of the unbelievers.",
            "verseStringReplacedWithAllah": "Thus, Allah thwarts the schemes of the unbelievers."
        },
        {
            "verseNumber": 19,
            "verseString": "If you seek victory, victory has indeed come to you. If you cease, it’s better for you, but if you return, We too will return. Your forces won’t avail you at all, even if they are numerous. God is with the believers.",
            "verseStringReplacedWithAllah": "If you seek victory, victory has indeed come to you. If you cease, it’s better for you, but if you return, We too will return. Your forces won’t avail you at all, even if they are numerous. Allah is with the believers."
        },
        {
            "verseNumber": 20,
            "verseString": "O you who believe, obey God and His Messenger, and don’t turn away from him while you listen.",
            "verseStringReplacedWithAllah": "O you who believe, obey Allah and His Messenger, and don’t turn away from him while you listen."
        },
        {
            "verseNumber": 21,
            "verseString": "And don’t be like those who say, “We hear,” but they listen not."
        },
        {
            "verseNumber": 22,
            "verseString": "The worst of creatures in the sight of God are the deaf and dumb who don’t understand.",
            "verseStringReplacedWithAllah": "The worst of creatures in the sight of Allah are the deaf and dumb who don’t understand."
        },
        {
            "verseNumber": 23,
            "verseString": "If God had found any goodness in them, He would’ve made them hear. Yet, even if He had, they would still have turned away in defiance.",
            "verseStringReplacedWithAllah": "If Allah had found any goodness in them, He would’ve made them hear. Yet, even if He had, they would still have turned away in defiance."
        },
        {
            "verseNumber": 24,
            "verseString": "O you who believe, respond to God and the Messenger when he calls you to what gives you life. And know that God intervenes between a person and his heart, and that to Him you will be gathered.",
            "verseStringReplacedWithAllah": "O you who believe, respond to Allah and the Messenger when he calls you to what gives you life. And know that Allah intervenes between a person and his heart, and that to Him you will be gathered."
        },
        {
            "verseNumber": 25,
            "verseString": "And fear a trial that doesn’t exclusively affect the wrongdoers among you, and know that God’s retribution is severe.",
            "verseStringReplacedWithAllah": "And fear a trial that doesn’t exclusively affect the wrongdoers among you, and know that Allah’s retribution is severe."
        },
        {
            "verseNumber": 26,
            "verseString": "And remember when you were few, weak in the land, fearing that people might abduct you. Then he sheltered you, strengthened you with His victory, and supplied you with good things, so you could express gratitude."
        },
        {
            "verseNumber": 27,
            "verseString": "O you who believe, don’t betray God and the Messenger, nor betray your trusts while you know.",
            "verseStringReplacedWithAllah": "O you who believe, don’t betray Allah and the Messenger, nor betray your trusts while you know."
        },
        {
            "verseNumber": 28,
            "verseString": "Know that your possessions and your children are a test, and that with God, there is a great reward.",
            "verseStringReplacedWithAllah": "Know that your possessions and your children are a test, and that with Allah, there is a great reward."
        },
        {
            "verseNumber": 29,
            "verseString": "O you who believe, if you fear God, He will grant you discernment, purify you of your sins, and forgive you. God is of abundant bounty.",
            "verseStringReplacedWithAllah": "O you who believe, if you fear Allah, He will grant you discernment, purify you of your sins, and forgive you. Allah is of abundant bounty."
        },
        {
            "verseNumber": 30,
            "verseString": "Remember when those who disbelieve planned against you, to capture, to kill, or to expel you. They planned, and God planned; but God is the best of planners.",
            "verseStringReplacedWithAllah": "Remember when those who disbelieve planned against you, to capture, to kill, or to expel you. They planned, and Allah planned; but Allah is the best of planners."
        },
        {
            "verseNumber": 31,
            "verseString": "When Our revelations are recited to them, they say, “We’ve heard. If we wanted, we could say the same; these are nothing but myths of the ancients.”"
        },
        {
            "verseNumber": 32,
            "verseString": "They also say, “O God, if this is the truth from You, then rain down stones from the sky upon us, or inflict upon us a harsh punishment.”",
            "verseStringReplacedWithAllah": "They also say, “O Allah, if this is the truth from You, then rain down stones from the sky upon us, or inflict upon us a harsh punishment.”"
        },
        {
            "verseNumber": 33,
            "verseString": "God would not punish them while you are among them, nor would God punish them while they are seeking forgiveness.",
            "verseStringReplacedWithAllah": "Allah would not punish them while you are among them, nor would Allah punish them while they are seeking forgiveness."
        },
        {
            "verseNumber": 34,
            "verseString": "Why should God not punish them, when they block access to the Sacred Mosque, even though they weren’t its rightful guardians? Its true guardians are the pious, but most don’t know.",
            "verseStringReplacedWithAllah": "Why should Allah not punish them, when they block access to the Sacred Mosque, even though they weren’t its rightful guardians? Its true guardians are the pious, but most don’t know."
        },
        {
            "verseNumber": 35,
            "verseString": "Their prayers at the House are nothing more than whistling and clapping. So, taste the punishment for having disbelieved."
        },
        {
            "verseNumber": 36,
            "verseString": "Those who disbelieve squander their wealth to deter people from God’s path. They will continue to spend it, then it will become a source of regret for them. Eventually, they will be defeated, and the unbelievers will be gathered in Hell.",
            "verseStringReplacedWithAllah": "Those who disbelieve squander their wealth to deter people from Allah’s path. They will continue to spend it, then it will become a source of regret for them. Eventually, they will be defeated, and the unbelievers will be gathered in Hell."
        },
        {
            "verseNumber": 37,
            "verseString": "In order that God may distinguish the wicked from the good, stack the wicked upon each other, bundle them together, and cast them into Hell. These are the losers.",
            "verseStringReplacedWithAllah": "In order that Allah may distinguish the wicked from the good, stack the wicked upon each other, bundle them together, and cast them into Hell. These are the losers."
        },
        {
            "verseNumber": 38,
            "verseString": "Tell the disbelievers: if they desist, what has passed will be forgiven them. But if they resume, the precedent of the ancients has already been established."
        },
        {
            "verseNumber": 39,
            "verseString": "Fight them until there is no more oppression and religion belongs wholly to God. But if they cease, then God sees well all that they do.",
            "verseStringReplacedWithAllah": "Fight them until there is no more oppression and religion belongs wholly to Allah. But if they cease, then Allah sees well all that they do."
        },
        {
            "verseNumber": 40,
            "verseString": "Should they turn away, then know that God is your Protector. An excellent Protector and an excellent Helper.",
            "verseStringReplacedWithAllah": "Should they turn away, then know that Allah is your Protector. An excellent Protector and an excellent Helper."
        },
        {
            "verseNumber": 41,
            "verseString": "Know that whatever spoils you acquire, a fifth of it is for God, the Messenger, the relatives, the orphans, the needy, and the refugees, provided you believe in God and in what We revealed to Our servant on the Day of Decisiveness—the day the two forces clashed. God has power over all things.",
            "verseStringReplacedWithAllah": "Know that whatever spoils you acquire, a fifth of it is for Allah, the Messenger, the relatives, the orphans, the needy, and the refugees, provided you believe in Allah and in what We revealed to Our servant on the Day of Decisiveness—the day the two forces clashed. Allah has power over all things."
        },
        {
            "verseNumber": 42,
            "verseString": "When you were on the near bank, they were on the far bank, and the caravan was below you. Had you made a mutual appointment, you would’ve failed to keep it. But God intended to accomplish a predestined matter, so that those who perished would perish by clear evidence, and those who survived would survive by clear evidence. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "When you were on the near bank, they were on the far bank, and the caravan was below you. Had you made a mutual appointment, you would’ve failed to keep it. But Allah intended to accomplish a predestined matter, so that those who perished would perish by clear evidence, and those who survived would survive by clear evidence. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 43,
            "verseString": "When God made them appear few in your dream. Had He shown them to you as numerous, you would’ve faltered and would’ve disputed in the matter. But God saved the situation. He knows what lies within hearts.",
            "verseStringReplacedWithAllah": "When Allah made them appear few in your dream. Had He shown them to you as numerous, you would’ve faltered and would’ve disputed in the matter. But Allah saved the situation. He knows what lies within hearts."
        },
        {
            "verseNumber": 44,
            "verseString": "When you confronted them, He made them appear fewer in your eyes, and made you appear fewer in their eyes, so that God might accomplish a matter already destined. To God, all matters are returned.",
            "verseStringReplacedWithAllah": "When you confronted them, He made them appear fewer in your eyes, and made you appear fewer in their eyes, so that Allah might accomplish a matter already destined. To Allah, all matters are returned."
        },
        {
            "verseNumber": 45,
            "verseString": "O you who believe! When you meet a detachment, stand firm and remember God much, so you may succeed.",
            "verseStringReplacedWithAllah": "O you who believe! When you meet a detachment, stand firm and remember Allah much, so you may succeed."
        },
        {
            "verseNumber": 46,
            "verseString": "Obey God and His Messenger, and don’t quarrel, lest you fail and your momentum dissipates. And be patient; God is with the patient.",
            "verseStringReplacedWithAllah": "Obey Allah and His Messenger, and don’t quarrel, lest you fail and your momentum dissipates. And be patient; Allah is with the patient."
        },
        {
            "verseNumber": 47,
            "verseString": "Don’t be like those who left their homes boastfully, to be seen by people, and to obstruct God’s path. God encompasses what they do.",
            "verseStringReplacedWithAllah": "Don’t be like those who left their homes boastfully, to be seen by people, and to obstruct Allah’s path. Allah encompasses what they do."
        },
        {
            "verseNumber": 48,
            "verseString": "Satan made their deeds seem attractive to them, and said, “No one among the people can defeat you today, and I am by your side.” But, when the two parties sighted each other, he withdrew on his heels and said, “I am innocent of you; I see what you don’t see; I fear God, and God is severe in penalty.”",
            "verseStringReplacedWithAllah": "Satan made their deeds seem attractive to them, and said, “No one among the people can defeat you today, and I am by your side.” But, when the two parties sighted each other, he withdrew on his heels and said, “I am innocent of you; I see what you don’t see; I fear Allah, and Allah is severe in penalty.”"
        },
        {
            "verseNumber": 49,
            "verseString": "The hypocrites and those with sick hearts said, “Their religion deluded these people.” But whoever relies on God—God is Mighty and Wise.",
            "verseStringReplacedWithAllah": "The hypocrites and those with sick hearts said, “Their religion deluded these people.” But whoever relies on Allah—Allah is Mighty and Wise."
        },
        {
            "verseNumber": 50,
            "verseString": "If only you could see, when the angels take the souls of those who disbelieve, striking their faces and their backs: “Taste the suffering of the Blaze.”"
        },
        {
            "verseNumber": 51,
            "verseString": "This is because of what your hands sent ahead, and God is not unjust to the beings.",
            "verseStringReplacedWithAllah": "This is because of what your hands sent ahead, and Allah is not unjust to the beings."
        },
        {
            "verseNumber": 52,
            "verseString": "Similar to the situation of Pharaoh’s people and those before them. They denied God’s signs, so God seized them for their sins. God is powerful and severe in penalty.",
            "verseStringReplacedWithAllah": "Similar to the situation of Pharaoh’s people and those before them. They denied Allah’s signs, so Allah seized them for their sins. Allah is powerful and severe in penalty."
        },
        {
            "verseNumber": 53,
            "verseString": "This is because God would not change a blessing He bestowed upon a people until they change what’s within themselves. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "This is because Allah would not change a blessing He bestowed upon a people until they change what’s within themselves. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 54,
            "verseString": "Similar to the situation of Pharaoh’s people and those before them. They rejected their Lord’s signs, so We destroyed them for their sins, and We drowned Pharaoh’s people. They were all wrongdoers."
        },
        {
            "verseNumber": 55,
            "verseString": "The worst living creatures in God’s sight are those who disbelieve; they won’t believe.",
            "verseStringReplacedWithAllah": "The worst living creatures in Allah’s sight are those who disbelieve; they won’t believe."
        },
        {
            "verseNumber": 56,
            "verseString": "Those with whom you’ve made a treaty, yet they breach their agreement every time—they aren’t righteous."
        },
        {
            "verseNumber": 57,
            "verseString": "If you encounter them in battle, make them a fearsome example for others who follow them, so they may take heed."
        },
        {
            "verseNumber": 58,
            "verseString": "If you fear betrayal from a people, throw back to them on equal terms. God doesn’t love the deceitful.",
            "verseStringReplacedWithAllah": "If you fear betrayal from a people, throw back to them on equal terms. Allah doesn’t love the deceitful."
        },
        {
            "verseNumber": 59,
            "verseString": "Let not the unbelievers assume they are ahead. They won’t cause failure."
        },
        {
            "verseNumber": 60,
            "verseString": "Prepare against them all the forces and cavalry you can muster, to frighten thereby God’s enemies and your enemies, and others besides them unknown to you, but known to God. Whatever you spend in God’s way will be repaid to you fully, and you won’t be wronged.",
            "verseStringReplacedWithAllah": "Prepare against them all the forces and cavalry you can muster, to frighten thereby Allah’s enemies and your enemies, and others besides them unknown to you, but known to Allah. Whatever you spend in Allah’s way will be repaid to you fully, and you won’t be wronged."
        },
        {
            "verseNumber": 61,
            "verseString": "And if they incline towards peace, incline towards it, and trust in God. Indeed He is the All-Hearing, the All-Knowing.",
            "verseStringReplacedWithAllah": "And if they incline towards peace, incline towards it, and trust in Allah. Indeed He is the All-Hearing, the All-Knowing."
        },
        {
            "verseNumber": 62,
            "verseString": "If they intend to deceive you, then God is sufficient for you. It is He who supported you with His help and with the believers.",
            "verseStringReplacedWithAllah": "If they intend to deceive you, then Allah is sufficient for you. It is He who supported you with His help and with the believers."
        },
        {
            "verseNumber": 63,
            "verseString": "And He united their hearts. Had you spent all that’s on earth, you couldn’t have united their hearts, but God united them. He is Mighty and Wise.",
            "verseStringReplacedWithAllah": "And He united their hearts. Had you spent all that’s on earth, you couldn’t have united their hearts, but Allah united them. He is Mighty and Wise."
        },
        {
            "verseNumber": 64,
            "verseString": "O Prophet, suffice yourself with God and the believers who follow you.",
            "verseStringReplacedWithAllah": "O Prophet, suffice yourself with Allah and the believers who follow you."
        },
        {
            "verseNumber": 65,
            "verseString": "O Prophet, rouse the believers to fight. If there are among you twenty who are steadfast, they will defeat two hundred. And if there are a hundred of you, they will defeat a thousand of the unbelievers, for they are a people void of understanding."
        },
        {
            "verseNumber": 66,
            "verseString": "Now, God has lightened your burden, knowing that you have a weakness. If there are a hundred steadfast among you, they will defeat two hundred. And if there are a thousand of you, they will defeat two thousand by God’s permission. God is with the patient.",
            "verseStringReplacedWithAllah": "Now, Allah has lightened your burden, knowing that you have a weakness. If there are a hundred steadfast among you, they will defeat two hundred. And if there are a thousand of you, they will defeat two thousand by Allah’s permission. Allah is with the patient."
        },
        {
            "verseNumber": 67,
            "verseString": "It’s not for a prophet to take captives until he has thoroughly subdued the land. You desire the goods of this world, while God desires the Hereafter. God is Mighty and Wise.",
            "verseStringReplacedWithAllah": "It’s not for a prophet to take captives until he has thoroughly subdued the land. You desire the goods of this world, while Allah desires the Hereafter. Allah is Mighty and Wise."
        },
        {
            "verseNumber": 68,
            "verseString": "Were it not for a prior decree from God, a severe punishment would’ve touched you for what you’ve taken.",
            "verseStringReplacedWithAllah": "Were it not for a prior decree from Allah, a severe punishment would’ve touched you for what you’ve taken."
        },
        {
            "verseNumber": 69,
            "verseString": "So consume what you’ve gained, lawful and good, and remain conscious of God. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "So consume what you’ve gained, lawful and good, and remain conscious of Allah. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 70,
            "verseString": "O Prophet, say to those who are captives in your custody, “If God knows any good in your hearts, He will give you something better than what was taken from you, and He will forgive you. God is Forgiving and Merciful.”",
            "verseStringReplacedWithAllah": "O Prophet, say to those who are captives in your custody, “If Allah knows any good in your hearts, He will give you something better than what was taken from you, and He will forgive you. Allah is Forgiving and Merciful.”"
        },
        {
            "verseNumber": 71,
            "verseString": "If they intend to betray you, they have previously betrayed God, and He overpowered them. God is Knowing and Wise.",
            "verseStringReplacedWithAllah": "If they intend to betray you, they have previously betrayed Allah, and He overpowered them. Allah is Knowing and Wise."
        },
        {
            "verseNumber": 72,
            "verseString": "Those who believed, emigrated, and striven in God’s way with their wealth and lives and those who provided shelter and assistance are allies of one another. However, for those who believed and didn’t emigrate, you owe them no protection until they emigrate. However, if they seek your assistance in faith, then you should support them, except against a people with whom you have a treaty. God observes all your actions.",
            "verseStringReplacedWithAllah": "Those who believed, emigrated, and striven in Allah’s way with their wealth and lives and those who provided shelter and assistance are allies of one another. However, for those who believed and didn’t emigrate, you owe them no protection until they emigrate. However, if they seek your assistance in faith, then you should support them, except against a people with whom you have a treaty. Allah observes all your actions."
        },
        {
            "verseNumber": 73,
            "verseString": "The unbelievers are allies of one another. If you don’t do the same, there will be turmoil on earth and great corruption."
        },
        {
            "verseNumber": 74,
            "verseString": "Those who believed, emigrated, and striven for God’s cause and those who provided shelter and aid are the true believers. For them is forgiveness and a generous provision.",
            "verseStringReplacedWithAllah": "Those who believed, emigrated, and striven for Allah’s cause and those who provided shelter and aid are the true believers. For them is forgiveness and a generous provision."
        },
        {
            "verseNumber": 75,
            "verseString": "As for those who have believed later, emigrated, and struggled alongside you, they are of you. However, according to the book of God, blood relations have precedence. God has knowledge of all things.",
            "verseStringReplacedWithAllah": "As for those who have believed later, emigrated, and struggled alongside you, they are of you. However, according to the book of Allah, blood relations have precedence. Allah has knowledge of all things."
        }
    ],
    "chapterNumber": 8,
    "nameInEnglish": "The Spoils",
    "nameInTransliteration": "Al Anfal",
    "nameInArabic": "الأنفال",
    "numberOfVerses": 75
}