{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Ta. Seen. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "These are the verses of the Enlightening Book."
        },
        {
            "verseNumber": 3,
            "verseString": "We narrate to you the story of Moses and Pharaoh, with truth, for a people who believe."
        },
        {
            "verseNumber": 4,
            "verseString": "Pharaoh exalted himself in the land, dividing its people into sects. He oppressed a group among them, slaughtering their sons while sparing their women. He was among the corruptors."
        },
        {
            "verseNumber": 5,
            "verseString": "Yet, We intended to show favor upon those oppressed in the land, and make them leaders, and make them the inheritors."
        },
        {
            "verseNumber": 6,
            "verseString": "And to establish them in the land. And to show Pharaoh, Haman, and their troops from them what they were fearing."
        },
        {
            "verseNumber": 7,
            "verseString": "We inspired Moses’ mother: “Suckle him, and if you fear for him, cast him into the river, and don’t fear nor grieve. We will return him to you and make him one of the messengers.”"
        },
        {
            "verseNumber": 8,
            "verseString": "Pharaoh’s family picked him up, unaware he would become their adversary and bring them sorrow. Pharaoh, Haman, and their troops were sinful."
        },
        {
            "verseNumber": 9,
            "verseString": "Pharaoh’s wife said, “He is a delight to my eyes and yours. Don’t kill him; perhaps he may benefit us, or we may adopt him as a son.” However, they didn’t foresee."
        },
        {
            "verseNumber": 10,
            "verseString": "The heart of Moses’ mother was filled with anxiety—she almost disclosed his identity, if We had not strengthened her heart, so that she could be among the believers."
        },
        {
            "verseNumber": 11,
            "verseString": "And she said to his sister, “Follow him.” So she watched him from a distance while they perceived not."
        },
        {
            "verseNumber": 12,
            "verseString": "And We had forbidden foster-mothers for him. She said, “Shall I point out to you a household that could look after him for you?”"
        },
        {
            "verseNumber": 13,
            "verseString": "And so, We returned him to his mother, to bring her joy, alleviate her sorrow, and reassure her that God’s promise is true. Yet, most of them don’t understand.",
            "verseStringReplacedWithAllah": "And so, We returned him to his mother, to bring her joy, alleviate her sorrow, and reassure her that Allah’s promise is true. Yet, most of them don’t understand."
        },
        {
            "verseNumber": 14,
            "verseString": "When he reached his full strength and was mature, We endowed him with wisdom and knowledge. This is how We reward the righteous."
        },
        {
            "verseNumber": 15,
            "verseString": "One day, he entered the city unnoticed by its inhabitants. There, he found two men fighting—one from his sect and the other from his enemies. The man from his sect sought his help against the adversary, and Moses struck him, ending his life. He said, “This is the work of Satan; he is a clear enemy, leading astray.”"
        },
        {
            "verseNumber": 16,
            "verseString": "He prayed, “My Lord, I have wronged myself. Please forgive me.” And He forgave him. He is the Forgiving, the Merciful."
        },
        {
            "verseNumber": 17,
            "verseString": "He pledged, “My Lord, by the favors You’ve bestowed upon me, I will never be a helper to the criminals.”"
        },
        {
            "verseNumber": 18,
            "verseString": "Afterward, he was vigilant in the city. The man who had sought his help the previous day was again crying out for his assistance. Moses said to him, ”You are clearly a troublemaker.”"
        },
        {
            "verseNumber": 19,
            "verseString": "And when he intended to strike the one from their enemy faction, he said, “O Moses, do you intend to kill me, as you killed a man yesterday? You only aim to become a tyrant in the land and not a peacemaker.”"
        },
        {
            "verseNumber": 20,
            "verseString": "A man came rushing from the city’s farthest part, exclaiming, “O Moses, the authorities are consulting to kill you. Leave immediately; I am advising you in good faith.”"
        },
        {
            "verseNumber": 21,
            "verseString": "So he departed from there, fearful and vigilant, saying, “My Lord, save me from the wrongdoing people.”"
        },
        {
            "verseNumber": 22,
            "verseString": "When he was heading towards Midian, he said, “Hopefully, my Lord will guide me to the right path.”"
        },
        {
            "verseNumber": 23,
            "verseString": "Upon reaching the water of Midian, he found a crowd of people watering. And he found, apart from them, two women keeping back. He asked, “What troubles you?” They replied, “We can’t water until the shepherds have finished, and our father is an elderly man.”"
        },
        {
            "verseNumber": 24,
            "verseString": "Then, he watered for them, then withdrew to the shade and said, “My Lord, I am in desperate need of whatever good You might send down to me.”"
        },
        {
            "verseNumber": 25,
            "verseString": "Later, one of the two women approached him, walking modestly. She said, “My father invites you so he may reward you for drawing water for us.” When he arrived and told him the story, he said, “Don’t fear. You’ve escaped from the unjust people.”"
        },
        {
            "verseNumber": 26,
            "verseString": "One of the women said, “My father, hire him! The best one to hire is the strong and trustworthy.”"
        },
        {
            "verseNumber": 27,
            "verseString": "He said, “I intend to wed you to one of my daughters, provided you serve me for eight years. If you complete ten, it is up to you. And I don’t intend to impose any hardship on you, and God willing, you’ll find me righteous.”",
            "verseStringReplacedWithAllah": "He said, “I intend to wed you to one of my daughters, provided you serve me for eight years. If you complete ten, it is up to you. And I don’t intend to impose any hardship on you, and Allah willing, you’ll find me righteous.”"
        },
        {
            "verseNumber": 28,
            "verseString": "He responded, “That’s an agreement between us. Whichever of the two terms I fulfill, let there be no injustice towards me, and God is the guardian over what we say.”",
            "verseStringReplacedWithAllah": "He responded, “That’s an agreement between us. Whichever of the two terms I fulfill, let there be no injustice towards me, and Allah is the guardian over what we say.”"
        },
        {
            "verseNumber": 29,
            "verseString": "After Moses had completed the term and was journeying with his family, he noticed a fire in the direction of the Mount. He told his family, “Stay here; I have noticed a fire. Perhaps I can bring back some news from it, or a burning ember to warm you.”"
        },
        {
            "verseNumber": 30,
            "verseString": "As he approached, he was called out from the right side of the valley, from the Blessed Spot, from within the tree, “O Moses, it is I, God, Lord of the worlds.”",
            "verseStringReplacedWithAllah": "As he approached, he was called out from the right side of the valley, from the Blessed Spot, from within the tree, “O Moses, it is I, Allah, Lord of the worlds.”"
        },
        {
            "verseNumber": 31,
            "verseString": "“Drop your staff.” And when he saw it writhing, as if it were a serpent, he turned to flee and didn’t look back. “O Moses, approach and fear not—you are safe."
        },
        {
            "verseNumber": 32,
            "verseString": "Insert your hand into your robe; it will come out white, without any blemish. And draw your arm toward yourself to ward off fear. These are two proofs from your Lord for Pharaoh and his chiefs; they are sinful people.”"
        },
        {
            "verseNumber": 33,
            "verseString": "He said, “My Lord, I have killed a man among them, so I fear that they will kill me."
        },
        {
            "verseNumber": 34,
            "verseString": "And my brother Aaron; he is more fluent in speech than me. So send him with me as a helper to affirm my truth; I fear they will reject me."
        },
        {
            "verseNumber": 35,
            "verseString": "He replied, “We will strengthen you with your brother, and We will grant both of you authority, so they can’t harm you. With Our signs, you and those who follow you will be victorious.”"
        },
        {
            "verseNumber": 36,
            "verseString": "But when Moses came to them with Our clear signs, they said, “This is nothing but fabricated magic; we’ve never heard of such from our forefathers.”"
        },
        {
            "verseNumber": 37,
            "verseString": "Moses responded, “My Lord knows best who brought guidance from Him, and to whom the ultimate home will belong. The wrongdoers won’t succeed.”"
        },
        {
            "verseNumber": 38,
            "verseString": "Pharaoh declared, “O my chiefs, I know of no other god for you than myself. Therefore, O Haman, fire up the clay for me, and build me a tower, that I may climb up to the God of Moses; though I am convinced he is lying.”"
        },
        {
            "verseNumber": 39,
            "verseString": "He and his troops behaved arrogantly in the land, without right, and they thought that they wouldn’t be returned to Us."
        },
        {
            "verseNumber": 40,
            "verseString": "So, We seized him and his troops, throwing them into the sea. Observe the end of the wrongdoers!"
        },
        {
            "verseNumber": 41,
            "verseString": "And We appointed them leaders who call to the Fire, and on Resurrection Day, they won’t be helped."
        },
        {
            "verseNumber": 42,
            "verseString": "And We followed them in this world with a curse, and they will be among the despised on Resurrection Day."
        },
        {
            "verseNumber": 43,
            "verseString": "And We gave Moses the Scripture, after We had destroyed the former generations, as a beacon of light for humanity, offering guidance and mercy, so they might reflect."
        },
        {
            "verseNumber": 44,
            "verseString": "You weren’t on the western side when We decreed the commandment to Moses, nor were you among the witnesses."
        },
        {
            "verseNumber": 45,
            "verseString": "Yet, We raised numerous generations and extended their lifespans. You were not among the people of Midian, delivering Our verses to them. But, We have always sent messengers."
        },
        {
            "verseNumber": 46,
            "verseString": "You weren’t at the base of the Mount when We called out. However, it’s an act of mercy from your Lord, to warn a people to whom no warner had come before, so they may become aware."
        },
        {
            "verseNumber": 47,
            "verseString": "Thus, if a calamity befalls them due to their actions, they can’t say, “Our Lord, if only You had sent us a messenger, we would’ve followed Your guidance and been among the believers.”"
        },
        {
            "verseNumber": 48,
            "verseString": "Now, when the truth has come to them from Us, they argue, “Why wasn’t he given something similar to what Moses received?” Didn’t they reject what was previously given to Moses? And they say, “These two are mixed-up magic spells, and we reject both.”"
        },
        {
            "verseNumber": 49,
            "verseString": "Say, “Then produce a scripture from God that offers superior guidance than these two, and I will follow it, if you are truthful.”",
            "verseStringReplacedWithAllah": "Say, “Then produce a scripture from Allah that offers superior guidance than these two, and I will follow it, if you are truthful.”"
        },
        {
            "verseNumber": 50,
            "verseString": "If they fail to respond to you, know that they are merely following their desires. And who is more astray than one who follows his desires without guidance from God? God does not guide the wrongdoers.",
            "verseStringReplacedWithAllah": "If they fail to respond to you, know that they are merely following their desires. And who is more astray than one who follows his desires without guidance from Allah? Allah does not guide the wrongdoers."
        },
        {
            "verseNumber": 51,
            "verseString": "We’ve conveyed the Word to them, so they may remember."
        },
        {
            "verseNumber": 52,
            "verseString": "Those to whom We’ve given the Scripture before this, are believers in it."
        },
        {
            "verseNumber": 53,
            "verseString": "When it’s conveyed to them, they assert, “We believe in it; it’s the truth from our Lord. Even before its revelation, we were already Submitters.”"
        },
        {
            "verseNumber": 54,
            "verseString": "These will be given their reward twice over, because they persevered. They fend off evil with good, and they spend out of what We’ve provided for them."
        },
        {
            "verseNumber": 55,
            "verseString": "When they hear idle talk, they turn away from it, saying, “To us our deeds, and to you your deeds. Peace be upon you; we don’t engage with the ignorant.”"
        },
        {
            "verseNumber": 56,
            "verseString": "You can’t guide whom you love, but God guides whom He wills. He knows best those who are guided.",
            "verseStringReplacedWithAllah": "You can’t guide whom you love, but Allah guides whom He wills. He knows best those who are guided."
        },
        {
            "verseNumber": 57,
            "verseString": "They argue, “If we follow the guidance with you, we will be displaced from our land.” Didn’t We establish for them a secure sanctuary, to which all kinds of fruits are brought, as sustenance from Us? Yet, most of them don’t understand."
        },
        {
            "verseNumber": 58,
            "verseString": "How many a city did We destroy while they were arrogant in their luxury? These are their dwellings, uninhabited after them except a little; We are the Inheritor."
        },
        {
            "verseNumber": 59,
            "verseString": "Your Lord never destroyed the towns until He has raised a messenger within them to relay to them Our revelations. We would never destroy a community unless its people were wrongdoers."
        },
        {
            "verseNumber": 60,
            "verseString": "What you’ve been given is merely for the enjoyment and decoration of this worldly life. What God possesses, however, is superior and more lasting. Don’t you understand?",
            "verseStringReplacedWithAllah": "What you’ve been given is merely for the enjoyment and decoration of this worldly life. What Allah possesses, however, is superior and more lasting. Don’t you understand?"
        },
        {
            "verseNumber": 61,
            "verseString": "Is the one to whom We’ve promised a good promise—which he will attain—comparable to the one to whom We granted worldly pleasures, but who, on Resurrection Day, will be among the arraigned?"
        },
        {
            "verseNumber": 62,
            "verseString": "On that Day, He will call out to them, “Where are those ‘partners’ of Mine you claimed?”"
        },
        {
            "verseNumber": 63,
            "verseString": "Those against whom the word will come into effect, will say, “Our Lord, these are the ones we misled. We misled them as we ourselves were misled. We disassociate ourselves from them before You. It was not us whom they worshiped.”"
        },
        {
            "verseNumber": 64,
            "verseString": "Then it will be said, “Call upon your associates.” They will call upon them, but they won’t answer them. They will witness the suffering and wish they had followed guidance."
        },
        {
            "verseNumber": 65,
            "verseString": "On that Day, He will question them, “What was your reply to the messengers?”"
        },
        {
            "verseNumber": 66,
            "verseString": "On that day, they will be blind to the news, and they won’t ask one another."
        },
        {
            "verseNumber": 67,
            "verseString": "However, those who repent, believe, and perform righteous deeds may indeed be among the successful."
        },
        {
            "verseNumber": 68,
            "verseString": "Your Lord creates what He wills, and He chooses. The choice isn’t theirs. Glory be to God, and High above what they associate with Him.",
            "verseStringReplacedWithAllah": "Your Lord creates what He wills, and He chooses. The choice isn’t theirs. Glory be to Allah, and High above what they associate with Him."
        },
        {
            "verseNumber": 69,
            "verseString": "Your Lord knows what their hearts conceal and what they disclose."
        },
        {
            "verseNumber": 70,
            "verseString": "He is God; there is no god except He. All praise is His in this life and the Hereafter. His is the judgment, and to Him you will be returned.",
            "verseStringReplacedWithAllah": "He is Allah; there is no god except He. All praise is His in this life and the Hereafter. His is the judgment, and to Him you will be returned."
        },
        {
            "verseNumber": 71,
            "verseString": "Say, “Have you considered: if God were to make the night continuous over you until Resurrection Day, which god, other than God, could bring you illumination? Don’t you listen?”",
            "verseStringReplacedWithAllah": "Say, “Have you considered: if Allah were to make the night continuous over you until Resurrection Day, which god, other than Allah, could bring you illumination? Don’t you listen?”"
        },
        {
            "verseNumber": 72,
            "verseString": "Say, “Have you considered: if God were to make the day continuous over you until Resurrection Day, which god, other than God, could bring you night for rest? Don’t you see?”",
            "verseStringReplacedWithAllah": "Say, “Have you considered: if Allah were to make the day continuous over you until Resurrection Day, which god, other than Allah, could bring you night for rest? Don’t you see?”"
        },
        {
            "verseNumber": 73,
            "verseString": "Out of His mercy, He made for you the night and the day, so you may rest therein, seek His bounty, and perhaps express gratitude."
        },
        {
            "verseNumber": 74,
            "verseString": "On the Day He will summon them, He will question, “Where are those you alleged were My ‘partners’?”"
        },
        {
            "verseNumber": 75,
            "verseString": "We will extract from every nation a witness and say, “Present your evidence.” Then they will realize that the truth is God’s alone, and the lies they fabricated will abandon them.",
            "verseStringReplacedWithAllah": "We will extract from every nation a witness and say, “Present your evidence.” Then they will realize that the truth is Allah’s alone, and the lies they fabricated will abandon them."
        },
        {
            "verseNumber": 76,
            "verseString": "Korah was of Moses’ people, but he oppressed them. We had given him such treasures, that their keys would burden a group of strong men. When his people said to him, “Don’t exult; God does not love the exultant.",
            "verseStringReplacedWithAllah": "Korah was of Moses’ people, but he oppressed them. We had given him such treasures, that their keys would burden a group of strong men. When his people said to him, “Don’t exult; Allah does not love the exultant."
        },
        {
            "verseNumber": 77,
            "verseString": "Seek the Hereafter with what God has given you, and don’t neglect your share of this world. Do good, as God has done good to you, and refrain from causing corruption in the land. God doesn’t favor the corrupt.”",
            "verseStringReplacedWithAllah": "Seek the Hereafter with what Allah has given you, and don’t neglect your share of this world. Do good, as Allah has done good to you, and refrain from causing corruption in the land. Allah doesn’t favor the corrupt.”"
        },
        {
            "verseNumber": 78,
            "verseString": "He replied, “I acquired all this through my knowledge.” Didn’t he know that God had destroyed before him generations that were mightier and wealthier than he was? But the sinful won’t be asked about their sins.",
            "verseStringReplacedWithAllah": "He replied, “I acquired all this through my knowledge.” Didn’t he know that Allah had destroyed before him generations that were mightier and wealthier than he was? But the sinful won’t be asked about their sins."
        },
        {
            "verseNumber": 79,
            "verseString": "And he paraded before his people in his splendor. Those who seek this worldly life said, “If only we had the like of what Korah was given. Indeed, he is one of great fortune.”"
        },
        {
            "verseNumber": 80,
            "verseString": "But those who had been given knowledge said, “Woe to you! The reward from God is better for those who believe and act righteously, but only the patient will receive it.”",
            "verseStringReplacedWithAllah": "But those who had been given knowledge said, “Woe to you! The reward from Allah is better for those who believe and act righteously, but only the patient will receive it.”"
        },
        {
            "verseNumber": 81,
            "verseString": "So, We made the earth swallow him and his mansion. There was no group to help him against God, nor could he defend himself.",
            "verseStringReplacedWithAllah": "So, We made the earth swallow him and his mansion. There was no group to help him against Allah, nor could he defend himself."
        },
        {
            "verseNumber": 82,
            "verseString": "Those who wished they were in his place the day before began to say, “Oh, how God extends provision to whom He wills of His servants and restricts it. Had God not been gracious to us, He would’ve caused the earth to swallow us. Oh, how the unbelievers don’t succeed.”",
            "verseStringReplacedWithAllah": "Those who wished they were in his place the day before began to say, “Oh, how Allah extends provision to whom He wills of His servants and restricts it. Had Allah not been gracious to us, He would’ve caused the earth to swallow us. Oh, how the unbelievers don’t succeed.”"
        },
        {
            "verseNumber": 83,
            "verseString": "That Home of the Hereafter, We assign it to those who don’t seek superiority on earth, nor corruption. And the outcome is for the righteous."
        },
        {
            "verseNumber": 84,
            "verseString": "Whoever comes with good will have what’s better. But whoever comes with evil—the evildoers will be recompensed only for what they’ve done."
        },
        {
            "verseNumber": 85,
            "verseString": "He who ordained the Quran upon you, will bring you back to the place of return. Say, “My Lord knows best who comes with guidance and who is in manifest error.”"
        },
        {
            "verseNumber": 86,
            "verseString": "You didn’t expect the Scripture to be transmitted to you, but it is a mercy from your Lord. So, don’t be a supporter of unbelievers."
        },
        {
            "verseNumber": 87,
            "verseString": "And let them not turn you away from God’s verses after they’ve been revealed to you. And invite to your Lord, and never be one of the idolaters.",
            "verseStringReplacedWithAllah": "And let them not turn you away from Allah’s verses after they’ve been revealed to you. And invite to your Lord, and never be one of the idolaters."
        },
        {
            "verseNumber": 88,
            "verseString": "And call not, besides God, unto any other god. There is no deity except Him. Everything will perish, except His presence. To Him is judgment, and to Him, you will be returned.",
            "verseStringReplacedWithAllah": "And call not, besides Allah, unto any other god. There is no deity except Him. Everything will perish, except His presence. To Him is judgment, and to Him, you will be returned."
        }
    ],
    "chapterNumber": 28,
    "nameInEnglish": "The Story",
    "nameInTransliteration": "Al Qasas",
    "nameInArabic": "القصص",
    "numberOfVerses": 88
}