{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "The believers have attained success."
        },
        {
            "verseNumber": 2,
            "verseString": "Those who are humble in their prayers."
        },
        {
            "verseNumber": 3,
            "verseString": "Those who avoid vain talk."
        },
        {
            "verseNumber": 4,
            "verseString": "Those who are active in charitable deeds."
        },
        {
            "verseNumber": 5,
            "verseString": "Those who protect their chastity."
        },
        {
            "verseNumber": 6,
            "verseString": "Except from their wives or what their right hands possess, for they aren’t to be blamed."
        },
        {
            "verseNumber": 7,
            "verseString": "However, those who seek beyond that are the transgressors."
        },
        {
            "verseNumber": 8,
            "verseString": "Those who faithfully uphold their trusts and promises."
        },
        {
            "verseNumber": 9,
            "verseString": "And those who guard their prayers."
        },
        {
            "verseNumber": 10,
            "verseString": "These are the inheritors."
        },
        {
            "verseNumber": 11,
            "verseString": "Who will inherit Paradise, therein to dwell forever."
        },
        {
            "verseNumber": 12,
            "verseString": "We created man from an extract of clay."
        },
        {
            "verseNumber": 13,
            "verseString": "Then, We placed him as a drop in a secure dwelling place."
        },
        {
            "verseNumber": 14,
            "verseString": "Then, We transformed the drop into a clot, then developed the clot into a lump, then shaped the lump into bones, then clothed the bones with flesh. Then, We brought him forth as another creation. So, blessed is God, the Best of Creators.",
            "verseStringReplacedWithAllah": "Then, We transformed the drop into a clot, then developed the clot into a lump, then shaped the lump into bones, then clothed the bones with flesh. Then, We brought him forth as another creation. So, blessed is Allah, the Best of Creators."
        },
        {
            "verseNumber": 15,
            "verseString": "Afterward, you will surely die."
        },
        {
            "verseNumber": 16,
            "verseString": "Then, on the Day of Resurrection, you will be resurrected."
        },
        {
            "verseNumber": 17,
            "verseString": "We created above you seven pathways, and We are never unmindful of creation."
        },
        {
            "verseNumber": 18,
            "verseString": "We send down water from the sky in due measure, storing it within the earth, and We can take it away."
        },
        {
            "verseNumber": 19,
            "verseString": "Through it, We produce for you gardens of date palms and vineyards, yielding abundant fruits from which you eat."
        },
        {
            "verseNumber": 20,
            "verseString": "Also, a tree that springs forth from Mount Sinai, producing oil and relish for the eaters."
        },
        {
            "verseNumber": 21,
            "verseString": "In livestock, too, there is a lesson for you: We provide you with a drink from what’s in their bellies, and there are numerous other benefits for you in them, and of them, you eat."
        },
        {
            "verseNumber": 22,
            "verseString": "And on them, as well as on ships, you are transported."
        },
        {
            "verseNumber": 23,
            "verseString": "We sent Noah to his people, and he pleaded, “O my people, worship God; you have no god but Him. Will you not then be righteous?”",
            "verseStringReplacedWithAllah": "We sent Noah to his people, and he pleaded, “O my people, worship Allah; you have no god but Him. Will you not then be righteous?”"
        },
        {
            "verseNumber": 24,
            "verseString": "However, the leaders of his people who disbelieved said, “This is nothing but a man like yourselves, seeking to assert dominance over you. If God had willed, He could’ve sent down angels. We’ve never heard of this from our forefathers.",
            "verseStringReplacedWithAllah": "However, the leaders of his people who disbelieved said, “This is nothing but a man like yourselves, seeking to assert dominance over you. If Allah had willed, He could’ve sent down angels. We’ve never heard of this from our forefathers."
        },
        {
            "verseNumber": 25,
            "verseString": "He is only a man with delusions. Just ignore him for a while.”"
        },
        {
            "verseNumber": 26,
            "verseString": "He prayed, “My Lord, assist me, because they have rejected me.”"
        },
        {
            "verseNumber": 27,
            "verseString": "We revealed to him: “Construct the Ark under Our observation and by Our inspiration. When Our command comes, and the oven overflows, take on board a pair of every kind, and your family, excluding those upon whom the sentence has been pronounced. And don’t plead with Me on behalf of those who did wrong; they are to be drowned.”"
        },
        {
            "verseNumber": 28,
            "verseString": "When you and those with you are settled in the Ark, say, “Praise be to God who has delivered us from the wrong-doing people.”",
            "verseStringReplacedWithAllah": "When you and those with you are settled in the Ark, say, “Praise be to Allah who has delivered us from the wrong-doing people.”"
        },
        {
            "verseNumber": 29,
            "verseString": "And pray, “My Lord, make me land with a blessed landing, for You are the best to ensure a safe landing.”"
        },
        {
            "verseNumber": 30,
            "verseString": "In this, there are lessons, and We are constantly testing."
        },
        {
            "verseNumber": 31,
            "verseString": "Then, after them, We established another generation."
        },
        {
            "verseNumber": 32,
            "verseString": "We sent a messenger from among them, proclaiming, “Worship God; you have no deity other than Him. Won’t you protect yourselves?”",
            "verseStringReplacedWithAllah": "We sent a messenger from among them, proclaiming, “Worship Allah; you have no deity other than Him. Won’t you protect yourselves?”"
        },
        {
            "verseNumber": 33,
            "verseString": "The leaders of his people who disbelieved and denied the meeting in the Hereafter, and We had given them affluence in the worldly life, countered, “This is merely a man like you, who eats what you eat and drinks what you drink."
        },
        {
            "verseNumber": 34,
            "verseString": "If you obey a man like yourselves, you will surely be at a loss."
        },
        {
            "verseNumber": 35,
            "verseString": "Does he promise you that, when you die and become dust and bones, you will be resurrected?"
        },
        {
            "verseNumber": 36,
            "verseString": "Far-fetched, far-fetched is what you’re promised."
        },
        {
            "verseNumber": 37,
            "verseString": "Our life is only this present existence; we live, die, and won’t be resurrected."
        },
        {
            "verseNumber": 38,
            "verseString": "He is just a man inventing lies about God, and we’re not going to believe in him.”",
            "verseStringReplacedWithAllah": "He is just a man inventing lies about Allah, and we’re not going to believe in him.”"
        },
        {
            "verseNumber": 39,
            "verseString": "He pleaded, “My Lord, assist me, because they have denied me.”"
        },
        {
            "verseNumber": 40,
            "verseString": "He replied, “In a little while, they will be regretful.”"
        },
        {
            "verseNumber": 41,
            "verseString": "The blast justly overtook them, reducing them to ruins. Thus, the wrongdoers were no more."
        },
        {
            "verseNumber": 42,
            "verseString": "Then, after them, We raised up other generations."
        },
        {
            "verseNumber": 43,
            "verseString": "No nation can advance its term, nor delay it."
        },
        {
            "verseNumber": 44,
            "verseString": "We sent Our messengers in succession. Whenever a messenger came to his people, they denied him, branding him a liar. So, We made them follow each other, turning them into tales of the past. So, away with those who refuse to believe!"
        },
        {
            "verseNumber": 45,
            "verseString": "Then, We sent Moses and his brother Aaron with Our signs and a clear authority."
        },
        {
            "verseNumber": 46,
            "verseString": "To Pharaoh and his aristocracy, they reacted with arrogance and superiority."
        },
        {
            "verseNumber": 47,
            "verseString": "They said, “Are we to believe in two men like us, while their people serve us as slaves?”"
        },
        {
            "verseNumber": 48,
            "verseString": "Thus, they rejected them both and were consequently doomed to destruction."
        },
        {
            "verseNumber": 49,
            "verseString": "We gave Moses the Scripture, so they may be guided."
        },
        {
            "verseNumber": 50,
            "verseString": "And We made the son of Mary and his mother a sign, and We sheltered them on a plateau with security and flowing springs."
        },
        {
            "verseNumber": 51,
            "verseString": "O Messengers, eat from the pure and good foods, and do good deeds. I am fully aware of everything you do."
        },
        {
            "verseNumber": 52,
            "verseString": "This community of yours is one community, and I am your Lord, so fear Me."
        },
        {
            "verseNumber": 53,
            "verseString": "Yet they fragmented into denominations, each rejoicing in its doctrines."
        },
        {
            "verseNumber": 54,
            "verseString": "So leave them in their bewilderment until a time."
        },
        {
            "verseNumber": 55,
            "verseString": "Do they assume that by granting them wealth and children."
        },
        {
            "verseNumber": 56,
            "verseString": "We are racing to give them good things? They don’t perceive."
        },
        {
            "verseNumber": 57,
            "verseString": "And those who, due to the fear of their Lord, are apprehensive."
        },
        {
            "verseNumber": 58,
            "verseString": "And those who believe in the signs of their Lord."
        },
        {
            "verseNumber": 59,
            "verseString": "And those who don’t associate anything with their Lord."
        },
        {
            "verseNumber": 60,
            "verseString": "And those who give what they give with hearts trembling, because they will return to their Lord."
        },
        {
            "verseNumber": 61,
            "verseString": "These are the ones who compete in goodness and are foremost in doing so."
        },
        {
            "verseNumber": 62,
            "verseString": "We don’t burden a soul beyond its capacity. With Us is a record that speaks with truth, and they won’t be wronged."
        },
        {
            "verseNumber": 63,
            "verseString": "But rather, their hearts are in confusion over this, and they engage in deeds that contradict it."
        },
        {
            "verseNumber": 64,
            "verseString": "Until, when We seize their elite with torment, they begin to groan."
        },
        {
            "verseNumber": 65,
            "verseString": "Don’t groan today; you will receive no assistance from Us."
        },
        {
            "verseNumber": 66,
            "verseString": "My verses were conveyed to you, yet you backed away from them."
        },
        {
            "verseNumber": 67,
            "verseString": "You reacted arrogantly towards them, debated against them baselessly, and outright rejected them."
        },
        {
            "verseNumber": 68,
            "verseString": "Don’t they ponder over the Word? Or did news come to them that didn’t come to their ancestors?"
        },
        {
            "verseNumber": 69,
            "verseString": "Or did they fail to recognize their Messenger, and thus, they deny him?"
        },
        {
            "verseNumber": 70,
            "verseString": "Or do they say, “He is possessed”? In fact, he brought them the truth, and most of them hate the truth."
        },
        {
            "verseNumber": 71,
            "verseString": "If the truth were to follow their desires, the heavens, the earth, and everything within them would surely be in chaos. We gave them their reminder, yet they disregard their reminder."
        },
        {
            "verseNumber": 72,
            "verseString": "Are you demanding a fee from them? The reward from your Lord is far better, for He is the best of providers."
        },
        {
            "verseNumber": 73,
            "verseString": "You are inviting them to a straight path."
        },
        {
            "verseNumber": 74,
            "verseString": "Yet, those who don’t believe in the Hereafter veer away from the path."
        },
        {
            "verseNumber": 75,
            "verseString": "Even if We were to show them mercy and alleviate their troubles, they would stubbornly persist in their transgression, wandering blindly."
        },
        {
            "verseNumber": 76,
            "verseString": "We had afflicted them, yet they didn’t turn to their Lord or humble themselves."
        },
        {
            "verseNumber": 77,
            "verseString": "Until, when We opened upon them a gate of intense pain, they were left in utter despair."
        },
        {
            "verseNumber": 78,
            "verseString": "It is He who endowed you with hearing, sight, and hearts, yet you rarely give thanks."
        },
        {
            "verseNumber": 79,
            "verseString": "It is He who scattered you throughout the earth, and to Him, you will be gathered."
        },
        {
            "verseNumber": 80,
            "verseString": "It is He who gives life and causes death, and His is the alternation of night and day. Don’t you comprehend?"
        },
        {
            "verseNumber": 81,
            "verseString": "They merely repeat what was said by those before them."
        },
        {
            "verseNumber": 82,
            "verseString": "They question, “After we have died and become dust and bones, will we be resurrected?"
        },
        {
            "verseNumber": 83,
            "verseString": "We and our forefathers were promised this before—these are nothing but legends of the ancients.”"
        },
        {
            "verseNumber": 84,
            "verseString": "Ask them, “To whom does the earth and everything on it belong, if you truly know?”"
        },
        {
            "verseNumber": 85,
            "verseString": "They will respond, “To God.” Say, “Then why don’t you reflect?”",
            "verseStringReplacedWithAllah": "They will respond, “To Allah.” Say, “Then why don’t you reflect?”"
        },
        {
            "verseNumber": 86,
            "verseString": "Ask them, “Who is the Lord of the seven heavens and the Lord of the Majestic Throne?”"
        },
        {
            "verseNumber": 87,
            "verseString": "They will answer, “God.” Say, “Won’t you be righteous?”",
            "verseStringReplacedWithAllah": "They will answer, “Allah.” Say, “Won’t you be righteous?”"
        },
        {
            "verseNumber": 88,
            "verseString": "Say, “In whose hands is sovereignty over everything, and He provides protection but requires none, if you truly possess knowledge?”"
        },
        {
            "verseNumber": 89,
            "verseString": "They will say, “God.” Say, “Then how are you bewitched?”",
            "verseStringReplacedWithAllah": "They will say, “Allah.” Say, “Then how are you bewitched?”"
        },
        {
            "verseNumber": 90,
            "verseString": "We brought them the truth, yet they persist in denial."
        },
        {
            "verseNumber": 91,
            "verseString": "God has never begotten a child, nor is there any god besides Him. If there were, each god would have claimed what it created, and some would’ve sought supremacy over others. Glory be to God, far beyond what they describe.",
            "verseStringReplacedWithAllah": "Allah has never begotten a child, nor is there any god besides Him. If there were, each god would have claimed what it created, and some would’ve sought supremacy over others. Glory be to Allah, far beyond what they describe."
        },
        {
            "verseNumber": 92,
            "verseString": "He is the Knower of the unseen and the seen, far above having a partner."
        },
        {
            "verseNumber": 93,
            "verseString": "Say, “My Lord! If You should show me what they’ve been promised."
        },
        {
            "verseNumber": 94,
            "verseString": "My Lord, place me not among the wrongdoers.”"
        },
        {
            "verseNumber": 95,
            "verseString": "We can show you what We’ve promised them."
        },
        {
            "verseNumber": 96,
            "verseString": "Repel evil with what’s better. We know best what they describe."
        },
        {
            "verseNumber": 97,
            "verseString": "And say, “My Lord, I seek refuge in You from the whispers of the devils."
        },
        {
            "verseNumber": 98,
            "verseString": "And I seek Your protection, my Lord, lest they become present.”"
        },
        {
            "verseNumber": 99,
            "verseString": "Until, when death comes to one of them, he pleads, “My Lord, let me return."
        },
        {
            "verseNumber": 100,
            "verseString": "So that I may rectify what I left undone.” By no means! It is merely a word he says; a barrier stands behind them until the Day they are resurrected."
        },
        {
            "verseNumber": 101,
            "verseString": "When the Trumpet is blown, on that Day, all familial ties among them will be severed, and they won’t have the means to inquire after one another."
        },
        {
            "verseNumber": 102,
            "verseString": "Those whose scales are heavy will be the successful ones."
        },
        {
            "verseNumber": 103,
            "verseString": "However, those with light scales will have lost their souls, remaining in Hell forever."
        },
        {
            "verseNumber": 104,
            "verseString": "The Flames will scorch their faces, disfiguring them beyond recognition."
        },
        {
            "verseNumber": 105,
            "verseString": "“Were My verses not conveyed to you, yet you denied them?”"
        },
        {
            "verseNumber": 106,
            "verseString": "They will respond, “Our Lord, our wretchedness overcame us, and we were led astray."
        },
        {
            "verseNumber": 107,
            "verseString": "Our Lord, remove us from this. If we were to revert, we would indeed be wrongdoers.”"
        },
        {
            "verseNumber": 108,
            "verseString": "He will say, “Remain despised therein, and don’t speak to Me."
        },
        {
            "verseNumber": 109,
            "verseString": "A group of My servants used to say, ‘Our Lord, we have believed, so forgive us, and have mercy on us, You are the Best of the Merciful.’"
        },
        {
            "verseNumber": 110,
            "verseString": "But you made fun of them, to the extent that it made you forget My remembrance, and you used to laugh at them."
        },
        {
            "verseNumber": 111,
            "verseString": "“Today, I have rewarded them for their patience; truly, they are the ones who have triumphed.”"
        },
        {
            "verseNumber": 112,
            "verseString": "He will ask, “How long did you stay on Earth in terms of years?”"
        },
        {
            "verseNumber": 113,
            "verseString": "They will answer, “We stayed a day or part of a day; ask those who count.”"
        },
        {
            "verseNumber": 114,
            "verseString": "He will say, “In fact, you stayed only a little—if only you had known."
        },
        {
            "verseNumber": 115,
            "verseString": "Did you think that We created you without purpose, and that you wouldn’t be returned to Us?”"
        },
        {
            "verseNumber": 116,
            "verseString": "So exalted is God, the True King. There is no deity except Him, the Lord of the Noble Throne.",
            "verseStringReplacedWithAllah": "So exalted is Allah, the True King. There is no deity except Him, the Lord of the Noble Throne."
        },
        {
            "verseNumber": 117,
            "verseString": "Whoever invokes, beside God, another god for which he has no proof, then his account rests with his Lord. The unbelievers won’t succeed.",
            "verseStringReplacedWithAllah": "Whoever invokes, beside Allah, another god for which he has no proof, then his account rests with his Lord. The unbelievers won’t succeed."
        },
        {
            "verseNumber": 118,
            "verseString": "Say, “My Lord, forgive and have mercy, for You are the Best of the merciful.”"
        }
    ],
    "chapterNumber": 23,
    "nameInEnglish": "The Believers",
    "nameInTransliteration": "Al Muminun",
    "nameInArabic": "المؤمنون",
    "numberOfVerses": 118
}