{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif. Lam. Ra. These are the verses of the clear, enlightening Scripture."
        },
        {
            "verseNumber": 2,
            "verseString": "We revealed it as an Arabic Quran, so that you may understand."
        },
        {
            "verseNumber": 3,
            "verseString": "Through this Quran, we narrate to you the most accurate of stories, although you were previously unaware."
        },
        {
            "verseNumber": 4,
            "verseString": "Joseph said to his father, “O my father, I saw eleven stars, and the sun, and the moon; I saw them prostrating to me.”"
        },
        {
            "verseNumber": 5,
            "verseString": "He responded, “O my son, don’t disclose your vision to your brothers, lest they conspire against you. For Satan is man’s outright enemy."
        },
        {
            "verseNumber": 6,
            "verseString": "Your Lord will choose you, teach you the interpretation of narratives, and complete His favor upon you and upon Jacob’s lineage, as He completed it before upon your forefathers, Abraham and Isaac. Your Lord is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 7,
            "verseString": "In the story of Joseph and his brothers, there are signs for those who inquire."
        },
        {
            "verseNumber": 8,
            "verseString": "They grumbled, “Our father is more affectionate to Joseph and his brother than to us, despite our greater number. Our father is clearly misguided.”"
        },
        {
            "verseNumber": 9,
            "verseString": "“Kill Joseph, or throw him out to a distant land, so that your father’s attention will be exclusively yours. After which, you can be people of righteousness.”"
        },
        {
            "verseNumber": 10,
            "verseString": "One of them suggested, “Don’t kill Joseph, but if you are committed to doing something, throw him into the bottom of a well. Some passing caravan may pick him up.”"
        },
        {
            "verseNumber": 11,
            "verseString": "They said, “O our father, why don’t you trust us with Joseph, while we are truly his well-wishers?"
        },
        {
            "verseNumber": 12,
            "verseString": "Let him join us tomorrow for play and fun. We will surely protect him.”"
        },
        {
            "verseNumber": 13,
            "verseString": "He replied, “It saddens me that you should take him away. I fear a wolf might devour him while you’re negligent of him.”"
        },
        {
            "verseNumber": 14,
            "verseString": "They replied, “If a wolf were to devour him while we’re a strong group, then we would be truly losers.”"
        },
        {
            "verseNumber": 15,
            "verseString": "So, when they took him and agreed to put him into the bottom of the well, We inspired him: “You will inform them of this deed of theirs when they don’t realize.”"
        },
        {
            "verseNumber": 16,
            "verseString": "And they came to their father at night, crying."
        },
        {
            "verseNumber": 17,
            "verseString": "They said, “O our father, we were racing each other and left Joseph with our belongings, and a wolf ate him. But you won’t believe us, even if we are truthful.”"
        },
        {
            "verseNumber": 18,
            "verseString": "And they presented his shirt, stained with false blood. He said, “Rather, your souls lured you into something. Yet patience is beautiful. May God’s help be sought against what you claim.”",
            "verseStringReplacedWithAllah": "And they presented his shirt, stained with false blood. He said, “Rather, your souls lured you into something. Yet patience is beautiful. May Allah’s help be sought against what you claim.”"
        },
        {
            "verseNumber": 19,
            "verseString": "A passing caravan arrived, and they sent their water drawer. He lowered his bucket and said, “Oh, good news! Here is a boy!” And they concealed him as merchandise, but God knew well what they did.",
            "verseStringReplacedWithAllah": "A passing caravan arrived, and they sent their water drawer. He lowered his bucket and said, “Oh, good news! Here is a boy!” And they concealed him as merchandise, but Allah knew well what they did."
        },
        {
            "verseNumber": 20,
            "verseString": "They sold him for a low price, a few coins, so little did they value him."
        },
        {
            "verseNumber": 21,
            "verseString": "The man from Egypt who bought him said to his wife, “Make his stay comfortable; perhaps he can benefit us, or we might adopt him as a son.” And thus, We established Joseph in the land, and We taught him the interpretation of events. God’s command is always executed, but most people don’t know.",
            "verseStringReplacedWithAllah": "The man from Egypt who bought him said to his wife, “Make his stay comfortable; perhaps he can benefit us, or we might adopt him as a son.” And thus, We established Joseph in the land, and We taught him the interpretation of events. Allah’s command is always executed, but most people don’t know."
        },
        {
            "verseNumber": 22,
            "verseString": "Upon reaching his maturity, We gifted him with wisdom and knowledge. This is how We reward those who do good."
        },
        {
            "verseNumber": 23,
            "verseString": "And she, in whose house he was, sought to seduce him. She closed the doors and said, “Come to me!” He responded, “God forbid! He is my master, he treats me well, and the wrongdoers never succeed.”",
            "verseStringReplacedWithAllah": "And she, in whose house he was, sought to seduce him. She closed the doors and said, “Come to me!” He responded, “Allah forbid! He is my master, he treats me well, and the wrongdoers never succeed.”"
        },
        {
            "verseNumber": 24,
            "verseString": "She desired him, and he desired her had he not seen his Lord’s evidence. Thus, We diverted evil and indecency from him; he was one of Our devoted servants."
        },
        {
            "verseNumber": 25,
            "verseString": "They raced to the door, and she tore his shirt from behind. They encountered her husband at the door, to whom she cried, “What’s the penalty for someone who intended harm to your family, if not imprisonment or a severe punishment?”"
        },
        {
            "verseNumber": 26,
            "verseString": "He said, “It was she who tried to seduce me.” A witness from her family suggested, “If his shirt is torn from the front, then she told the truth, and he is the liar."
        },
        {
            "verseNumber": 27,
            "verseString": "But if his shirt is torn from the back, she has lied, and he is the truthful one.”"
        },
        {
            "verseNumber": 28,
            "verseString": "Seeing his shirt torn from the back, he said, “This is one of your cunning tricks. Your scheming is indeed considerable.”"
        },
        {
            "verseNumber": 29,
            "verseString": "“Joseph, overlook this. And you, woman, ask forgiveness for your sin. You are certainly in the wrong.”"
        },
        {
            "verseNumber": 30,
            "verseString": "Some women in the city said, “The governor’s wife is trying to seduce her servant; she is deeply in love with him. We see her as clearly misguided.”"
        },
        {
            "verseNumber": 31,
            "verseString": "Upon hearing their whispers, she invited them over, prepared a feast for them, and gave each of them a knife. She then commanded, “Come out before them!” When they saw him, they marveled at him and cut their hands, exclaiming, “God preserve us! This is not a human! This is none other than a noble angel.”",
            "verseStringReplacedWithAllah": "Upon hearing their whispers, she invited them over, prepared a feast for them, and gave each of them a knife. She then commanded, “Come out before them!” When they saw him, they marveled at him and cut their hands, exclaiming, “Allah preserve us! This is not a human! This is none other than a noble angel.”"
        },
        {
            "verseNumber": 32,
            "verseString": "She said, “This is the one for whom you blamed me for. Yes, I tried to seduce him, but he firmly resisted. If he doesn’t do as I command him, he will be imprisoned and will become humiliated.”"
        },
        {
            "verseNumber": 33,
            "verseString": "He said, “My Lord, prison is more desirable to me than what they call me to. Unless You divert their plot from me, I might incline toward them and become of the ignorant.”"
        },
        {
            "verseNumber": 34,
            "verseString": "His Lord answered his prayer and averted their scheme from him. He is the All-Hearing, the All-Knowing."
        },
        {
            "verseNumber": 35,
            "verseString": "It seemed good to them, after they had seen the proofs, to imprison him for a time."
        },
        {
            "verseNumber": 36,
            "verseString": "Two young men entered the prison with him. One of them said, “I saw myself pressing wine.” The other said, “I saw myself carrying bread on my head, from which birds were eating. Tell us its interpretation, for we see you as a man of virtue.”"
        },
        {
            "verseNumber": 37,
            "verseString": "He replied, “I will inform you of their interpretation before your meal arrives. This is from the knowledge that my Lord has taught me. I have departed from the creed of people who don’t believe in God and deny the Hereafter.",
            "verseStringReplacedWithAllah": "He replied, “I will inform you of their interpretation before your meal arrives. This is from the knowledge that my Lord has taught me. I have departed from the creed of people who don’t believe in Allah and deny the Hereafter."
        },
        {
            "verseNumber": 38,
            "verseString": "“I adhere to the faith of my forefathers, Abraham, Isaac, and Jacob. It’s not for us to associate partners with God. This is from God’s grace upon us and upon humanity, yet most people are not thankful.”",
            "verseStringReplacedWithAllah": "“I adhere to the faith of my forefathers, Abraham, Isaac, and Jacob. It’s not for us to associate partners with Allah. This is from Allah’s grace upon us and upon humanity, yet most people are not thankful.”"
        },
        {
            "verseNumber": 39,
            "verseString": "“My fellow inmates, are many different lords better, or God, the One, the Supreme?",
            "verseStringReplacedWithAllah": "“My fellow inmates, are many different lords better, or Allah, the One, the Supreme?"
        },
        {
            "verseNumber": 40,
            "verseString": "You are only worshiping names that you and your fathers have invented, without having any authority from God. The command rests solely with God. He decreed that you worship none but Him. This is the right religion, but most people don’t know.",
            "verseStringReplacedWithAllah": "You are only worshiping names that you and your fathers have invented, without having any authority from Allah. The command rests solely with Allah. He decreed that you worship none but Him. This is the right religion, but most people don’t know."
        },
        {
            "verseNumber": 41,
            "verseString": "O my fellow prisoners, one of you will serve his master wine, while the other will be crucified, and birds will eat from his head. The issue you inquired about has been decided.”"
        },
        {
            "verseNumber": 42,
            "verseString": "He said to the one he thought would be released, “Mention me to your master.” But Satan caused him to forget his lord’s mention, so he remained in prison for some years."
        },
        {
            "verseNumber": 43,
            "verseString": "The king said, “I saw seven fat cows being eaten by seven lean ones, and seven green spikes of grain and others dry. O nobles, interpret my vision for me, if you can interpret visions.”"
        },
        {
            "verseNumber": 44,
            "verseString": "They replied, “A jumble of dreams, and we don’t know the interpretation of dreams.”"
        },
        {
            "verseNumber": 45,
            "verseString": "Then the one of the two who was saved, remembered after a period of time, and said, “I will tell you its interpretation, so send me.”"
        },
        {
            "verseNumber": 46,
            "verseString": "“Joseph, O truthful one, explain to us seven fat cows being eaten by seven lean ones, and seven green spikes of grain and others dry, that I may return to the people, so they may know.”"
        },
        {
            "verseNumber": 47,
            "verseString": "He said, “You will cultivate for seven consecutive years, and what you harvest, leave it in its spikes, except for a little which you will eat.”"
        },
        {
            "verseNumber": 48,
            "verseString": "“Then will follow seven difficult years which will consume what you saved for them, except for a little of what you have stored.”"
        },
        {
            "verseNumber": 49,
            "verseString": "“Then, after that, there will come a year in which the people will receive abundant rain and will press.”"
        },
        {
            "verseNumber": 50,
            "verseString": "The king said, “Bring him to me!” And when the messenger came to him, he said, “Return to your master and ask him about the women who cut their hands. My Lord is fully aware of their scheming.”"
        },
        {
            "verseNumber": 51,
            "verseString": "Then, when they were asked, “What was your aim when you tried to seduce Joseph, “What was your motive when you tried to seduce Joseph?” They responded, “God forbid! We know of no ill conduct on his part.” The governor’s wife then confessed, “Now the truth has now emerged; it was I who sought to seduce him, and he is truthful.”",
            "verseStringReplacedWithAllah": "Then, when they were asked, “What was your aim when you tried to seduce Joseph, “What was your motive when you tried to seduce Joseph?” They responded, “Allah forbid! We know of no ill conduct on his part.” The governor’s wife then confessed, “Now the truth has now emerged; it was I who sought to seduce him, and he is truthful.”"
        },
        {
            "verseNumber": 52,
            "verseString": "“This is so he may know that I didn’t betray him in his absence, and that God doesn’t guide the scheming of the betrayers.”",
            "verseStringReplacedWithAllah": "“This is so he may know that I didn’t betray him in his absence, and that Allah doesn’t guide the scheming of the betrayers.”"
        },
        {
            "verseNumber": 53,
            "verseString": "“I don’t claim innocence for myself. The soul is predisposed to evil, except those my Lord bestows mercy upon. My Lord is Forgiving and Merciful.”"
        },
        {
            "verseNumber": 54,
            "verseString": "The king said, “Bring him to me. I will appoint him exclusively for myself.” When he talked to him, he said, “Today, you are with us established and trusted.”"
        },
        {
            "verseNumber": 55,
            "verseString": "He proposed, “Appoint me over the land’s storehouses; I am a reliable and knowledgeable custodian.”"
        },
        {
            "verseNumber": 56,
            "verseString": "Thus, We established Joseph in the land, granting him the freedom to reside wherever he desired. We bestow Our mercy upon whom We will, and We never let the reward of the righteous be lost."
        },
        {
            "verseNumber": 57,
            "verseString": "But, the reward of the Hereafter is better for those who believe and maintain righteousness."
        },
        {
            "verseNumber": 58,
            "verseString": "Joseph’s brothers came, and he recognized them when they arrived, but they didn’t recognize him."
        },
        {
            "verseNumber": 59,
            "verseString": "While preparing their supplies, he said, “Bring me your brother from your father’s side. Don’t you see that I give full measure and am the best of hosts?”"
        },
        {
            "verseNumber": 60,
            "verseString": "“If you don’t bring him to me, you will receive no supplies from me, and you won’t be permitted near me.”"
        },
        {
            "verseNumber": 61,
            "verseString": "They replied, “We will convince his father to send him with us, and we will surely do it.”"
        },
        {
            "verseNumber": 62,
            "verseString": "He then instructed his servants, “Place their money back into their saddlebags, so they may recognize it when they return to their family, that they might return.”"
        },
        {
            "verseNumber": 63,
            "verseString": "Upon their return to their father, they pleaded, “Father, we will be denied further supplies unless you send our brother with us. Indeed, we are his protectors.”"
        },
        {
            "verseNumber": 64,
            "verseString": "He replied, “Shall I entrust him to you, when I had previously entrusted his brother to you? But God is the best guardian, and He is the most merciful of the merciful.”",
            "verseStringReplacedWithAllah": "He replied, “Shall I entrust him to you, when I had previously entrusted his brother to you? But Allah is the best guardian, and He is the most merciful of the merciful.”"
        },
        {
            "verseNumber": 65,
            "verseString": "When they opened their bags, they discovered their money had been restored to them. They exclaimed, “Father, what more could we desire? This is our money, returned to us in full. Now, we can give food to our family, safeguard our brother, and acquire an additional load of provisions. That extra load is easily obtainable for us.”"
        },
        {
            "verseNumber": 66,
            "verseString": "He responded, “I won’t send him with you, until you swear by God, that you will bring him back to me, unless you become surrounded.” And when they gave him their promise, he said, “God is the overseer of what we say.”",
            "verseStringReplacedWithAllah": "He responded, “I won’t send him with you, until you swear by Allah, that you will bring him back to me, unless you become surrounded.” And when they gave him their promise, he said, “Allah is the overseer of what we say.”"
        },
        {
            "verseNumber": 67,
            "verseString": "He said, “My sons, don’t enter from one gate, but enter from different gates. I cannot avail you against God at all. The decree belongs solely to God. I trust in Him, and upon Him, those who trust should trust.”",
            "verseStringReplacedWithAllah": "He said, “My sons, don’t enter from one gate, but enter from different gates. I cannot avail you against Allah at all. The decree belongs solely to Allah. I trust in Him, and upon Him, those who trust should trust.”"
        },
        {
            "verseNumber": 68,
            "verseString": "Despite entering as their father had instructed them, it didn’t alter God’s plan. But it was a need in Jacob’s soul. He was endowed with knowledge from what We had taught him, but most people don’t know.",
            "verseStringReplacedWithAllah": "Despite entering as their father had instructed them, it didn’t alter Allah’s plan. But it was a need in Jacob’s soul. He was endowed with knowledge from what We had taught him, but most people don’t know."
        },
        {
            "verseNumber": 69,
            "verseString": "When they presented themselves to Joseph, he drew his brother close to him, and he whispered, “I am your brother, so don’t be disheartened by their behavior.”"
        },
        {
            "verseNumber": 70,
            "verseString": "As he prepared their provisions, he discreetly placed the goblet in his brother’s saddlebag. Then a herald shouted, “O people of the caravan! You are surely thieves!”"
        },
        {
            "verseNumber": 71,
            "verseString": "Upon being summoned, they were asked, “What have you lost?”"
        },
        {
            "verseNumber": 72,
            "verseString": "“We lost the king’s goblet,” they replied. “Whoever brings it will receive a camel-load, and I guarantee it.”"
        },
        {
            "verseNumber": 73,
            "verseString": "They responded, “By God, you surely know that we didn’t come to cause disorder in the land, and we aren’t thieves.”",
            "verseStringReplacedWithAllah": "They responded, “By Allah, you surely know that we didn’t come to cause disorder in the land, and we aren’t thieves.”"
        },
        {
            "verseNumber": 74,
            "verseString": "They were further asked, “What should be his penalty if you are proven to be lying?”"
        },
        {
            "verseNumber": 75,
            "verseString": "They replied, “His penalty—if it’s found in his bag—will be that he will become yours. This is how we penalize the wrongdoers.”"
        },
        {
            "verseNumber": 76,
            "verseString": "He began with their bags before his brother’s, and eventually, he retrieved it from his brother’s bag. Thus did We devise a plan for Joseph. He couldn’t have detained his brother under the king’s law, unless God had so willed. We raise in ranks whom We will, and above every possessor of knowledge, there is One more knowledgeable.",
            "verseStringReplacedWithAllah": "He began with their bags before his brother’s, and eventually, he retrieved it from his brother’s bag. Thus did We devise a plan for Joseph. He couldn’t have detained his brother under the king’s law, unless Allah had so willed. We raise in ranks whom We will, and above every possessor of knowledge, there is One more knowledgeable."
        },
        {
            "verseNumber": 77,
            "verseString": "They exclaimed, “If he has stolen, a brother of his committed theft before.” But Joseph kept this to himself and didn’t disclose it to them. He said, “You’re in a worse position, and God knows best what you describe.”",
            "verseStringReplacedWithAllah": "They exclaimed, “If he has stolen, a brother of his committed theft before.” But Joseph kept this to himself and didn’t disclose it to them. He said, “You’re in a worse position, and Allah knows best what you describe.”"
        },
        {
            "verseNumber": 78,
            "verseString": "They pleaded, “O Noble one, he has an elderly father, so take one of us in his place. We see you as a good-doer.”"
        },
        {
            "verseNumber": 79,
            "verseString": "He replied, “God forbid that we should take anyone but him with whom we found our property. Otherwise, we would be unjust.”",
            "verseStringReplacedWithAllah": "He replied, “Allah forbid that we should take anyone but him with whom we found our property. Otherwise, we would be unjust.”"
        },
        {
            "verseNumber": 80,
            "verseString": "When they despaired of him, they withdrew to confer privately. Their eldest said, “Don’t you remember that your father received a solemn pledge from you before God, and how you were previously lax towards Joseph? I won’t leave this land until my father permits me, or God decides for me. He is the best of judges.”",
            "verseStringReplacedWithAllah": "When they despaired of him, they withdrew to confer privately. Their eldest said, “Don’t you remember that your father received a solemn pledge from you before Allah, and how you were previously lax towards Joseph? I won’t leave this land until my father permits me, or Allah decides for me. He is the best of judges.”"
        },
        {
            "verseNumber": 81,
            "verseString": "“Go back to your father, and say, ‘O our father, your son committed theft, and we testify only to what we know, and we couldn’t guard against the unforeseen.’”"
        },
        {
            "verseNumber": 82,
            "verseString": "“Also, ask about the town where we’ve been, the caravan in which we returned; we are being truthful.”"
        },
        {
            "verseNumber": 83,
            "verseString": "He said, “Rather, your souls lured you to something. Yet, patience is beautiful. Perhaps God will bring them all back to me. He is the All-Knowing, the All-Wise.”",
            "verseStringReplacedWithAllah": "He said, “Rather, your souls lured you to something. Yet, patience is beautiful. Perhaps Allah will bring them all back to me. He is the All-Knowing, the All-Wise.”"
        },
        {
            "verseNumber": 84,
            "verseString": "Then he turned away from them, lamenting, “Oh, my grief for Joseph!” His eyes turned white from grief, and he became depressed."
        },
        {
            "verseNumber": 85,
            "verseString": "They exclaimed, “By God, you won’t stop remembering Joseph until you ruin your health, or until you pass away.”",
            "verseStringReplacedWithAllah": "They exclaimed, “By Allah, you won’t stop remembering Joseph until you ruin your health, or until you pass away.”"
        },
        {
            "verseNumber": 86,
            "verseString": "He replied, “I only express my distress and anguish to God, and I know from God what you don’t know.”",
            "verseStringReplacedWithAllah": "He replied, “I only express my distress and anguish to Allah, and I know from Allah what you don’t know.”"
        },
        {
            "verseNumber": 87,
            "verseString": "“O my sons, go and search for Joseph and his brother, and never despair of God’s mercy. None despairs of God’s mercy except the disbelieving people.”",
            "verseStringReplacedWithAllah": "“O my sons, go and search for Joseph and his brother, and never despair of Allah’s mercy. None despairs of Allah’s mercy except the disbelieving people.”"
        },
        {
            "verseNumber": 88,
            "verseString": "Upon entering his presence, they pleaded, “Your Excellency, adversity has touched us and our family, and we brought only a paltry sum. Please, give us full measure and be charitable to us. Truly, God rewards the charitable.”",
            "verseStringReplacedWithAllah": "Upon entering his presence, they pleaded, “Your Excellency, adversity has touched us and our family, and we brought only a paltry sum. Please, give us full measure and be charitable to us. Truly, Allah rewards the charitable.”"
        },
        {
            "verseNumber": 89,
            "verseString": "He asked, “Do you remember what you did with Joseph and his brother in your ignorance?”"
        },
        {
            "verseNumber": 90,
            "verseString": "They exclaimed, “Could you possibly be Joseph?” He confirmed, “I am Joseph, and this is my brother. God has indeed been gracious to us. Whoever is righteous and patient—God never wastes the reward of the good-doers.”",
            "verseStringReplacedWithAllah": "They exclaimed, “Could you possibly be Joseph?” He confirmed, “I am Joseph, and this is my brother. Allah has indeed been gracious to us. Whoever is righteous and patient—Allah never wastes the reward of the good-doers.”"
        },
        {
            "verseNumber": 91,
            "verseString": "They admitted, “By God, truly God has preferred you over us, and we were indeed at fault.”",
            "verseStringReplacedWithAllah": "They admitted, “By Allah, truly Allah has preferred you over us, and we were indeed at fault.”"
        },
        {
            "verseNumber": 92,
            "verseString": "He responded, “There will be no blame on you today. May God forgive you, for He is the Most Merciful of the merciful.”",
            "verseStringReplacedWithAllah": "He responded, “There will be no blame on you today. May Allah forgive you, for He is the Most Merciful of the merciful.”"
        },
        {
            "verseNumber": 93,
            "verseString": "“Take my shirt, and lay it over my father’s face, and he will regain his sight. And bring your entire family to me.”"
        },
        {
            "verseNumber": 94,
            "verseString": "As the caravan departed, their father said, “I can sense the scent of Joseph, even though you think I’m senile.”"
        },
        {
            "verseNumber": 95,
            "verseString": "They replied, “By God, you are still in your old delusions.”",
            "verseStringReplacedWithAllah": "They replied, “By Allah, you are still in your old delusions.”"
        },
        {
            "verseNumber": 96,
            "verseString": "When the bearer of good news arrived, he placed it on his face, and he regained his sight. He said, “Didn’t I tell you that I know from God what you don’t know?”",
            "verseStringReplacedWithAllah": "When the bearer of good news arrived, he placed it on his face, and he regained his sight. He said, “Didn’t I tell you that I know from Allah what you don’t know?”"
        },
        {
            "verseNumber": 97,
            "verseString": "They pleaded, “O our father, seek forgiveness for our transgressions; we were indeed in the wrong.”"
        },
        {
            "verseNumber": 98,
            "verseString": "He replied, “I will seek your forgiveness from my Lord. He is the Forgiving, the Merciful.”"
        },
        {
            "verseNumber": 99,
            "verseString": "When they entered Joseph’s presence, he embraced his parents and said, “Enter Egypt, God willing, in peace and safety.”",
            "verseStringReplacedWithAllah": "When they entered Joseph’s presence, he embraced his parents and said, “Enter Egypt, Allah willing, in peace and safety.”"
        },
        {
            "verseNumber": 100,
            "verseString": "He then elevated his parents upon the throne, and they fell down in prostration to him. He said, “O my father, this fulfills my previous vision; my Lord made it come true. He has been good to me, releasing me from prison and bringing you from the desert after Satan had stirred up strife between me and my brothers. My Lord is Most Kind to whom He wills. He is the All-Knowing, the All-Wise.”"
        },
        {
            "verseNumber": 101,
            "verseString": "“My Lord, You’ve granted me some authority and taught me some interpretation of events—the Originator of the heavens and the earth. You’re my Protector in this world and the Hereafter. Receive my soul in submission, and unite me with the righteous.”"
        },
        {
            "verseNumber": 102,
            "verseString": "These are some of the narratives that We reveal to you. You weren’t present with them when they conspired and agreed on their plan."
        },
        {
            "verseNumber": 103,
            "verseString": "Despite your eagerness, most people aren’t believers."
        },
        {
            "verseNumber": 104,
            "verseString": "You ask for no compensation for it. It is merely a reminder to all of humanity."
        },
        {
            "verseNumber": 105,
            "verseString": "How many signs in the heavens and on earth do they pass by, yet they turn away from them?"
        },
        {
            "verseNumber": 106,
            "verseString": "Most of them don’t believe in God without associating others with Him.",
            "verseStringReplacedWithAllah": "Most of them don’t believe in Allah without associating others with Him."
        },
        {
            "verseNumber": 107,
            "verseString": "Are they confident that an encompassing calamity from God won’t come upon them, or that the Hour won’t come upon them suddenly while they don’t realize?",
            "verseStringReplacedWithAllah": "Are they confident that an encompassing calamity from Allah won’t come upon them, or that the Hour won’t come upon them suddenly while they don’t realize?"
        },
        {
            "verseNumber": 108,
            "verseString": "Say, “This is my way: I call to God with insight—I and those who follow me. Praise be to God, and I am not among the polytheists.”",
            "verseStringReplacedWithAllah": "Say, “This is my way: I call to Allah with insight—I and those who follow me. Praise be to Allah, and I am not among the polytheists.”"
        },
        {
            "verseNumber": 109,
            "verseString": "We sent none before you, except men whom We inspired, chosen from among the people of the towns. Didn’t they travel through the earth and observe the aftermath of those who preceded them? The home of the Hereafter is better for the righteous. Will you not, then, use reason?"
        },
        {
            "verseNumber": 110,
            "verseString": "When the messengers despaired, and thought that they were denied, Our help came to them. We save whom We will, and Our wrath can’t be repelled from the criminal people."
        },
        {
            "verseNumber": 111,
            "verseString": "In their stories, there are lessons for those of understanding. It is not an invented tale, but a confirmation of what preceded it, a detailed explanation of everything, and guidance and mercy for those who believe."
        }
    ],
    "chapterNumber": 12,
    "nameInEnglish": "Joseph",
    "nameInTransliteration": "Yusuf",
    "nameInArabic": "يوسف",
    "numberOfVerses": 111
}