{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif. Lam. Ra. These are the verses of the Wise Book."
        },
        {
            "verseNumber": 2,
            "verseString": "Is it a wonder to people that We revealed to a man from among them: “Warn humankind, and give good news to those who believe that they have a sure footing with their Lord?” Yet the unbelievers say, “This is definitely an obvious magician.”"
        },
        {
            "verseNumber": 3,
            "verseString": "Your Lord is God, who created the heavens and the earth in six periods, then established Himself on the Throne, governing all affairs. There is no intercessor except after His permission. That is God, your Lord, so worship Him. Will you not reflect?",
            "verseStringReplacedWithAllah": "Your Lord is Allah, who created the heavens and the earth in six periods, then established Himself on the Throne, governing all affairs. There is no intercessor except after His permission. That is Allah, your Lord, so worship Him. Will you not reflect?"
        },
        {
            "verseNumber": 4,
            "verseString": "To Him is your return, all of you. The promise of God is true. He originates creation, then He repeats it, to reward those who believe and perform righteous deeds with justice. But for those who disbelieve, for them is a drink of boiling water and painful punishment due to their denial.",
            "verseStringReplacedWithAllah": "To Him is your return, all of you. The promise of Allah is true. He originates creation, then He repeats it, to reward those who believe and perform righteous deeds with justice. But for those who disbelieve, for them is a drink of boiling water and painful punishment due to their denial."
        },
        {
            "verseNumber": 5,
            "verseString": "It is He who made the sun shining and the moon luminous, and determined its phases, so you may calculate the years and the passage of time. God didn’t create this except with truth. He explains the signs in detail for people who know.",
            "verseStringReplacedWithAllah": "It is He who made the sun shining and the moon luminous, and determined its phases, so you may calculate the years and the passage of time. Allah didn’t create this except with truth. He explains the signs in detail for people who know."
        },
        {
            "verseNumber": 6,
            "verseString": "In the alternation of night and day, and in what God created in the heavens and the earth, are signs for people who are mindful.",
            "verseStringReplacedWithAllah": "In the alternation of night and day, and in what Allah created in the heavens and the earth, are signs for people who are mindful."
        },
        {
            "verseNumber": 7,
            "verseString": "Those who don’t anticipate meeting Us and are content with life in this world, feel safe in it, and are ignorant of Our signs."
        },
        {
            "verseNumber": 8,
            "verseString": "For them, their refuge will be the Fire, because of what they used to earn."
        },
        {
            "verseNumber": 9,
            "verseString": "But for those who believe and perform righteous deeds, their Lord will guide them by their faith. Rivers will flow beneath them in the Gardens of Bliss."
        },
        {
            "verseNumber": 10,
            "verseString": "Their prayer therein will be, “Glorified are You, O God,” and their greeting therein will be, “Peace.” And the conclusion of their prayer will be, “Praise be to God, the Lord of the universes.”",
            "verseStringReplacedWithAllah": "Their prayer therein will be, “Glorified are You, O Allah,” and their greeting therein will be, “Peace.” And the conclusion of their prayer will be, “Praise be to Allah, the Lord of the universes.”"
        },
        {
            "verseNumber": 11,
            "verseString": "If God were to hasten evil for people, as they hasten good, their time would have been over. But We leave those who don’t look forward to meeting Us in their transgressions, blundering.",
            "verseStringReplacedWithAllah": "If Allah were to hasten evil for people, as they hasten good, their time would have been over. But We leave those who don’t look forward to meeting Us in their transgressions, blundering."
        },
        {
            "verseNumber": 12,
            "verseString": "When adversity touches a person, he prays to Us, whether lying on his side, sitting, or standing. But when We remove his adversity, he proceeds as if he had not reached out to Us in a predicament. Thus, the deeds of the transgressors are made to appear pleasing to them."
        },
        {
            "verseNumber": 13,
            "verseString": "We destroyed generations before you when they committed injustices. Their messengers had come to them with clear proofs, but were not going to believe. Thus do We recompense the guilty people."
        },
        {
            "verseNumber": 14,
            "verseString": "Then We made you successors in the earth after them—to see how you will behave."
        },
        {
            "verseNumber": 15,
            "verseString": "When Our clear verses are conveyed to them, those who don’t expect to meet Us say, “Bring us a Quran other than this, or change it.” Say, “It’s not for me to modify it of my own. I only follow what’s revealed to me. Should I disobey my Lord, I fear the punishment of a great Day.”"
        },
        {
            "verseNumber": 16,
            "verseString": "Say, “Had God willed, I wouldn’t have conveyed it to you, nor would He have made it known to you. I have lived among you a lifetime before it; will you not use your reason?”",
            "verseStringReplacedWithAllah": "Say, “Had Allah willed, I wouldn’t have conveyed it to you, nor would He have made it known to you. I have lived among you a lifetime before it; will you not use your reason?”"
        },
        {
            "verseNumber": 17,
            "verseString": "Who is more unjust than he who invents a lie about God or denies His signs? Surely, the transgressors won’t succeed.",
            "verseStringReplacedWithAllah": "Who is more unjust than he who invents a lie about Allah or denies His signs? Surely, the transgressors won’t succeed."
        },
        {
            "verseNumber": 18,
            "verseString": "They worship, aside from God, what can neither harm them nor benefit them, and they say, “These are our intercessors with God.” Say, “Are you informing God of something He doesn’t know in the heavens or on earth?” Glorified is He and far above what they associate with Him.",
            "verseStringReplacedWithAllah": "They worship, aside from Allah, what can neither harm them nor benefit them, and they say, “These are our intercessors with Allah.” Say, “Are you informing Allah of something He doesn’t know in the heavens or on earth?” Glorified is He and far above what they associate with Him."
        },
        {
            "verseNumber": 19,
            "verseString": "Humanity was once a single community, before differences emerged. If not for a prior decree from your Lord, their disputes would’ve been settled."
        },
        {
            "verseNumber": 20,
            "verseString": "They say, “If only a miracle from his Lord would come to him.” Say, “The unseen belongs to God. So wait; I am waiting with you.”",
            "verseStringReplacedWithAllah": "They say, “If only a miracle from his Lord would come to him.” Say, “The unseen belongs to Allah. So wait; I am waiting with you.”"
        },
        {
            "verseNumber": 21,
            "verseString": "When We grant humans mercy after hardship has touched them, they scheme against Our revelations. Say, “God is swifter in planning.” Indeed, Our messengers write down what you scheme.",
            "verseStringReplacedWithAllah": "When We grant humans mercy after hardship has touched them, they scheme against Our revelations. Say, “Allah is swifter in planning.” Indeed, Our messengers write down what you scheme."
        },
        {
            "verseNumber": 22,
            "verseString": "It is He who transports you across land and sea. When you are aboard ships, sailing with a favorable wind, rejoicing in it, a gale strikes. The waves come at them from every side, and they think they are encompassed, they call upon God, devoting their religion sincerely to Him: “If You save us from this, we will surely be among the thankful.”",
            "verseStringReplacedWithAllah": "It is He who transports you across land and sea. When you are aboard ships, sailing with a favorable wind, rejoicing in it, a gale strikes. The waves come at them from every side, and they think they are encompassed, they call upon Allah, devoting their religion sincerely to Him: “If You save us from this, we will surely be among the thankful.”"
        },
        {
            "verseNumber": 23,
            "verseString": "But when He saves them, they transgress unjustly on earth. O people, your transgression is only against yourselves—the enjoyment of worldly life. Then, to Us is your return, and We will inform you of what you used to do."
        },
        {
            "verseNumber": 24,
            "verseString": "The likeness of the life of this world is as water which We send down from the sky; it mingles with the earth’s vegetation from which people and animals eat. But when the earth takes on its adornment and is beautified, and its people think they have mastery over it, Our order comes to it, by night or by day, and We render it a harvested field, as if it had not flourished the day before. So do We explain the verses for a people who ponder."
        },
        {
            "verseNumber": 25,
            "verseString": "God invites to the Home of Peace and guides whom He wills to a straight path.",
            "verseStringReplacedWithAllah": "Allah invites to the Home of Peace and guides whom He wills to a straight path."
        },
        {
            "verseNumber": 26,
            "verseString": "For those who do good, there is excellence, and more. No darkness will cover their faces, nor will they be humiliated. These are the inhabitants of Paradise, dwelling therein forever."
        },
        {
            "verseNumber": 27,
            "verseString": "Those who commit evil will be repaid with an equivalent evil, and humiliation will cover them. They will have no one to protect them from God—as if their faces are covered with pieces of the pitch-dark night. These are the inhabitants of the Fire, where they will abide eternally.",
            "verseStringReplacedWithAllah": "Those who commit evil will be repaid with an equivalent evil, and humiliation will cover them. They will have no one to protect them from Allah—as if their faces are covered with pieces of the pitch-dark night. These are the inhabitants of the Fire, where they will abide eternally."
        },
        {
            "verseNumber": 28,
            "verseString": "On the Day when We gather them all together, We will say to those who associated, “Stay in your place, you and your partners.” We will separate between them, and their partners will say, “It wasn’t us you were worshiping.”"
        },
        {
            "verseNumber": 29,
            "verseString": "“God is sufficient as a witness between us and you; we were unaware of your worship.”",
            "verseStringReplacedWithAllah": "“Allah is sufficient as a witness between us and you; we were unaware of your worship.”"
        },
        {
            "verseNumber": 30,
            "verseString": "There, every soul will be recompensed for its deeds. They will be returned to God, their Lord, the True, and the false gods they invented will vanish from them.",
            "verseStringReplacedWithAllah": "There, every soul will be recompensed for its deeds. They will be returned to Allah, their Lord, the True, and the false gods they invented will vanish from them."
        },
        {
            "verseNumber": 31,
            "verseString": "Ask them, “Who sustains you from the heavens and the earth? Who controls hearing and sight? Who brings the living from the dead, and the dead from the living? Who orchestrates all affairs?” They will answer, “God.” Then say, “Won’t you be cautious?”",
            "verseStringReplacedWithAllah": "Ask them, “Who sustains you from the heavens and the earth? Who controls hearing and sight? Who brings the living from the dead, and the dead from the living? Who orchestrates all affairs?” They will answer, “Allah.” Then say, “Won’t you be cautious?”"
        },
        {
            "verseNumber": 32,
            "verseString": "This is God, your true Lord. What is there beyond truth except falsehood? How are you then turned away?",
            "verseStringReplacedWithAllah": "This is Allah, your true Lord. What is there beyond truth except falsehood? How are you then turned away?"
        },
        {
            "verseNumber": 33,
            "verseString": "Thus is the word of your Lord justified against those who sin: they don’t believe."
        },
        {
            "verseNumber": 34,
            "verseString": "Say, “Can any of your associates initiate creation and then repeat it?” Say, “God initiates creation and then repeats it. How are you led astray?”",
            "verseStringReplacedWithAllah": "Say, “Can any of your associates initiate creation and then repeat it?” Say, “Allah initiates creation and then repeats it. How are you led astray?”"
        },
        {
            "verseNumber": 35,
            "verseString": "Say, “Can any of your associates guide to the truth?” Say, “God alone guides to the truth. Is He who guides to the truth more deserving of being followed, or he who does not guide unless he himself is guided? What is wrong with you? How do you judge?”",
            "verseStringReplacedWithAllah": "Say, “Can any of your associates guide to the truth?” Say, “Allah alone guides to the truth. Is He who guides to the truth more deserving of being followed, or he who does not guide unless he himself is guided? What is wrong with you? How do you judge?”"
        },
        {
            "verseNumber": 36,
            "verseString": "The majority of them follow nothing but conjecture, which can never replace the truth. God is aware of what they do.",
            "verseStringReplacedWithAllah": "The majority of them follow nothing but conjecture, which can never replace the truth. Allah is aware of what they do."
        },
        {
            "verseNumber": 37,
            "verseString": "This Quran could not have been fabricated by someone other than God. It confirms what came before it and thoroughly explains the Scripture. There is no doubt about it; it is from the Lord of the universes.",
            "verseStringReplacedWithAllah": "This Quran could not have been fabricated by someone other than Allah. It confirms what came before it and thoroughly explains the Scripture. There is no doubt about it; it is from the Lord of the universes."
        },
        {
            "verseNumber": 38,
            "verseString": "Or do they say, “He made it up”? Say, “Then produce a chapter like it, and call upon anyone you can, other than God, if you are truthful.”",
            "verseStringReplacedWithAllah": "Or do they say, “He made it up”? Say, “Then produce a chapter like it, and call upon anyone you can, other than Allah, if you are truthful.”"
        },
        {
            "verseNumber": 39,
            "verseString": "They reject what they can’t comprehend, even before its interpretation reaches them. Likewise, those before them also rejected the truth. So, observe the fate of the wrongdoers."
        },
        {
            "verseNumber": 40,
            "verseString": "Among them are those who believe in it, and those who don’t. Your Lord knows best about the corruptors."
        },
        {
            "verseNumber": 41,
            "verseString": "If they accuse you of lying, say, “For me are my deeds, and for you are yours. You are innocent of what I do, and I am innocent of what you do.”"
        },
        {
            "verseNumber": 42,
            "verseString": "Among them are those who listen to you. But can you make the deaf hear, even though they can’t comprehend?"
        },
        {
            "verseNumber": 43,
            "verseString": "Among them are those who look at you. But can you guide the blind, even if they can’t see?"
        },
        {
            "verseNumber": 44,
            "verseString": "God doesn’t do any injustice to people, instead, people do injustice to themselves.",
            "verseStringReplacedWithAllah": "Allah doesn’t do any injustice to people, instead, people do injustice to themselves."
        },
        {
            "verseNumber": 45,
            "verseString": "On the Day when He gathers them all, it will seem as if they had only lingered for an hour of a day, familiarizing themselves with each other. Those who denied the encounter with God and were not guided will be the ones to suffer loss.",
            "verseStringReplacedWithAllah": "On the Day when He gathers them all, it will seem as if they had only lingered for an hour of a day, familiarizing themselves with each other. Those who denied the encounter with Allah and were not guided will be the ones to suffer loss."
        },
        {
            "verseNumber": 46,
            "verseString": "Whether We show you some of what We’ve promised them, or We take your life before that, their ultimate return is to Us. Then, God is the Witness over what they do.",
            "verseStringReplacedWithAllah": "Whether We show you some of what We’ve promised them, or We take your life before that, their ultimate return is to Us. Then, Allah is the Witness over what they do."
        },
        {
            "verseNumber": 47,
            "verseString": "Every nation has a messenger. When their messenger arrives, judgment is passed upon them justly, and they won’t be wronged."
        },
        {
            "verseNumber": 48,
            "verseString": "They inquire, “When will this promise be fulfilled, if you are truthful?”"
        },
        {
            "verseNumber": 49,
            "verseString": "Reply, “I have no control over any harm or benefit to myself, except as God wills. For every nation, there is a predetermined time. When their time arrives, they can neither delay it by an hour nor advance it.”",
            "verseStringReplacedWithAllah": "Reply, “I have no control over any harm or benefit to myself, except as Allah wills. For every nation, there is a predetermined time. When their time arrives, they can neither delay it by an hour nor advance it.”"
        },
        {
            "verseNumber": 50,
            "verseString": "Say, “Have you considered: whether His punishment comes to you by night or by day, how much of it will the criminals seek to hasten?”"
        },
        {
            "verseNumber": 51,
            "verseString": "“Will you only believe when it happens? Now? Even though you were impatient for it?”"
        },
        {
            "verseNumber": 52,
            "verseString": "Then, those who acted unjustly will be told, “Taste the everlasting torment. Are you being compensated except for what you used to earn?”"
        },
        {
            "verseNumber": 53,
            "verseString": "They question you, “Is this the truth?” Respond, “Yes, by my Lord, it’s the truth, and you can’t escape from it.”"
        },
        {
            "verseNumber": 54,
            "verseString": "If every wrongdoer possessed all that exists on earth, he would seek to ransom himself by it. Yet, when they witness the punishment, they will conceal their regret. They will be judged justly, and they won’t be wronged."
        },
        {
            "verseNumber": 55,
            "verseString": "Unquestionably! All that’s in the heavens and on earth belongs to God. Indeed, the promise of God is always true, yet most of them don’t have the knowledge.",
            "verseStringReplacedWithAllah": "Unquestionably! All that’s in the heavens and on earth belongs to Allah. Indeed, the promise of Allah is always true, yet most of them don’t have the knowledge."
        },
        {
            "verseNumber": 56,
            "verseString": "It is He who gives life and causes death, and to Him you will be returned."
        },
        {
            "verseNumber": 57,
            "verseString": "O mankind, there has come to you advice from your Lord and healing for what’s in the hearts, and guidance and mercy for the believers."
        },
        {
            "verseNumber": 58,
            "verseString": "Say, “In the grace and mercy of God, let them rejoice. It is better than what they hoard.”",
            "verseStringReplacedWithAllah": "Say, “In the grace and mercy of Allah, let them rejoice. It is better than what they hoard.”"
        },
        {
            "verseNumber": 59,
            "verseString": "Say, “Did you consider what God sent down to you of provision, and yet you’ve made some of it lawful and some of it unlawful?” Ask, “Does God give you permission, or are you inventing lies about God?”",
            "verseStringReplacedWithAllah": "Say, “Did you consider what Allah sent down to you of provision, and yet you’ve made some of it lawful and some of it unlawful?” Ask, “Does Allah give you permission, or are you inventing lies about Allah?”"
        },
        {
            "verseNumber": 60,
            "verseString": "What will those who fabricate falsehoods about God think on Resurrection Day? God is bountiful towards humankind, but most of them aren’t grateful.",
            "verseStringReplacedWithAllah": "What will those who fabricate falsehoods about Allah think on Resurrection Day? Allah is bountiful towards humankind, but most of them aren’t grateful."
        },
        {
            "verseNumber": 61,
            "verseString": "Whatever activity you conduct, any portion of the Quran you recite, or whatever you are doing, We are witness over you when you are engaged in it. Not even an atom’s weight in the earth or sky escapes your Lord’s knowledge, nor is there anything smaller or larger that isn’t documented in a clear record."
        },
        {
            "verseNumber": 62,
            "verseString": "Indeed, God’s allies will have no fear, nor will they grieve.",
            "verseStringReplacedWithAllah": "Indeed, Allah’s allies will have no fear, nor will they grieve."
        },
        {
            "verseNumber": 63,
            "verseString": "Those who believe and are righteous."
        },
        {
            "verseNumber": 64,
            "verseString": "There is good news for them in this life and the Hereafter. God’s promises are unchangeable. That is the supreme victory.",
            "verseStringReplacedWithAllah": "There is good news for them in this life and the Hereafter. Allah’s promises are unchangeable. That is the supreme victory."
        },
        {
            "verseNumber": 65,
            "verseString": "Let not their words dishearten you. All power and honor belong to God; He is the All-Hearing, the All-Knowing.",
            "verseStringReplacedWithAllah": "Let not their words dishearten you. All power and honor belong to Allah; He is the All-Hearing, the All-Knowing."
        },
        {
            "verseNumber": 66,
            "verseString": "Everything in the heavens and earth belongs to God. Those who invoke others besides God aren’t truly following associates; they follow nothing but conjecture and what their own selves desire.",
            "verseStringReplacedWithAllah": "Everything in the heavens and earth belongs to Allah. Those who invoke others besides Allah aren’t truly following associates; they follow nothing but conjecture and what their own selves desire."
        },
        {
            "verseNumber": 67,
            "verseString": "It is He who made the night for your rest and the day making things visible. In this are signs for those who listen."
        },
        {
            "verseNumber": 68,
            "verseString": "They say, “God has begotten a son.” Glorified is He; He is the Self-Sufficient. Everything in the heavens and on earth is His. Do you have any evidence for this, or are you attributing what you don’t know to God?",
            "verseStringReplacedWithAllah": "They say, “Allah has begotten a son.” Glorified is He; He is the Self-Sufficient. Everything in the heavens and on earth is His. Do you have any evidence for this, or are you attributing what you don’t know to Allah?"
        },
        {
            "verseNumber": 69,
            "verseString": "Say, “Those who fabricate lies about God won’t succeed.”",
            "verseStringReplacedWithAllah": "Say, “Those who fabricate lies about Allah won’t succeed.”"
        },
        {
            "verseNumber": 70,
            "verseString": "Some enjoyment in this life, but they will ultimately return to Us, and We will subject them to severe punishment for their disbelief."
        },
        {
            "verseNumber": 71,
            "verseString": "Tell them the story of Noah, who said to his people, “O my people, if my presence among you and my reminders of God’s messages are burdensome to you, I have placed my trust in God. So, gather your plan, with your associates, make your intentions clear, and don’t hesitate.”",
            "verseStringReplacedWithAllah": "Tell them the story of Noah, who said to his people, “O my people, if my presence among you and my reminders of Allah’s messages are burdensome to you, I have placed my trust in Allah. So, gather your plan, with your associates, make your intentions clear, and don’t hesitate.”"
        },
        {
            "verseNumber": 72,
            "verseString": "“If you turn away, I didn’t ask you for any wage; my reward is only from God, and I was commanded to be among those who submit.”",
            "verseStringReplacedWithAllah": "“If you turn away, I didn’t ask you for any wage; my reward is only from Allah, and I was commanded to be among those who submit.”"
        },
        {
            "verseNumber": 73,
            "verseString": "Yet, they rejected him. So, We saved him and those with him in the Ark, made them successors, and drowned those who denied Our revelations. Observe the end of those who were warned."
        },
        {
            "verseNumber": 74,
            "verseString": "After him, We sent other messengers to their peoples, and they came to them with clear proofs. But they were not to believe what they had initially denied. Thus, We seal over the hearts of the transgressors."
        },
        {
            "verseNumber": 75,
            "verseString": "Then, after them, We sent Moses and Aaron, with Our signs, to Pharaoh and his chiefs. But they showed arrogance, and they were indeed a criminal people."
        },
        {
            "verseNumber": 76,
            "verseString": "When the truth from Us came to them, they said, “This is nothing but clear magic.”"
        },
        {
            "verseNumber": 77,
            "verseString": "Moses replied, “Do you call the truth magic when it comes to you? Magicians won’t succeed.”"
        },
        {
            "verseNumber": 78,
            "verseString": "They said, “Did you come to divert us from the traditions of our ancestors and gain supremacy in the land? We will never believe in you.”"
        },
        {
            "verseNumber": 79,
            "verseString": "Pharaoh then commanded, “Bring to me every knowledgeable sorcerer.”"
        },
        {
            "verseNumber": 80,
            "verseString": "When the magicians came, Moses said to them, “Throw down whatever you will.”"
        },
        {
            "verseNumber": 81,
            "verseString": "And when they cast their spells, Moses said, “What you’ve produced is a mere illusion, and God will nullify it. God doesn’t let the work of the corrupters succeed.”",
            "verseStringReplacedWithAllah": "And when they cast their spells, Moses said, “What you’ve produced is a mere illusion, and Allah will nullify it. Allah doesn’t let the work of the corrupters succeed.”"
        },
        {
            "verseNumber": 82,
            "verseString": "“God confirms the truth with His words, even if the wrongdoers hate it.”",
            "verseStringReplacedWithAllah": "“Allah confirms the truth with His words, even if the wrongdoers hate it.”"
        },
        {
            "verseNumber": 83,
            "verseString": "Only a minority from his own people believed in Moses, fearing Pharaoh’s tyranny and his priests’ retribution. Pharaoh was arrogant in the land, and he was one of the transgressors."
        },
        {
            "verseNumber": 84,
            "verseString": "Moses urged, “O my people, if you have believed in God, then rely upon Him, if you have submitted.”",
            "verseStringReplacedWithAllah": "Moses urged, “O my people, if you have believed in Allah, then rely upon Him, if you have submitted.”"
        },
        {
            "verseNumber": 85,
            "verseString": "They responded, “In God, we place our trust. Our Lord, make us not a trial for the wrongdoing people.”",
            "verseStringReplacedWithAllah": "They responded, “In Allah, we place our trust. Our Lord, make us not a trial for the wrongdoing people.”"
        },
        {
            "verseNumber": 86,
            "verseString": "“And, through Your mercy, deliver us from the disbelieving people.”"
        },
        {
            "verseNumber": 87,
            "verseString": "We revealed to Moses and his brother: “Establish homes in Egypt for your people, make your homes places of worship, perform the prayers, and give good news to the believers.”"
        },
        {
            "verseNumber": 88,
            "verseString": "Moses prayed: “Our Lord, You’ve given Pharaoh and his elites splendor and wealth in the worldly life, our Lord, that they may lead people astray from your path. Our Lord, obliterate their wealth and harden their hearts, so they won’t believe until they witness the severe punishment.”"
        },
        {
            "verseNumber": 89,
            "verseString": "He replied, “Your prayer has been answered. Remain upright, and don’t follow the path of those who lack knowledge.”"
        },
        {
            "verseNumber": 90,
            "verseString": "We led the Children of Israel across the sea, while Pharaoh and his troops pursued them with hostility and aggression. When the certainty of drowning dawned upon him, he said, “I believe that there is no god except the One in whom the Children of Israel believe, and I am among the submitters.”"
        },
        {
            "verseNumber": 91,
            "verseString": "Now? And before you were disobeying and were among the corrupters?"
        },
        {
            "verseNumber": 92,
            "verseString": "Today, We will preserve your body, as a sign for those who come after you. Yet most people are oblivious to Our signs."
        },
        {
            "verseNumber": 93,
            "verseString": "We granted the Children of Israel a privileged status and gave them good things. However, they didn’t differ until after knowledge had come to them. Your Lord will resolve their disputes on Resurrection Day."
        },
        {
            "verseNumber": 94,
            "verseString": "If you doubt what We’ve revealed to you, ask those who have been reading the Scripture before you. The truth has come to you from your Lord, so don’t be among the doubters."
        },
        {
            "verseNumber": 95,
            "verseString": "And don’t be among those who deny God’s messages, lest you be among the losers.",
            "verseStringReplacedWithAllah": "And don’t be among those who deny Allah’s messages, lest you be among the losers."
        },
        {
            "verseNumber": 96,
            "verseString": "Those upon whom your Lord’s decree has been realized won’t believe."
        },
        {
            "verseNumber": 97,
            "verseString": "Even if every sign were to come to them—until they see the severe punishment."
        },
        {
            "verseNumber": 98,
            "verseString": "No community has ever believed and benefited from their faith except the people of Jonah. When they believed, We lifted from them the torment of disgrace in this worldly life, and We permitted them to enjoy for a while."
        },
        {
            "verseNumber": 99,
            "verseString": "If your Lord had willed, everyone on earth would have believed. Would you then compel people to become believers?"
        },
        {
            "verseNumber": 100,
            "verseString": "No soul can believe except by the permission of God. And He places defilement upon those who don’t reason.",
            "verseStringReplacedWithAllah": "No soul can believe except by the permission of Allah. And He places defilement upon those who don’t reason."
        },
        {
            "verseNumber": 101,
            "verseString": "Say, “Observe what’s in the heavens and the earth.” But neither signs nor warnings will avail those who don’t believe."
        },
        {
            "verseNumber": 102,
            "verseString": "Do they expect anything but the likes of the days of those who passed before them? Say, “Then wait; I am waiting with you.”"
        },
        {
            "verseNumber": 103,
            "verseString": "Thus, We rescue Our messengers and those who believe. Thus, it is incumbent upon Us to save the believers."
        },
        {
            "verseNumber": 104,
            "verseString": "Say, “O people, if you doubt my religion, I don’t worship those whom you worship besides God, but I worship God, who ultimately takes your life. I have been commanded to be among the believers.”",
            "verseStringReplacedWithAllah": "Say, “O people, if you doubt my religion, I don’t worship those whom you worship besides Allah, but I worship Allah, who ultimately takes your life. I have been commanded to be among the believers.”"
        },
        {
            "verseNumber": 105,
            "verseString": "Be upright to the religion of pure monotheism, and never count yourself among the polytheists."
        },
        {
            "verseNumber": 106,
            "verseString": "Don’t call upon entities other than God, who can neither benefit nor harm you. If you do so, you position yourself with the wrongdoers.",
            "verseStringReplacedWithAllah": "Don’t call upon entities other than Allah, who can neither benefit nor harm you. If you do so, you position yourself with the wrongdoers."
        },
        {
            "verseNumber": 107,
            "verseString": "If God touches you with harm, there is no one to remove it but Him. And if He intends goodness for you, there is none who can repel His Favor. He bestows it upon whom He wills of His servants. He is the Forgiving, the Merciful.",
            "verseStringReplacedWithAllah": "If Allah touches you with harm, there is no one to remove it but Him. And if He intends goodness for you, there is none who can repel His Favor. He bestows it upon whom He wills of His servants. He is the Forgiving, the Merciful."
        },
        {
            "verseNumber": 108,
            "verseString": "Say, “O people, the truth has come to you from your Lord. He who accepts guidance, does so for his own good; he who goes astray, does so at his own peril. I am not a manager over you.”"
        },
        {
            "verseNumber": 109,
            "verseString": "Follow what has been revealed to you, and be patient until God brings about His judgment. He is the best of judges.",
            "verseStringReplacedWithAllah": "Follow what has been revealed to you, and be patient until Allah brings about His judgment. He is the best of judges."
        }
    ],
    "chapterNumber": 10,
    "nameInEnglish": "Jonah",
    "nameInTransliteration": "Yunus",
    "nameInArabic": "يونس",
    "numberOfVerses": 109
}