{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "The reckoning of humanity is drawing near, yet they remain in heedless disregard."
        },
        {
            "verseNumber": 2,
            "verseString": "Whenever a revelation comes to them from their Lord, fresh, they listen to it while they play."
        },
        {
            "verseNumber": 3,
            "verseString": "With their hearts preoccupied, the wrongdoers confide in private: “Isn’t he just a man like you? Are you going to yield to magic while you can clearly see?”"
        },
        {
            "verseNumber": 4,
            "verseString": "He responded, “My Lord knows every word spoken in the heavens and on earth. He is the All-Hearing, the All-Knowing.”"
        },
        {
            "verseNumber": 5,
            "verseString": "They even say, “A jumble of dreams,” or “He made it up,” or “He is just a poet.” “Let him bring us a sign, just as the ancients received.”"
        },
        {
            "verseNumber": 6,
            "verseString": "Not even one of the cities that we destroyed before them believed; will they then believe?"
        },
        {
            "verseNumber": 7,
            "verseString": "We sent before you only men to whom we revealed. Ask the people of the message, if you don’t know."
        },
        {
            "verseNumber": 8,
            "verseString": "We didn’t make them bodies that didn’t eat food, nor were they immortal."
        },
        {
            "verseNumber": 9,
            "verseString": "Then, We fulfilled Our promise to them, rescuing them and those We willed while obliterating the transgressors."
        },
        {
            "verseNumber": 10,
            "verseString": "We revealed to you a Scripture that mentions you explicitly. Don’t you understand?"
        },
        {
            "verseNumber": 11,
            "verseString": "How many sinful communities We shatter, and after them, raised other people?"
        },
        {
            "verseNumber": 12,
            "verseString": "When they sensed Our power approaching, they tried to flee from it."
        },
        {
            "verseNumber": 13,
            "verseString": "“Don’t run. Return to your luxuries and your homes, so you may be questioned.”"
        },
        {
            "verseNumber": 14,
            "verseString": "They cried out, “Alas to us! We were indeed wrongdoers.”"
        },
        {
            "verseNumber": 15,
            "verseString": "This cry of theirs continued until We made them like harvested crops, extinguished."
        },
        {
            "verseNumber": 16,
            "verseString": "We didn’t create the heavens, the earth, and everything in between for a pastime."
        },
        {
            "verseNumber": 17,
            "verseString": "If we had wanted to take a pastime, We could have taken it from with Us—if We were to do so."
        },
        {
            "verseNumber": 18,
            "verseString": "Instead, We hurl the truth against falsehood, and it crushes it, leaving it utterly vanquished. Woe unto you, for what you described!"
        },
        {
            "verseNumber": 19,
            "verseString": "Everything in the heavens and on earth is His. Those in His presence aren’t too proud to worship Him, nor do they tire."
        },
        {
            "verseNumber": 20,
            "verseString": "They glorify night and day, without ceasing."
        },
        {
            "verseNumber": 21,
            "verseString": "Did they choose gods from the earth who can resurrect?"
        },
        {
            "verseNumber": 22,
            "verseString": "If there were gods besides God in either of them, they would’ve gone to ruin. Praise be to God, the Lord of the Throne, exalted above what they describe.",
            "verseStringReplacedWithAllah": "If there were gods besides Allah in either of them, they would’ve gone to ruin. Praise be to Allah, the Lord of the Throne, exalted above what they describe."
        },
        {
            "verseNumber": 23,
            "verseString": "He is not questioned about what He does, but they will be questioned."
        },
        {
            "verseNumber": 24,
            "verseString": "Have they chosen other gods besides Him? Say, “Bring your proof. This is a reminder for those with me and a reminder for those before me.” Yet, most of them don’t know the truth and turn away."
        },
        {
            "verseNumber": 25,
            "verseString": "We revealed to every messenger before you, “There is no god but I; so worship me.”"
        },
        {
            "verseNumber": 26,
            "verseString": "And they say, “The Most Merciful has begotten a child.” Glorified be He! Rather, they are honored servants."
        },
        {
            "verseNumber": 27,
            "verseString": "They don’t precede Him in speech, and they act only upon His command."
        },
        {
            "verseNumber": 28,
            "verseString": "He knows their past and their future. They can’t intercede except for those He approves of. They stand in awe and reverence of Him."
        },
        {
            "verseNumber": 29,
            "verseString": "Should any among them dare to say, “I am a god besides Him,” We will recompense him with Hell; this is the recompense of transgressors."
        },
        {
            "verseNumber": 30,
            "verseString": "Do the disbelievers not see that the heavens and the earth were a joined entity, which We then separated? And from water, We brought forth all living things. Will they not then believe?"
        },
        {
            "verseNumber": 31,
            "verseString": "We placed upon it firm mountains, lest it should shake with them, and We made therein passageways, so they may be guided."
        },
        {
            "verseNumber": 32,
            "verseString": "We made the sky a protected ceiling, yet they turn away from its signs."
        },
        {
            "verseNumber": 33,
            "verseString": "It is He who created the night, the day, the sun, and the moon, each gliding in an orbit."
        },
        {
            "verseNumber": 34,
            "verseString": "We didn’t grant any human before you immortality. So, if you were to die, would they then live forever?"
        },
        {
            "verseNumber": 35,
            "verseString": "Every soul will taste death. We burden you with bad and good—a test. And to Us, you will be returned."
        },
        {
            "verseNumber": 36,
            "verseString": "When the unbelievers see you, they take you for mockery: “Is this the one who speaks about your gods?” Yet they deny the mention of the Most Merciful."
        },
        {
            "verseNumber": 37,
            "verseString": "Man was created hasty. I will show you My signs, so don’t rush."
        },
        {
            "verseNumber": 38,
            "verseString": "And they ask, “When will this promise be fulfilled, if you are truthful?”"
        },
        {
            "verseNumber": 39,
            "verseString": "If those who disbelieved only knew, when they won’t be able to fend off the fire from their faces or their backs, and they won’t be aided."
        },
        {
            "verseNumber": 40,
            "verseString": "It will come upon them suddenly, and they will become startled. They won’t be able to repel it nor will they be granted respite."
        },
        {
            "verseNumber": 41,
            "verseString": "Messengers before you were also ridiculed, but those who mocked were then engulfed by what they used to mock."
        },
        {
            "verseNumber": 42,
            "verseString": "Say, “Who is there to protect you, night and day, from the Merciful?” Yet, they turn away from the remembrance of their Lord."
        },
        {
            "verseNumber": 43,
            "verseString": "Do they have gods who can protect them from Us? They can’t help themselves, and they won’t be protected from Us."
        },
        {
            "verseNumber": 44,
            "verseString": "We allowed them and their ancestors to enjoy extended periods of comfort and luxury. Don’t they see how We gradually reduce the land from its borders? Are they then the victors?"
        },
        {
            "verseNumber": 45,
            "verseString": "Say, “I only warn you by revelation.” However, the deaf won’t hear the call when they are warned."
        },
        {
            "verseNumber": 46,
            "verseString": "Yet if a breath of your Lord’s punishment were to touch them, they would cry out, “Woe to us, we were indeed wrongdoers.”"
        },
        {
            "verseNumber": 47,
            "verseString": "On the Day of Resurrection, We will establish the scales of justice. No soul will be wronged in the slightest. Even if it’s the weight of a mustard seed, We will bring it in. And sufficient are We as accountants."
        },
        {
            "verseNumber": 48,
            "verseString": "We gave Moses and Aaron the Criterion, a light, and a reminder for the righteous."
        },
        {
            "verseNumber": 49,
            "verseString": "Those who fear their Lord in private and dread the Hour."
        },
        {
            "verseNumber": 50,
            "verseString": "This, too, is a blessed message that We revealed. Will you then deny it?"
        },
        {
            "verseNumber": 51,
            "verseString": "We had previously given Abraham wisdom, and We were well aware of him."
        },
        {
            "verseNumber": 52,
            "verseString": "He questioned his father and his people, “What are these idols to which you are so devoted?”"
        },
        {
            "verseNumber": 53,
            "verseString": "They replied, “We found our ancestors worshiping them.”"
        },
        {
            "verseNumber": 54,
            "verseString": "He stated, “You and your ancestors have been in manifest error.”"
        },
        {
            "verseNumber": 55,
            "verseString": "They asked, “Did you bring us the truth, or are you merely playing?”"
        },
        {
            "verseNumber": 56,
            "verseString": "He responded, “Indeed, your Lord is the Lord of the heavens and the earth, He who originated them, and I am to this a witness."
        },
        {
            "verseNumber": 57,
            "verseString": "And by God, I will plan against your idols after you have gone away.”",
            "verseStringReplacedWithAllah": "And by Allah, I will plan against your idols after you have gone away.”"
        },
        {
            "verseNumber": 58,
            "verseString": "So he reduced them to fragments, except their largest, so they might return to it."
        },
        {
            "verseNumber": 59,
            "verseString": "They exclaimed, “Who did this to our gods? He must be a villain.”"
        },
        {
            "verseNumber": 60,
            "verseString": "They said, “We heard a young man mention them; his name is Abraham.”"
        },
        {
            "verseNumber": 61,
            "verseString": "They demanded, “Bring him before the eyes of the people, that they may testify.”"
        },
        {
            "verseNumber": 62,
            "verseString": "They interrogated, “Was it you who did this to our gods, O Abraham?”"
        },
        {
            "verseNumber": 63,
            "verseString": "He responded, “No, this, their biggest one did it. Ask them, if they can speak.”"
        },
        {
            "verseNumber": 64,
            "verseString": "So they turned to themselves and said, “You yourselves are the wrongdoers.”"
        },
        {
            "verseNumber": 65,
            "verseString": "But then they were reverted to their former notion: “You know well that these can’t speak.”"
        },
        {
            "verseNumber": 66,
            "verseString": "He countered, “Do you then worship, instead of God, things that can neither benefit you at all nor harm you?",
            "verseStringReplacedWithAllah": "He countered, “Do you then worship, instead of Allah, things that can neither benefit you at all nor harm you?"
        },
        {
            "verseNumber": 67,
            "verseString": "Shame on you and what you worship besides God! Do you have any sense?”",
            "verseStringReplacedWithAllah": "Shame on you and what you worship besides Allah! Do you have any sense?”"
        },
        {
            "verseNumber": 68,
            "verseString": "They demanded, “Burn him and support your gods, if you are to act.”"
        },
        {
            "verseNumber": 69,
            "verseString": "We said, “O fire, be cool and safe for Abraham.”"
        },
        {
            "verseNumber": 70,
            "verseString": "They plotted to harm him, but We made them the greatest losers."
        },
        {
            "verseNumber": 71,
            "verseString": "We saved him and Lot, bringing them to the land We had blessed for all the worlds."
        },
        {
            "verseNumber": 72,
            "verseString": "We granted him Isaac and Jacob additionally, and we made each of them righteous."
        },
        {
            "verseNumber": 73,
            "verseString": "We made them leaders who guided by Our command, and We inspired them to do good deeds, establish prayer, and give alms. They were worshippers of Us."
        },
        {
            "verseNumber": 74,
            "verseString": "And to Lot, We gave wisdom and knowledge, and We saved him from the city that practiced the abominations. They were wicked and sinful people."
        },
        {
            "verseNumber": 75,
            "verseString": "We brought him into Our mercy; he was among the righteous."
        },
        {
            "verseNumber": 76,
            "verseString": "And Noah, when he called out to Us before, We responded to him and saved him and his family from the great distress."
        },
        {
            "verseNumber": 77,
            "verseString": "And We supported him against the people who denied Our signs. They were evil people, so We drowned them all."
        },
        {
            "verseNumber": 78,
            "verseString": "And David and Solomon, when they judged concerning the field, when some people’s sheep strayed and grazed therein. We were witnesses to their judgment."
        },
        {
            "verseNumber": 79,
            "verseString": "We granted Solomon understanding of it, and We bestowed on them wisdom and knowledge. We made the mountains and birds join David in Our praises. This was Our doing."
        },
        {
            "verseNumber": 80,
            "verseString": "And We taught him the craft of making coats of armor for you, to protect you in your wars. Will you then be grateful?"
        },
        {
            "verseNumber": 81,
            "verseString": "To Solomon, We subjected the wind, blowing forcefully at his command towards the land that We had blessed. We are aware of all things."
        },
        {
            "verseNumber": 82,
            "verseString": "To him, we assigned some devils who dived and performed various minor tasks, but We kept them under strict control."
        },
        {
            "verseNumber": 83,
            "verseString": "And Job, when he implored his Lord, “Adversity has afflicted me, yet You are the Most Merciful of the merciful.”"
        },
        {
            "verseNumber": 84,
            "verseString": "We responded to him, alleviated his suffering, and restored his family to him, along with others like them, as a mercy from Us, and a reminder for the worshippers."
        },
        {
            "verseNumber": 85,
            "verseString": "And Ishmael, Enoch, and Ezekiel—each of them was among the patient."
        },
        {
            "verseNumber": 86,
            "verseString": "We embraced them in Our mercy, for they were among the righteous."
        },
        {
            "verseNumber": 87,
            "verseString": "And Jonah, when he stormed out in fury, thinking We had no power over him. Then he called out in the darkness, “There is no god but You! Glory be to You! Indeed, I was among the wrongdoers!”"
        },
        {
            "verseNumber": 88,
            "verseString": "So We answered him and saved him from the distress. Thus We save the believers."
        },
        {
            "verseNumber": 89,
            "verseString": "And Zechariah, when he implored his Lord, “My Lord, don’t leave me alone, while You are the best of inheritors.”"
        },
        {
            "verseNumber": 90,
            "verseString": "So We answered him and gave him John, and remedied his wife for him. They were always quick to perform good deeds, and they called upon Us with fervor and humility; they were devout to us."
        },
        {
            "verseNumber": 91,
            "verseString": "And she who guarded her chastity, so We breathed into her from Our spirit, and We made her and her son a sign for all peoples."
        },
        {
            "verseNumber": 92,
            "verseString": "This community of yours is a single community, and I am your Lord, so worship Me alone."
        },
        {
            "verseNumber": 93,
            "verseString": "Yet they fragmented their religion among themselves, but all will return to Us."
        },
        {
            "verseNumber": 94,
            "verseString": "Whoever acts righteously, while a believer, his efforts won’t be denied. We write it down for him."
        },
        {
            "verseNumber": 95,
            "verseString": "There is a ban upon any city We’ve destroyed; they may not return."
        },
        {
            "verseNumber": 96,
            "verseString": "Until when Gog and Magog are let loose, and they swoop down from every height."
        },
        {
            "verseNumber": 97,
            "verseString": "And when the true promise draws near, then behold, the eyes of those who disbelieved will be staring in horror: “Alas for us! We were oblivious to this; indeed, we were wrongdoers.”"
        },
        {
            "verseNumber": 98,
            "verseString": "You, along with anything you worship other than God, are fuel for Hell. To it you will be headed.",
            "verseStringReplacedWithAllah": "You, along with anything you worship other than Allah, are fuel for Hell. To it you will be headed."
        },
        {
            "verseNumber": 99,
            "verseString": "Had these been gods, they wouldn’t have been entered into it. All will remain therein eternally."
        },
        {
            "verseNumber": 100,
            "verseString": "There, they will groan; there, they won’t be heard."
        },
        {
            "verseNumber": 101,
            "verseString": "Those for whom We decreed the best will be kept far removed from it."
        },
        {
            "verseNumber": 102,
            "verseString": "They won’t hear its hiss, and they will remain in what their souls desire forever."
        },
        {
            "verseNumber": 103,
            "verseString": "The greatest terror won’t grieve them, and the angels will welcome them: “This is your Day which you were promised.”"
        },
        {
            "verseNumber": 104,
            "verseString": "On that Day, We will fold the heavens like the folding of a book. Just as We began the first creation, so We will repeat it. That’s a promise binding upon Us. Indeed, We will do it."
        },
        {
            "verseNumber": 105,
            "verseString": "We’ve written in the Psalms, after the Reminder: “My righteous servants will inherit the earth.”"
        },
        {
            "verseNumber": 106,
            "verseString": "In this there is a message for a people who worship."
        },
        {
            "verseNumber": 107,
            "verseString": "We sent you only as a mercy for all worlds."
        },
        {
            "verseNumber": 108,
            "verseString": "Say, “It has been revealed to me that your God is One God. Are you going to submit?”"
        },
        {
            "verseNumber": 109,
            "verseString": "If they turn away, say, “I have warned you adequately, and I don’t know if what you’re promised is near or far."
        },
        {
            "verseNumber": 110,
            "verseString": "He certainly knows what’s spoken aloud, and He also knows what you conceal."
        },
        {
            "verseNumber": 111,
            "verseString": "And I don’t know; perhaps it might be a test for you and enjoyment for a time.”"
        },
        {
            "verseNumber": 112,
            "verseString": "He said, “My Lord, judge with the truth.” And “Our Lord, the Most Merciful, whose help is sought against what you describe.”"
        }
    ],
    "chapterNumber": 21,
    "nameInEnglish": "The Prophets",
    "nameInTransliteration": "Al Anbiya",
    "nameInArabic": "الأنبياء",
    "numberOfVerses": 112
}