{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif. Lam. Ra. A Book whose verses were perfected, then detailed, from the One who is All-Wise, All-Knowing."
        },
        {
            "verseNumber": 2,
            "verseString": "Worship none but God. “I am to you from Him a warner, and a bearer of good news.”",
            "verseStringReplacedWithAllah": "Worship none but Allah. “I am to you from Him a warner, and a bearer of good news.”"
        },
        {
            "verseNumber": 3,
            "verseString": "“Seek forgiveness from your Lord and repent to Him. He will grant you enjoyment of good for a time appointed, and bestow His grace on every possessor of grace. But if you turn away, I fear for you the punishment of a momentous Day.”"
        },
        {
            "verseNumber": 4,
            "verseString": "To God is your return, and He is capable of everything.",
            "verseStringReplacedWithAllah": "To Allah is your return, and He is capable of everything."
        },
        {
            "verseNumber": 5,
            "verseString": "They conceal their inner selves as if to hide from Him. Even when they cover themselves with their clothes, He knows what they conceal and disclose. He is aware of what lies within the hearts."
        },
        {
            "verseNumber": 6,
            "verseString": "Every living being on earth depends on God for its sustenance. He knows its dwelling and its repository. All is in a clear record.",
            "verseStringReplacedWithAllah": "Every living being on earth depends on Allah for its sustenance. He knows its dwelling and its repository. All is in a clear record."
        },
        {
            "verseNumber": 7,
            "verseString": "It is He who created the heavens and the earth in six periods while His throne was upon the water, to test who among you is best in conduct. If you say, “You will be resurrected after death,” those who disbelieve will say, “This is nothing but obvious sorcery.”"
        },
        {
            "verseNumber": 8,
            "verseString": "If We postpone their punishment until a set time, they will question, “What holds it back?” On the day it reaches them, it won’t be averted from them, and they will be trapped by what they used to ridicule."
        },
        {
            "verseNumber": 9,
            "verseString": "If We give man a taste of mercy from Us, and then We withdraw it from him, he is despairing and ungrateful."
        },
        {
            "verseNumber": 10,
            "verseString": "But if We let him taste a favor after hardship has touched him, he will say, “Gone are afflictions from me.” He becomes joyful and proud."
        },
        {
            "verseNumber": 11,
            "verseString": "Except for those who are patient and do righteous deeds—for them is forgiveness and a great reward."
        },
        {
            "verseNumber": 12,
            "verseString": "Perhaps you would leave some of what’s revealed to you, and you may be disheartened because they say, “Why has no treasure been sent down to him?” or “An angel came with him?” You are just a warner, and God is a custodian over everything.",
            "verseStringReplacedWithAllah": "Perhaps you would leave some of what’s revealed to you, and you may be disheartened because they say, “Why has no treasure been sent down to him?” or “An angel came with him?” You are just a warner, and Allah is a custodian over everything."
        },
        {
            "verseNumber": 13,
            "verseString": "Or do they say, “He made it up?” Say, “Then produce ten similar chapters, made up, and call upon whomsoever you can—excluding God—if you are truthful.”",
            "verseStringReplacedWithAllah": "Or do they say, “He made it up?” Say, “Then produce ten similar chapters, made up, and call upon whomsoever you can—excluding Allah—if you are truthful.”"
        },
        {
            "verseNumber": 14,
            "verseString": "If they don’t respond to you, then know that it was revealed with God’s knowledge, and that there is no god except Him. So, will you then not surrender?",
            "verseStringReplacedWithAllah": "If they don’t respond to you, then know that it was revealed with Allah’s knowledge, and that there is no god except Him. So, will you then not surrender?"
        },
        {
            "verseNumber": 15,
            "verseString": "Those who desire the worldly life and its adornments—We will pay them fully for their deeds in it, without any reduction."
        },
        {
            "verseNumber": 16,
            "verseString": "These are the ones, who, in the Hereafter, will have nothing but the Fire. Their efforts will have been wasted, and their actions become void."
        },
        {
            "verseNumber": 17,
            "verseString": "Is one who relies on clear evidence from his Lord, reinforced by testimony from Him? Before this, the Scripture of Moses for guidance and mercy, and they believe in it. But whoever denies it from the factions, the Fire is his promised destination. So, don’t doubt it. It’s the truth from your Lord, but most people refuse to believe."
        },
        {
            "verseNumber": 18,
            "verseString": "Who is more unjust than one who invents a lie against God? These will be presented before their Lord, and the witnesses will proclaim, “These are the ones who lied concerning their Lord.” Behold, the curse of God is upon the wrongdoers.",
            "verseStringReplacedWithAllah": "Who is more unjust than one who invents a lie against Allah? These will be presented before their Lord, and the witnesses will proclaim, “These are the ones who lied concerning their Lord.” Behold, the curse of Allah is upon the wrongdoers."
        },
        {
            "verseNumber": 19,
            "verseString": "Those who deter others from God’s path, seek to twist it, and they are unbelievers in the Hereafter.",
            "verseStringReplacedWithAllah": "Those who deter others from Allah’s path, seek to twist it, and they are unbelievers in the Hereafter."
        },
        {
            "verseNumber": 20,
            "verseString": "They will find no escape on earth, nor any protectors apart from God. For them, the punishment will be multiplied, as they could not hear, and they could not see.",
            "verseStringReplacedWithAllah": "They will find no escape on earth, nor any protectors apart from Allah. For them, the punishment will be multiplied, as they could not hear, and they could not see."
        },
        {
            "verseNumber": 21,
            "verseString": "These are the ones who have lost their souls, and the illusions they invented have vanished from them."
        },
        {
            "verseNumber": 22,
            "verseString": "Indeed, in the Hereafter, they will be the greatest losers."
        },
        {
            "verseNumber": 23,
            "verseString": "As for those who believe, do righteous deeds, and humble themselves before their Lord, they will be the inhabitants of Paradise, residing there forever."
        },
        {
            "verseNumber": 24,
            "verseString": "Consider the two groups: one is blind and deaf, while the other can see and hear. Are they equal in comparison? Will you not think?"
        },
        {
            "verseNumber": 25,
            "verseString": "We sent Noah to his people, saying, “I am a clear warner to you.”"
        },
        {
            "verseNumber": 26,
            "verseString": "“Worship none but God. I fear for you the torment of a painful Day.”",
            "verseStringReplacedWithAllah": "“Worship none but Allah. I fear for you the torment of a painful Day.”"
        },
        {
            "verseNumber": 27,
            "verseString": "The disbelieving nobles among his people responded, “We see you as nothing more than a man like us, and only the most inferior among us, those lacking in judgment, follow you. We see no advantage in you over us; in fact, we think you are liars.”"
        },
        {
            "verseNumber": 28,
            "verseString": "He replied, “O my people, what if I am backed by clear evidence from my Lord, and He bestowed His mercy upon me, yet you fail to recognize it? Can we impose it upon you against your will?”"
        },
        {
            "verseNumber": 29,
            "verseString": "“O my people, I ask no reward from you; my reward is only from God. I will not drive away those who have believed. They are going to meet their Lord. But I see that you are a people steeped in ignorance.”",
            "verseStringReplacedWithAllah": "“O my people, I ask no reward from you; my reward is only from Allah. I will not drive away those who have believed. They are going to meet their Lord. But I see that you are a people steeped in ignorance.”"
        },
        {
            "verseNumber": 30,
            "verseString": "“O my people, who would support me against God if I drove them away? Will you not then mind?”",
            "verseStringReplacedWithAllah": "“O my people, who would support me against Allah if I drove them away? Will you not then mind?”"
        },
        {
            "verseNumber": 31,
            "verseString": "“I don’t pretend to hold the treasures of God, nor to know the unseen, and I don’t claim to be an angel. I don’t say that God won’t bless those you scorn. God knows what’s in their hearts. If I were to do so, I would be among the wrongdoers.”",
            "verseStringReplacedWithAllah": "“I don’t pretend to hold the treasures of Allah, nor to know the unseen, and I don’t claim to be an angel. I don’t say that Allah won’t bless those you scorn. Allah knows what’s in their hearts. If I were to do so, I would be among the wrongdoers.”"
        },
        {
            "verseNumber": 32,
            "verseString": "They replied, “O Noah, you’ve debated with us extensively. Now bring upon us what you threaten us with, if you are truthful.”"
        },
        {
            "verseNumber": 33,
            "verseString": "He replied, “Only God can bring it upon you, if He wills, and you won’t be able to evade it.”",
            "verseStringReplacedWithAllah": "He replied, “Only Allah can bring it upon you, if He wills, and you won’t be able to evade it.”"
        },
        {
            "verseNumber": 34,
            "verseString": "“Even if I were to advise you earnestly, my advice wouldn’t benefit you should God intend to misguide you. He is your Lord, and to Him, you will be returned.”",
            "verseStringReplacedWithAllah": "“Even if I were to advise you earnestly, my advice wouldn’t benefit you should Allah intend to misguide you. He is your Lord, and to Him, you will be returned.”"
        },
        {
            "verseNumber": 35,
            "verseString": "If they accuse you of making it up, say, “If I made it up, then the sin rests upon me, and I am innocent of the sins you commit.”"
        },
        {
            "verseNumber": 36,
            "verseString": "It was communicated to Noah, “None of your people will believe, except those who have already believed; therefore, don’t be disheartened by their actions.”"
        },
        {
            "verseNumber": 37,
            "verseString": "“And build the Ark under Our observation and Our inspiration, and don’t address Me concerning those who have wronged; they are to be drowned.”"
        },
        {
            "verseNumber": 38,
            "verseString": "While he was constructing the Ark, the leaders of his people would mock him whenever they passed by. He would respond, “If you ridicule us, we too will ridicule you, just as you ridicule us.”"
        },
        {
            "verseNumber": 39,
            "verseString": "“You will certainly know who will face humiliating punishment and on whom will descend a lasting penalty.”"
        },
        {
            "verseNumber": 40,
            "verseString": "When Our decree came to pass, and the volcano erupted, We instructed, “Load onto it a pair of every kind, along with your family—except for the condemned—and the believers.” Yet, only a few believed with him."
        },
        {
            "verseNumber": 41,
            "verseString": "He declared, “Embark! In the name of God, its course and anchorage. My Lord is Forgiving and Merciful.”",
            "verseStringReplacedWithAllah": "He declared, “Embark! In the name of Allah, its course and anchorage. My Lord is Forgiving and Merciful.”"
        },
        {
            "verseNumber": 42,
            "verseString": "And so, it sailed with them amidst waves as mountains. Noah called out to his son, who was separate from them, “O my son, come aboard with us, and don’t be with the unbelievers.”"
        },
        {
            "verseNumber": 43,
            "verseString": "He replied, “I will seek refuge on a mountain; it will protect me from the water.” He said, “Today, there is no protection against God’s decree, except for those who receive His mercy.” And the waves surged between them, and he was among the drowned.",
            "verseStringReplacedWithAllah": "He replied, “I will seek refuge on a mountain; it will protect me from the water.” He said, “Today, there is no protection against Allah’s decree, except for those who receive His mercy.” And the waves surged between them, and he was among the drowned."
        },
        {
            "verseNumber": 44,
            "verseString": "Then the command was issued, “O Earth, absorb your water,” and “O Sky, clear away.” The water receded, the event was concluded, and it settled on Mount Judi. And it was declared, “Away with the wrongdoing people!”"
        },
        {
            "verseNumber": 45,
            "verseString": "Noah called out to his Lord, and said, “My Lord, my son is of my family. Your promise is true, and You are the most fair of all judges.”"
        },
        {
            "verseNumber": 46,
            "verseString": "He responded, “O Noah, he is not of your family; he is of unrighteous conduct. Don’t ask Me about what you don’t know. I admonish you so that you don’t be among the ignorant.”"
        },
        {
            "verseNumber": 47,
            "verseString": "He pleaded, “O my Lord, I seek refuge in You from asking You about what I don’t understand. If you don’t forgive me and show me mercy, I will be among the losers.”"
        },
        {
            "verseNumber": 48,
            "verseString": "It was said, “O Noah, disembark in peace from Us, and blessings upon you, and upon nations who are with you. But to other nations, we will give enjoyment for a time, then from us will come a severe punishment.”"
        },
        {
            "verseNumber": 49,
            "verseString": "These are some of the accounts of the unseen, which We reveal to you. Neither you nor your people knew them before this. So, be patient. The ultimate outcome is for the righteous."
        },
        {
            "verseNumber": 50,
            "verseString": "To Aad, their brother Hud. He said, “O my people, worship God; you have no god other than Him. You but invent lies.”",
            "verseStringReplacedWithAllah": "To Aad, their brother Hud. He said, “O my people, worship Allah; you have no god other than Him. You but invent lies.”"
        },
        {
            "verseNumber": 51,
            "verseString": "“O my people, I ask for no compensation from you. My reward is only from the One who originated me. Don’t you understand?”"
        },
        {
            "verseNumber": 52,
            "verseString": "“O my people, seek forgiveness from your Lord, and turn to Him in repentance. He will send abundant rain from the sky and will increase your strength, and you should not return to your wrongdoing.”"
        },
        {
            "verseNumber": 53,
            "verseString": "They replied, “O Hud, you didn’t provide us clear evidence, and we won’t forsake our gods on your say-so. We don’t believe you.”"
        },
        {
            "verseNumber": 54,
            "verseString": "“We can only conclude that some of our gods afflicted you with evil.” He replied, “I call upon God to witness, and you to witness, that I’m innocent of what you associate.",
            "verseStringReplacedWithAllah": "“We can only conclude that some of our gods afflicted you with evil.” He replied, “I call upon Allah to witness, and you to witness, that I’m innocent of what you associate."
        },
        {
            "verseNumber": 55,
            "verseString": "Besides Him. Therefore, all of you plot against me without any delay."
        },
        {
            "verseNumber": 56,
            "verseString": "I place my trust in God, my Lord, and your Lord. There is no living being that He doesn’t hold by its forelock. Certainly, my Lord is on a straight path.",
            "verseStringReplacedWithAllah": "I place my trust in Allah, my Lord, and your Lord. There is no living being that He doesn’t hold by its forelock. Certainly, my Lord is on a straight path."
        },
        {
            "verseNumber": 57,
            "verseString": "If you turn away, I have conveyed to you the message I was sent with. My Lord will replace you with other people, and you won’t harm Him at all. My Lord is the Guardian over all things.”"
        },
        {
            "verseNumber": 58,
            "verseString": "And when Our decree was issued, We delivered Hud and those who had faith with him, by Our mercy, and We saved them from a harsh punishment."
        },
        {
            "verseNumber": 59,
            "verseString": "And that was Aad, who denied their Lord’s signs, disobeyed His messengers, and followed the command of every stubborn tyrant."
        },
        {
            "verseNumber": 60,
            "verseString": "They were followed by a curse in this world and on Resurrection Day. Unquestionably, Aad rejected their Lord. So, away with Aad, the people of Hud."
        },
        {
            "verseNumber": 61,
            "verseString": "To Thamud, their brother Saleh implored, “O my people, worship God; you have no deity other than Him. He initiated you from the earth and established you upon it. Seek His forgiveness, and repent to Him. My Lord is Near and Responsive.”",
            "verseStringReplacedWithAllah": "To Thamud, their brother Saleh implored, “O my people, worship Allah; you have no deity other than Him. He initiated you from the earth and established you upon it. Seek His forgiveness, and repent to Him. My Lord is Near and Responsive.”"
        },
        {
            "verseNumber": 62,
            "verseString": "They responded, “O Saleh, we had high hopes in you before this. Are you prohibiting us from worshiping what our ancestors worshiped? We are deeply uncertain about what you are inviting us to.”"
        },
        {
            "verseNumber": 63,
            "verseString": "He replied, “O my people, do you see that I have clear evidence from my Lord, and that He bestowed His mercy upon me? Who could help me against God if I were to disobey Him? You would only cause me greater loss.”",
            "verseStringReplacedWithAllah": "He replied, “O my people, do you see that I have clear evidence from my Lord, and that He bestowed His mercy upon me? Who could help me against Allah if I were to disobey Him? You would only cause me greater loss.”"
        },
        {
            "verseNumber": 64,
            "verseString": "“O my people, this is God’s she-camel for you as a symbol. Let her graze on God’s earth and don’t harm her, lest a swift punishment overtakes you.”",
            "verseStringReplacedWithAllah": "“O my people, this is Allah’s she-camel for you as a symbol. Let her graze on Allah’s earth and don’t harm her, lest a swift punishment overtakes you.”"
        },
        {
            "verseNumber": 65,
            "verseString": "Yet, they hamstrung her. He then declared, “Enjoy yourselves in your homes for three days. This is an irrevocable prophecy.”"
        },
        {
            "verseNumber": 66,
            "verseString": "When Our decree came to pass, We saved Saleh and those who believed with him, by Our mercy, from the disgrace of that day. Your Lord is the All-Powerful, the Almighty."
        },
        {
            "verseNumber": 67,
            "verseString": "And a loud scream seized the wrongdoers; and they became corpses in their homes."
        },
        {
            "verseNumber": 68,
            "verseString": "As if they had never flourished there. Thamud denied their Lord, so away with Thamud!"
        },
        {
            "verseNumber": 69,
            "verseString": "Our messengers came to Abraham with good news. They said, “Peace,” and he answered, “Peace,” and promptly brought a roasted calf."
        },
        {
            "verseNumber": 70,
            "verseString": "But when he saw their hands not reaching for it, he grew suspicious and felt a sense of apprehension. They said, “Fear not; we’ve been sent to the people of Lot.”"
        },
        {
            "verseNumber": 71,
            "verseString": "And his wife was standing, and she laughed. Then We gave her the joyful news of Isaac and, following Isaac, Jacob."
        },
        {
            "verseNumber": 72,
            "verseString": "She exclaimed, “Wondrous indeed! Will I give birth while I am an old woman, and this husband of mine is an old man? This is truly a strange thing!”"
        },
        {
            "verseNumber": 73,
            "verseString": "They replied, “Are you amazed at God’s decree? May God’s mercy and blessings be upon you, O family of the house. He is Praiseworthy, Most Glorious.”",
            "verseStringReplacedWithAllah": "They replied, “Are you amazed at Allah’s decree? May Allah’s mercy and blessings be upon you, O family of the house. He is Praiseworthy, Most Glorious.”"
        },
        {
            "verseNumber": 74,
            "verseString": "Once Abraham’s fear subsided and the good news reached him, he began to argue with Us for Lot’s people."
        },
        {
            "verseNumber": 75,
            "verseString": "Abraham was compassionate, tender-hearted, and oft-returning."
        },
        {
            "verseNumber": 76,
            "verseString": "“O Abraham, desist from this. Your Lord’s decree has come, and their punishment is irreversible.”"
        },
        {
            "verseNumber": 77,
            "verseString": "When Our messengers arrived at Lot’s, he was distressed and felt powerless, unable to protect them. He exclaimed, “This is a difficult day.”"
        },
        {
            "verseNumber": 78,
            "verseString": "His people, accustomed to sinful acts, came rushing towards him. He pleaded, “O my people, these are my daughters; they are purer for you. So fear God, and don’t disgrace me before my guests. Isn’t there a rational man among you?”",
            "verseStringReplacedWithAllah": "His people, accustomed to sinful acts, came rushing towards him. He pleaded, “O my people, these are my daughters; they are purer for you. So fear Allah, and don’t disgrace me before my guests. Isn’t there a rational man among you?”"
        },
        {
            "verseNumber": 79,
            "verseString": "They responded, “You know well we have no right to your daughters, and you know what we want.”"
        },
        {
            "verseNumber": 80,
            "verseString": "He said, “If only I had the strength or could rely on a strong support.”"
        },
        {
            "verseNumber": 81,
            "verseString": "They said, “O Lot, we are the messengers of your Lord. They won’t reach you. So travel with your family during the cover of the night, and let none of you look back, except your wife. She will be struck by what strikes them. Their appointed time is the morning—isn’t the morning near?”"
        },
        {
            "verseNumber": 82,
            "verseString": "When Our command came, we overturned it completely, and We rained down upon it stones of baked clay."
        },
        {
            "verseNumber": 83,
            "verseString": "Designated by your Lord, and they are never far from the wrongdoers."
        },
        {
            "verseNumber": 84,
            "verseString": "To Midian, their brother Shuaib. He warned, “O my people, worship God; you have no deity other than Him. Don’t short-change in measurement and weight. I see you in good condition, but I fear the punishment of a besieging day for you.”",
            "verseStringReplacedWithAllah": "To Midian, their brother Shuaib. He warned, “O my people, worship Allah; you have no deity other than Him. Don’t short-change in measurement and weight. I see you in good condition, but I fear the punishment of a besieging day for you.”"
        },
        {
            "verseNumber": 85,
            "verseString": "“O my people, give full measure and weight with justice, don’t cheat people out of their rights, and don’t commit corruption in the land."
        },
        {
            "verseNumber": 86,
            "verseString": "The remainder from God is better for you, if you are believers. And I’m not a keeper over you.”",
            "verseStringReplacedWithAllah": "The remainder from Allah is better for you, if you are believers. And I’m not a keeper over you.”"
        },
        {
            "verseNumber": 87,
            "verseString": "They responded, “O Shuaib, does your prayer command us to abandon what our ancestors worshiped, or to refrain from doing with our wealth what we please? Indeed, you are the forbearing, the right-guided!”"
        },
        {
            "verseNumber": 88,
            "verseString": "He responded, “O my people, did you consider: if I am on clear evidence from my Lord and He provided me with a good provision from Him? I don’t want to be in conflict with you about what I prohibit for you. I only desire reform to the best of my ability. My success is only through God. I have placed my trust upon Him, and to Him, I turn.”",
            "verseStringReplacedWithAllah": "He responded, “O my people, did you consider: if I am on clear evidence from my Lord and He provided me with a good provision from Him? I don’t want to be in conflict with you about what I prohibit for you. I only desire reform to the best of my ability. My success is only through Allah. I have placed my trust upon Him, and to Him, I turn.”"
        },
        {
            "verseNumber": 89,
            "verseString": "“O my people, let not your opposition to me cause you to suffer the same fate as the people of Noah or Salih. And the people of Lot aren’t far from you.”"
        },
        {
            "verseNumber": 90,
            "verseString": "“And seek forgiveness from your Lord, then repent to Him. My Lord is Merciful and Affectionate.”"
        },
        {
            "verseNumber": 91,
            "verseString": "They said, “O Shuaib, we don’t grasp much of what you say, and we see you as weak among us. Were it not for your family, we would’ve stoned you, for you have no influence over us.”"
        },
        {
            "verseNumber": 92,
            "verseString": "He replied, “Is my family more esteemed to you than God, and you’ve pushed Him behind your backs? My Lord is fully aware of what you do.”",
            "verseStringReplacedWithAllah": "He replied, “Is my family more esteemed to you than Allah, and you’ve pushed Him behind your backs? My Lord is fully aware of what you do.”"
        },
        {
            "verseNumber": 93,
            "verseString": "“O my people, do as you will, and I will act. You will then know who will face a humiliating punishment and who is a liar. Wait; I am waiting with you.”"
        },
        {
            "verseNumber": 94,
            "verseString": "When Our decree came, We saved Shuaib and those who believed with him, by mercy from Us. And the shriek overtook the wrongdoers, and they became corpses in their homes."
        },
        {
            "verseNumber": 95,
            "verseString": "As if they had never flourished there. So, away with Midian, just as Thamud was done away with."
        },
        {
            "verseNumber": 96,
            "verseString": "We sent Moses with Our signs and a clear mandate."
        },
        {
            "verseNumber": 97,
            "verseString": "To Pharaoh and his nobility, but they followed Pharaoh’s dictates, although Pharoah’s dictates weren’t rational."
        },
        {
            "verseNumber": 98,
            "verseString": "On the Day of Resurrection, he will lead his people into the Fire—a horrendous place to be led to."
        },
        {
            "verseNumber": 99,
            "verseString": "They were pursued by a curse in this life—and on Resurrection Day. What a horrid gift they chose!"
        },
        {
            "verseNumber": 100,
            "verseString": "These are some of the stories of the communities that We narrate to you. Some of them are still standing, others are stubble."
        },
        {
            "verseNumber": 101,
            "verseString": "We didn’t wrong them, but they wronged themselves. Their gods, which they invoked besides God, availed them nothing when your Lord’s command arrived; they only added to their ruin.",
            "verseStringReplacedWithAllah": "We didn’t wrong them, but they wronged themselves. Their gods, which they invoked besides Allah, availed them nothing when your Lord’s command arrived; they only added to their ruin."
        },
        {
            "verseNumber": 102,
            "verseString": "Such is your Lord’s grip when He seizes the communities while they are immersed in wrongdoing. Indeed, His grip is painful and severe."
        },
        {
            "verseNumber": 103,
            "verseString": "This is a warning for those who fear the punishment of the Hereafter. That’s a Day for which the people will be gathered, and that’s a Day witnessed."
        },
        {
            "verseNumber": 104,
            "verseString": "We only delay it for a determined period."
        },
        {
            "verseNumber": 105,
            "verseString": "When that day arrives, no soul will speak except by His leave. Some will be miserable, while others will be happy."
        },
        {
            "verseNumber": 106,
            "verseString": "As for those who are miserable, they will be in the Fire, where they will sigh and wail."
        },
        {
            "verseNumber": 107,
            "verseString": "They will dwell there for as long as the heavens and the earth last, unless your Lord wills differently. Your Lord accomplishes what He intends."
        },
        {
            "verseNumber": 108,
            "verseString": "As for the happy, they will be in Paradise, residing for as long as the heavens and the earth last, unless your Lord wills differently—a gift without end."
        },
        {
            "verseNumber": 109,
            "verseString": "So don’t be in doubt about what these people worship. They only worship as their ancestors did before. We will give them their full recompense, without any reduction."
        },
        {
            "verseNumber": 110,
            "verseString": "We gave Moses the Scripture, but disputes arose concerning it. If not for a prior decree from your Lord, their disputes would’ve been resolved. Yet they remain deeply uncertain about it."
        },
        {
            "verseNumber": 111,
            "verseString": "Your Lord will fully pay them for their deeds. Surely He is well aware of everything they do."
        },
        {
            "verseNumber": 112,
            "verseString": "So be upright, as you’ve been commanded, and whoever repents with you. And don’t transgress. He sees all that you do."
        },
        {
            "verseNumber": 113,
            "verseString": "And don’t incline towards those who do wrong, lest the Fire should touch you. You would then have no protectors other than God, and you wouldn’t be helped.",
            "verseStringReplacedWithAllah": "And don’t incline towards those who do wrong, lest the Fire should touch you. You would then have no protectors other than Allah, and you wouldn’t be helped."
        },
        {
            "verseNumber": 114,
            "verseString": "Establish the prayer at the two ends of the day, and during parts of the night. Good deeds take away bad deeds. This is a reminder for the mindful."
        },
        {
            "verseNumber": 115,
            "verseString": "And be patient, for surely God won’t waste the reward of those who do good.",
            "verseStringReplacedWithAllah": "And be patient, for surely Allah won’t waste the reward of those who do good."
        },
        {
            "verseNumber": 116,
            "verseString": "If there had been, among the generations before you, people with discernment to ward off corruption on earth—except for the few whom We saved. But the wrongdoers pursued the luxuries they were granted and became transgressors."
        },
        {
            "verseNumber": 117,
            "verseString": "Your Lord would never unjustly destroy communities while their inhabitants work towards reform."
        },
        {
            "verseNumber": 118,
            "verseString": "Had your Lord willed, He could’ve made humanity a single community, but people will continue to differ."
        },
        {
            "verseNumber": 119,
            "verseString": "Except those on whom your Lord has mercy—and for that reason He created them—and the word of your Lord has been fulfilled: “I will fill hell with jinn and humans together.”"
        },
        {
            "verseNumber": 120,
            "verseString": "We narrate to you the stories of the messengers to strengthen your heart. In these, the truth has come to you, along with guidance and reminders for the believers."
        },
        {
            "verseNumber": 121,
            "verseString": "Say to those who don’t believe, “Work according to your ability; and we are working.”"
        },
        {
            "verseNumber": 122,
            "verseString": "“And wait; we, too, are waiting.”"
        },
        {
            "verseNumber": 123,
            "verseString": "To God belongs the unseen of the heavens and the earth. All matters are returned to Him. Worship Him and put your trust in Him. Your Lord is not unaware of what you do.",
            "verseStringReplacedWithAllah": "To Allah belongs the unseen of the heavens and the earth. All matters are returned to Him. Worship Him and put your trust in Him. Your Lord is not unaware of what you do."
        }
    ],
    "chapterNumber": 11,
    "nameInEnglish": "Hud",
    "nameInTransliteration": "Hud",
    "nameInArabic": "هود",
    "numberOfVerses": 123
}