{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif. Lam. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "These are the verses of the Book of Wisdom."
        },
        {
            "verseNumber": 3,
            "verseString": "Guidance and mercy for the doers of good."
        },
        {
            "verseNumber": 4,
            "verseString": "Those who perform prayer, give purifying charity, and are certain of the Hereafter."
        },
        {
            "verseNumber": 5,
            "verseString": "These are guided by their Lord. These are the successful."
        },
        {
            "verseNumber": 6,
            "verseString": "Some people purchase vain talk to mislead others from God’s path without knowledge, and they treat it with ridicule. For them, a humiliating punishment awaits.",
            "verseStringReplacedWithAllah": "Some people purchase vain talk to mislead others from Allah’s path without knowledge, and they treat it with ridicule. For them, a humiliating punishment awaits."
        },
        {
            "verseNumber": 7,
            "verseString": "When Our verses are recited to him, he turns away arrogantly, as if he didn’t hear them, as if his ears are blocked. So, inform him of a severe punishment."
        },
        {
            "verseNumber": 8,
            "verseString": "Those who believe and do righteous deeds—for them are Gardens of Delight."
        },
        {
            "verseNumber": 9,
            "verseString": "Where they will dwell eternally. The promise of God is truth. He is the Mighty, the Wise.",
            "verseStringReplacedWithAllah": "Where they will dwell eternally. The promise of Allah is truth. He is the Mighty, the Wise."
        },
        {
            "verseNumber": 10,
            "verseString": "He created the heavens with no visible pillars, and He placed firm mountains on the earth, lest it shakes with you. He spread throughout it a variety of living creatures. We send down rain from the sky, causing all types of fine plants to grow."
        },
        {
            "verseNumber": 11,
            "verseString": "This is the creation of God. Now, show Me what those other than Him have created. The wrongdoers are in clear error.",
            "verseStringReplacedWithAllah": "This is the creation of Allah. Now, show Me what those other than Him have created. The wrongdoers are in clear error."
        },
        {
            "verseNumber": 12,
            "verseString": "We granted Luqman wisdom: “Give thanks to God. Whoever is grateful, it is for his own good. And whoever is ungrateful—God is Self-Sufficient and Praiseworthy.”",
            "verseStringReplacedWithAllah": "We granted Luqman wisdom: “Give thanks to Allah. Whoever is grateful, it is for his own good. And whoever is ungrateful—Allah is Self-Sufficient and Praiseworthy.”"
        },
        {
            "verseNumber": 13,
            "verseString": "Luqman said to his son while counseling him, “O my son, don’t associate anything with God, for polytheism is a tremendous injustice.”",
            "verseStringReplacedWithAllah": "Luqman said to his son while counseling him, “O my son, don’t associate anything with Allah, for polytheism is a tremendous injustice.”"
        },
        {
            "verseNumber": 14,
            "verseString": "We instructed the human being to honor his parents. His mother carried him with hardship and gave birth to him in pain, and his weaning takes two years. Be grateful to Me and your parents; to Me is the final destination."
        },
        {
            "verseNumber": 15,
            "verseString": "But if they endeavor to make you associate others with Me, of which you don’t know, don’t obey them. However, treat them kindly in this world, and follow the path of those who turn to Me. Then, to Me is your return, and I will inform you of everything you did."
        },
        {
            "verseNumber": 16,
            "verseString": "“O my son, even the weight of a mustard seed, whether hidden in a rock, the heavens, or on earth, God will bring it forth. God is Subtle, All-Aware.",
            "verseStringReplacedWithAllah": "“O my son, even the weight of a mustard seed, whether hidden in a rock, the heavens, or on earth, Allah will bring it forth. Allah is Subtle, All-Aware."
        },
        {
            "verseNumber": 17,
            "verseString": "O my son, establish prayer, advocate for righteousness, forbid what’s wrong, and be patient with whatever happens to you. These are matters of determination."
        },
        {
            "verseNumber": 18,
            "verseString": "And don’t turn your cheek in scorn towards people, and don’t strut around exultantly on earth. God doesn’t like any arrogant boaster.",
            "verseStringReplacedWithAllah": "And don’t turn your cheek in scorn towards people, and don’t strut around exultantly on earth. Allah doesn’t like any arrogant boaster."
        },
        {
            "verseNumber": 19,
            "verseString": "And walk modestly and lower your voice; the most unpleasant of sounds is the braying of donkeys.”"
        },
        {
            "verseNumber": 20,
            "verseString": "Don’t you see that God subjected everything in the heavens and on earth to you, and He showered upon you His visible and hidden blessings? Yet some argue about God without knowledge, guidance, and an enlightening scripture.",
            "verseStringReplacedWithAllah": "Don’t you see that Allah subjected everything in the heavens and on earth to you, and He showered upon you His visible and hidden blessings? Yet some argue about Allah without knowledge, guidance, and an enlightening scripture."
        },
        {
            "verseNumber": 21,
            "verseString": "When they’re advised, “Follow what God revealed,” they respond, “No, we follow what we found our ancestors doing.” Even if Satan is leading them towards the torment of the Inferno?",
            "verseStringReplacedWithAllah": "When they’re advised, “Follow what Allah revealed,” they respond, “No, we follow what we found our ancestors doing.” Even if Satan is leading them towards the torment of the Inferno?"
        },
        {
            "verseNumber": 22,
            "verseString": "Whoever submits completely to God and leads a righteous life has grasped the most secure handhold. The ultimate outcome of all matters is to God.",
            "verseStringReplacedWithAllah": "Whoever submits completely to Allah and leads a righteous life has grasped the most secure handhold. The ultimate outcome of all matters is to Allah."
        },
        {
            "verseNumber": 23,
            "verseString": "As for those who disbelieve, don’t let their disbelief sadden you. They will return to Us, and We will inform them of their deeds. God is fully aware of the contents of the hearts.",
            "verseStringReplacedWithAllah": "As for those who disbelieve, don’t let their disbelief sadden you. They will return to Us, and We will inform them of their deeds. Allah is fully aware of the contents of the hearts."
        },
        {
            "verseNumber": 24,
            "verseString": "We give them little enjoyment, but ultimately, We will drive them to a harsh punishment."
        },
        {
            "verseNumber": 25,
            "verseString": "If you ask them, “Who created the heavens and the earth?” They would answer, “God.” Say, “Praise be to God.” But most of them don’t understand.",
            "verseStringReplacedWithAllah": "If you ask them, “Who created the heavens and the earth?” They would answer, “Allah.” Say, “Praise be to Allah.” But most of them don’t understand."
        },
        {
            "verseNumber": 26,
            "verseString": "To God belongs everything in the heavens and the earth. God is the Rich, the Praiseworthy.",
            "verseStringReplacedWithAllah": "To Allah belongs everything in the heavens and the earth. Allah is the Rich, the Praiseworthy."
        },
        {
            "verseNumber": 27,
            "verseString": "Even if all the trees on earth were made into pens, and the ocean, supplemented by seven additional oceans, were turned into ink, God’s words wouldn’t be depleted. God is Exalted in Might and Wisdom.",
            "verseStringReplacedWithAllah": "Even if all the trees on earth were made into pens, and the ocean, supplemented by seven additional oceans, were turned into ink, Allah’s words wouldn’t be depleted. Allah is Exalted in Might and Wisdom."
        },
        {
            "verseNumber": 28,
            "verseString": "Your creation and resurrection are akin to that of a single soul. God is All-Hearing, All-Seeing.",
            "verseStringReplacedWithAllah": "Your creation and resurrection are akin to that of a single soul. Allah is All-Hearing, All-Seeing."
        },
        {
            "verseNumber": 29,
            "verseString": "Don’t you see how God merges night into day and day into night? How He subjected the sun and the moon, each running for a specified period, and that God is fully aware of your deeds?",
            "verseStringReplacedWithAllah": "Don’t you see how Allah merges night into day and day into night? How He subjected the sun and the moon, each running for a specified period, and that Allah is fully aware of your deeds?"
        },
        {
            "verseNumber": 30,
            "verseString": "This is because God is the Absolute Truth, and anything that they invoke beside Him is false. God is the Exalted, the Great.",
            "verseStringReplacedWithAllah": "This is because Allah is the Absolute Truth, and anything that they invoke beside Him is false. Allah is the Exalted, the Great."
        },
        {
            "verseNumber": 31,
            "verseString": "Don’t you see how ships sail across the sea by God’s grace, to show you some of His signs? In this, there are signs for every patient, grateful person.",
            "verseStringReplacedWithAllah": "Don’t you see how ships sail across the sea by Allah’s grace, to show you some of His signs? In this, there are signs for every patient, grateful person."
        },
        {
            "verseNumber": 32,
            "verseString": "When engulfed by towering waves, they call upon God, sincerely devoted to Him. Yet, once he brings them safely to land, some of them waver. Only the ungrateful, treacherous denies Our signs.",
            "verseStringReplacedWithAllah": "When engulfed by towering waves, they call upon Allah, sincerely devoted to Him. Yet, once he brings them safely to land, some of them waver. Only the ungrateful, treacherous denies Our signs."
        },
        {
            "verseNumber": 33,
            "verseString": "O people! Be mindful of your Lord, and fear a Day when no parent can avail their child, nor can a child avail their parent. Indeed, the promise of God is true. Therefore, let not the transient life deceive you, and let not the arch-deceiver deceive you about God.",
            "verseStringReplacedWithAllah": "O people! Be mindful of your Lord, and fear a Day when no parent can avail their child, nor can a child avail their parent. Indeed, the promise of Allah is true. Therefore, let not the transient life deceive you, and let not the arch-deceiver deceive you about Allah."
        },
        {
            "verseNumber": 34,
            "verseString": "The knowledge of the Hour is with God. He sends down the rain, and He knows what’s in the wombs. No soul knows what it will earn tomorrow, and no soul knows in which land it will die. God is All-Knowing, Fully-Aware.",
            "verseStringReplacedWithAllah": "The knowledge of the Hour is with Allah. He sends down the rain, and He knows what’s in the wombs. No soul knows what it will earn tomorrow, and no soul knows in which land it will die. Allah is All-Knowing, Fully-Aware."
        }
    ],
    "chapterNumber": 31,
    "nameInEnglish": "Luqman",
    "nameInTransliteration": "Luqman",
    "nameInArabic": "لقمان",
    "numberOfVerses": 34
}