{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif, Lam, Meem, Ra. These are the verses of the Scripture. What was revealed to you from your Lord is the truth, yet most people don’t believe."
        },
        {
            "verseNumber": 2,
            "verseString": "It is God who raised the skies without any pillars you can see, then He established Himself upon the Throne. He subjected the sun and the moon, each running for a set term. He conducts all affairs and explains the signs, so that you may be certain of meeting your Lord.",
            "verseStringReplacedWithAllah": "It is Allah who raised the skies without any pillars you can see, then He established Himself upon the Throne. He subjected the sun and the moon, each running for a set term. He conducts all affairs and explains the signs, so that you may be certain of meeting your Lord."
        },
        {
            "verseNumber": 3,
            "verseString": "It is He who spread the earth, placed mountains and rivers on it, and of every fruit, He made therein two mates. He covers the night with the day. In that are signs for people who give thought."
        },
        {
            "verseNumber": 4,
            "verseString": "On earth are adjacent terrains, vineyards, fields of crops, and date palms, from shared or separate roots, irrigated with the same water. We make some taste better than others. In this are signs for people who reason."
        },
        {
            "verseNumber": 5,
            "verseString": "If you’re amazed, even amazing is their statement: “When we are dust, will we be created anew?” These are the ones who denied their Lord. They will have shackles around their necks. They will be the inhabitants of the Fire, dwelling therein forever."
        },
        {
            "verseNumber": 6,
            "verseString": "They eagerly want you to bring about bad before good, even though there were instances before them. Your Lord is abundant in forgiveness for people, despite their wrongdoings, and yet, your Lord is severe in retribution."
        },
        {
            "verseNumber": 7,
            "verseString": "Those who disbelieve ask, “Why has no miracle been sent down to him from his Lord?” You are but a warner; and for every people, there is a guide."
        },
        {
            "verseNumber": 8,
            "verseString": "God knows what every female carries, and what the wombs diminish or increase. Everything with Him is of due proportion.",
            "verseStringReplacedWithAllah": "Allah knows what every female carries, and what the wombs diminish or increase. Everything with Him is of due proportion."
        },
        {
            "verseNumber": 9,
            "verseString": "He is the Knower of the unseen and the witnessed, the Grand, the Most High."
        },
        {
            "verseNumber": 10,
            "verseString": "It’s the same whether one of you conceals his speech or declares it openly, and whether one hides in the night or goes out freely in the day."
        },
        {
            "verseNumber": 11,
            "verseString": "Guardians are stationed before and behind him, safeguarding him by God’s command. God won’t change people’s condition until they change what’s within themselves. If God intends for a people ill, there is no repelling it, and they have no defender or supporter besides Him.",
            "verseStringReplacedWithAllah": "Guardians are stationed before and behind him, safeguarding him by Allah’s command. Allah won’t change people’s condition until they change what’s within themselves. If Allah intends for a people ill, there is no repelling it, and they have no defender or supporter besides Him."
        },
        {
            "verseNumber": 12,
            "verseString": "It is He who shows you lightning, causing fear and hope, and produces the heavy clouds."
        },
        {
            "verseNumber": 13,
            "verseString": "The thunder glorifies His praise, as do the angels, out of awe for Him. He releases thunderbolts and strikes with them whom He wills. Yet they argue about God, despite Him being tremendous in might and authority.",
            "verseStringReplacedWithAllah": "The thunder glorifies His praise, as do the angels, out of awe for Him. He releases thunderbolts and strikes with them whom He wills. Yet they argue about Allah, despite Him being tremendous in might and authority."
        },
        {
            "verseNumber": 14,
            "verseString": "To Him is the call of truth. Those they pray to besides Him can’t respond to them with a thing, except like one who reaches his hand out to the water, only for it never to reach his mouth. The prayers of the unbelievers are but in vain."
        },
        {
            "verseNumber": 15,
            "verseString": "To God do all those in the heavens and the earth bow down, willingly or unwillingly, and their shadows in the mornings and the afternoons.",
            "verseStringReplacedWithAllah": "To Allah do all those in the heavens and the earth bow down, willingly or unwillingly, and their shadows in the mornings and the afternoons."
        },
        {
            "verseNumber": 16,
            "verseString": "Ask, “Who is the Lord of the heavens and the earth?” Answer, “God.” Then ask, “Have you taken other than Him allies, who can neither benefit nor harm themselves?” Say, “Are the blind and the sighted equal? Or are darkness and light alike? Or have they ascribed partners to God who supposedly created creations similar to His, so that creation appeared similar to them?” Say, “God is the Creator of everything, He is the One, the Overpowering.”",
            "verseStringReplacedWithAllah": "Ask, “Who is the Lord of the heavens and the earth?” Answer, “Allah.” Then ask, “Have you taken other than Him allies, who can neither benefit nor harm themselves?” Say, “Are the blind and the sighted equal? Or are darkness and light alike? Or have they ascribed partners to Allah who supposedly created creations similar to His, so that creation appeared similar to them?” Say, “Allah is the Creator of everything, He is the One, the Overpowering.”"
        },
        {
            "verseNumber": 17,
            "verseString": "He sends down water from the sky, and valleys flow according to their capacity. The torrent carries overflowing foam, akin to what emerges from metals when melted for crafting jewelry and tools. Thus, God illustrates truth and falsehood. The foam dissipates, but what benefits humanity remains on earth. Thus, God presents parables.",
            "verseStringReplacedWithAllah": "He sends down water from the sky, and valleys flow according to their capacity. The torrent carries overflowing foam, akin to what emerges from metals when melted for crafting jewelry and tools. Thus, Allah illustrates truth and falsehood. The foam dissipates, but what benefits humanity remains on earth. Thus, Allah presents parables."
        },
        {
            "verseNumber": 18,
            "verseString": "For those who respond to their Lord is the best. But for those who don’t respond to Him—even if they possessed everything on earth, and an equivalent besides, they would offer it to ransom themselves. These will face a terrible reckoning, and their housing will be Hell—a dreadful dwelling."
        },
        {
            "verseNumber": 19,
            "verseString": "Is one who knows that what has been revealed to you from your Lord is the truth like the one who is blind? Only people of understanding will remember."
        },
        {
            "verseNumber": 20,
            "verseString": "Those who honor the covenant of God and don’t break the contract.",
            "verseStringReplacedWithAllah": "Those who honor the covenant of Allah and don’t break the contract."
        },
        {
            "verseNumber": 21,
            "verseString": "And those who join what God has commanded to be joined, revere their Lord, and dread the dire reckoning.",
            "verseStringReplacedWithAllah": "And those who join what Allah has commanded to be joined, revere their Lord, and dread the dire reckoning."
        },
        {
            "verseNumber": 22,
            "verseString": "Those who patiently seek their Lord’s presence, pray regularly, spend out of what We’ve provided for them—secretly and openly—and repel evil with good, for them is the ultimate home."
        },
        {
            "verseNumber": 23,
            "verseString": "The Gardens of Eden, which they will enter, along with the righteous among their parents, spouses, and offspring. Angels will enter upon them from every gate."
        },
        {
            "verseNumber": 24,
            "verseString": "“Peace be upon you due to your patience. How wonderful is the final home!”"
        },
        {
            "verseNumber": 25,
            "verseString": "And those who break the covenant of God after its ratification, sever what God has commanded to be joined, and spread corruption on earth, upon them is the curse, and they will have a wretched home.",
            "verseStringReplacedWithAllah": "And those who break the covenant of Allah after its ratification, sever what Allah has commanded to be joined, and spread corruption on earth, upon them is the curse, and they will have a wretched home."
        },
        {
            "verseNumber": 26,
            "verseString": "God expands the provision for whom He wills and measures it. They rejoice in the worldly life, while the worldly life, compared to the Hereafter, is but temporary enjoyment.",
            "verseStringReplacedWithAllah": "Allah expands the provision for whom He wills and measures it. They rejoice in the worldly life, while the worldly life, compared to the Hereafter, is but temporary enjoyment."
        },
        {
            "verseNumber": 27,
            "verseString": "The disbelievers argue, “Why has a sign not been sent down upon him from his Lord?” Answer, “God leads astray whom He wills, and He guides to Himself those who turn back.”",
            "verseStringReplacedWithAllah": "The disbelievers argue, “Why has a sign not been sent down upon him from his Lord?” Answer, “Allah leads astray whom He wills, and He guides to Himself those who turn back.”"
        },
        {
            "verseNumber": 28,
            "verseString": "Those who believe and whose hearts find tranquility in the remembrance of God—for indeed, it is through the remembrance of God that hearts find peace.",
            "verseStringReplacedWithAllah": "Those who believe and whose hearts find tranquility in the remembrance of Allah—for indeed, it is through the remembrance of Allah that hearts find peace."
        },
        {
            "verseNumber": 29,
            "verseString": "Those who believe and do righteous deeds—blessedness is theirs and a beautiful return."
        },
        {
            "verseNumber": 30,
            "verseString": "We sent you amongst a nation, as We sent to nations before you, to convey to them what We revealed to you. Yet they deny the Most Merciful. Say, “He is my Lord; there is no god but Him. On Him I have relied, and to Him is my return.”"
        },
        {
            "verseNumber": 31,
            "verseString": "And even if there was a Quran that could move mountains, split the earth, or make the dead speak, the ultimate authority would still belong to God. Didn’t those who believed give up, realizing that if God so willed, He could guide all of humanity? The unbelievers will continue to suffer calamities due to what they did, or they fall near their homes, until God’s promise is fulfilled. God does not fail in His promise.",
            "verseStringReplacedWithAllah": "And even if there was a Quran that could move mountains, split the earth, or make the dead speak, the ultimate authority would still belong to Allah. Didn’t those who believed give up, realizing that if Allah so willed, He could guide all of humanity? The unbelievers will continue to suffer calamities due to what they did, or they fall near their homes, until Allah’s promise is fulfilled. Allah does not fail in His promise."
        },
        {
            "verseNumber": 32,
            "verseString": "Messengers before you were also ridiculed, but I allowed the unbelievers to carry on, only to seize them—how severe was My retribution!"
        },
        {
            "verseNumber": 33,
            "verseString": "Who is He, the One observing over every soul and its actions? And yet they attribute partners to God. Say, “Name them! Or are you informing Him of something He doesn’t know on Earth? Or is it mere outward speech?” Their plots seem appealing to the unbelievers, and they are blocked from the path. Whomever God leads astray, there is no guide for him.",
            "verseStringReplacedWithAllah": "Who is He, the One observing over every soul and its actions? And yet they attribute partners to Allah. Say, “Name them! Or are you informing Him of something He doesn’t know on Earth? Or is it mere outward speech?” Their plots seem appealing to the unbelievers, and they are blocked from the path. Whomever Allah leads astray, there is no guide for him."
        },
        {
            "verseNumber": 34,
            "verseString": "They will have suffering in this worldly life, and the suffering of the hereafter is harsher, and they will have no protector from God.",
            "verseStringReplacedWithAllah": "They will have suffering in this worldly life, and the suffering of the hereafter is harsher, and they will have no protector from Allah."
        },
        {
            "verseNumber": 35,
            "verseString": "The example of Paradise promised to the righteous is where rivers flow beneath. Its produce and shade are everlasting. Such is the end result for the righteous, while the end result for unbelievers is the Fire."
        },
        {
            "verseNumber": 36,
            "verseString": "Those whom We’ve given the scripture rejoice in what was revealed to You. But some factions deny parts of it. Say, “I am commanded to worship God alone and not associate anything with Him. To Him, I call, and to Him, is my return.”",
            "verseStringReplacedWithAllah": "Those whom We’ve given the scripture rejoice in what was revealed to You. But some factions deny parts of it. Say, “I am commanded to worship Allah alone and not associate anything with Him. To Him, I call, and to Him, is my return.”"
        },
        {
            "verseNumber": 37,
            "verseString": "And thus, We’ve revealed it as a law in Arabic. If you should follow their desires after what has come to you of knowledge, there will be no protector or ally for you against God.",
            "verseStringReplacedWithAllah": "And thus, We’ve revealed it as a law in Arabic. If you should follow their desires after what has come to you of knowledge, there will be no protector or ally for you against Allah."
        },
        {
            "verseNumber": 38,
            "verseString": "We sent messengers before you, and We assigned to them wives and descendants. It’s not for a messenger to come with a sign except by God’s permission. For every era, there is a scripture.",
            "verseStringReplacedWithAllah": "We sent messengers before you, and We assigned to them wives and descendants. It’s not for a messenger to come with a sign except by Allah’s permission. For every era, there is a scripture."
        },
        {
            "verseNumber": 39,
            "verseString": "God eliminates what He wills or confirms it, and with Him is the Source Scripture.",
            "verseStringReplacedWithAllah": "Allah eliminates what He wills or confirms it, and with Him is the Source Scripture."
        },
        {
            "verseNumber": 40,
            "verseString": "Whether We show you some of what We promised them, or We end your life, you have to convey, and judgment is Ours."
        },
        {
            "verseNumber": 41,
            "verseString": "Don’t they see that We are reducing the land from its borders? God decrees. None can overturn His decision. And He is swift in accounting.",
            "verseStringReplacedWithAllah": "Don’t they see that We are reducing the land from its borders? Allah decrees. None can overturn His decision. And He is swift in accounting."
        },
        {
            "verseNumber": 42,
            "verseString": "Those before them plotted, but all planning belongs to God. He knows what every soul earns. The unbelievers will find out who gets the ultimate Home.",
            "verseStringReplacedWithAllah": "Those before them plotted, but all planning belongs to Allah. He knows what every soul earns. The unbelievers will find out who gets the ultimate Home."
        },
        {
            "verseNumber": 43,
            "verseString": "The unbelievers say, “You are not a Messenger.” Respond, “God suffices as a witness between me and you, along with anyone who has knowledge of the Scripture.”",
            "verseStringReplacedWithAllah": "The unbelievers say, “You are not a Messenger.” Respond, “Allah suffices as a witness between me and you, along with anyone who has knowledge of the Scripture.”"
        }
    ],
    "chapterNumber": 13,
    "nameInEnglish": "Thunder",
    "nameInTransliteration": "Ar Rad",
    "nameInArabic": "الرعد",
    "numberOfVerses": 43
}