{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Blessed is He who journeyed His servant by night from the Sacred Mosque to the Farthest Mosque, the precincts We’ve blessed, to show him some of Our wonders. He is the All-Hearing, the All-Seeing."
        },
        {
            "verseNumber": 2,
            "verseString": "We gave Moses the Scripture and made it a guide for the Children of Israel: “Take no protector other than Me.”"
        },
        {
            "verseNumber": 3,
            "verseString": "The descendants of those We carried with Noah; a thankful servant he was."
        },
        {
            "verseNumber": 4,
            "verseString": "We forewarned the Children of Israel in the Scripture: “Twice you will spread corruption on earth, and you will ascend to a great height.”"
        },
        {
            "verseNumber": 5,
            "verseString": "When the first of these prophecies came to pass, We sent against you Our servants of formidable might, they ravaged through the homes, and it was a fulfilled warning."
        },
        {
            "verseNumber": 6,
            "verseString": "Then, We gave you victory over them, reinforced you with wealth and children, and made you more numerous in human resources."
        },
        {
            "verseNumber": 7,
            "verseString": "If you do good, it’s for yourself. If you do evil, it’s against yourselves. Then, when the second warning was fulfilled, they disfigured your faces, entered the temple as they had entered it the first time, and utterly ravaged all that they overran."
        },
        {
            "verseNumber": 8,
            "verseString": "Perhaps your Lord will have mercy on you. If you revert, We will revert. We made Hell a prison for the disbelievers."
        },
        {
            "verseNumber": 9,
            "verseString": "This Quran guides to what’s most upright and gives good news to the believers who do good deeds, that they’ll have a great reward."
        },
        {
            "verseNumber": 10,
            "verseString": "For those who don’t believe in the Hereafter, We prepared a painful punishment."
        },
        {
            "verseNumber": 11,
            "verseString": "Man prays for harm as he prays for good; man has always been hasty."
        },
        {
            "verseNumber": 12,
            "verseString": "We made the night and the day two marvels. We erased the marvel of the night, and made the marvel of the day illuminating, so that you may seek bounty from your Lord, and may know the number of years and calculations. We explained everything in detail."
        },
        {
            "verseNumber": 13,
            "verseString": "We’ve tied every person’s fate to his neck, and on the Day of Resurrection, We will bring out for him a record, which he will find spread open."
        },
        {
            "verseNumber": 14,
            "verseString": "“Read your record! Today, your soul is enough to account against yourself.”"
        },
        {
            "verseNumber": 15,
            "verseString": "Whoever is guided, is guided for his benefit, and whoever strays, does so to his detriment. No bearer of burdens can bear the burdens of another, and We never punish until We have sent a messenger."
        },
        {
            "verseNumber": 16,
            "verseString": "When We decide to destroy a town, We command its affluent ones, who then commit transgressions therein, thus justifying the sentence against it, and We destroy it completely."
        },
        {
            "verseNumber": 17,
            "verseString": "How many generations did We annihilate after Noah? Your Lord is sufficient as an observer and knower of His beings’ sins."
        },
        {
            "verseNumber": 18,
            "verseString": "Whoever desires the fleeting life, We readily grant whatever We will to whomever We choose. We then designate him for Hell, where he will burn, condemned and forsaken."
        },
        {
            "verseNumber": 19,
            "verseString": "But whoever desires the Hereafter, and strives for it with due effort, while being a believer—it is those whose striving is appreciated."
        },
        {
            "verseNumber": 20,
            "verseString": "To all—these and those—We extend from the bounty of your Lord. Your Lord’s giving is not restricted."
        },
        {
            "verseNumber": 21,
            "verseString": "Consider how We’ve preferred some over others, yet the Hereafter offers greater ranks and greater in preference."
        },
        {
            "verseNumber": 22,
            "verseString": "Don’t set up with God any other god, lest you find yourself despised and forsaken.",
            "verseStringReplacedWithAllah": "Don’t set up with Allah any other god, lest you find yourself despised and forsaken."
        },
        {
            "verseNumber": 23,
            "verseString": "Your Lord has decreed that you worship none but Him, and that you extend kindness to your parents. If one or both of them attain old age in your presence, don’t say ‘uff’ to them, nor scold them, but address them with respectful words."
        },
        {
            "verseNumber": 24,
            "verseString": "Lower the wing of humility out of compassion for them, and pray, “My Lord, have mercy on them, as they have brought me up when I was small.”"
        },
        {
            "verseNumber": 25,
            "verseString": "Your Lord is well aware of what’s within yourselves. If you maintain righteousness, then He is Ever Forgiving to those who are repentant."
        },
        {
            "verseNumber": 26,
            "verseString": "Give due to your relatives, the needy, and the traveler. And don’t squander your wealth."
        },
        {
            "verseNumber": 27,
            "verseString": "The extravagant are brethren of the devils, and Satan has always been ungrateful to his Lord."
        },
        {
            "verseNumber": 28,
            "verseString": "But if you turn away from them, seeking mercy from your Lord for which you hope, then speak to them a gentle word."
        },
        {
            "verseNumber": 29,
            "verseString": "Don’t keep your hand tied to your neck, nor extend it fully, lest you end up blamed and regretful."
        },
        {
            "verseNumber": 30,
            "verseString": "Your Lord dispenses abundantly to whom He wills, and He measures out. He is always All-Knowing, All-Seeing of His beings."
        },
        {
            "verseNumber": 31,
            "verseString": "Don’t kill your children for fear of poverty; We provide for them and for you. Killing them is a grave sin."
        },
        {
            "verseNumber": 32,
            "verseString": "And don’t approach adultery, for it’s an immoral act and an evil way."
        },
        {
            "verseNumber": 33,
            "verseString": "Don’t take a life that God deemed sacred, except in the course of justice. If someone is killed unjustly, We’ve given his heir authority, but he must not take life excessively; he will be assisted.",
            "verseStringReplacedWithAllah": "Don’t take a life that Allah deemed sacred, except in the course of justice. If someone is killed unjustly, We’ve given his heir authority, but he must not take life excessively; he will be assisted."
        },
        {
            "verseNumber": 34,
            "verseString": "Don’t approach the orphan’s property, except in the best way, until he reaches maturity. Fulfill your commitments; the commitment is going to be questioned."
        },
        {
            "verseNumber": 35,
            "verseString": "Give full measure when you measure, and weigh with an even balance. That is better and best in interpretation."
        },
        {
            "verseNumber": 36,
            "verseString": "Don’t follow what you have no knowledge of. Hearing, sight, and reasoning—all of those will be questioned."
        },
        {
            "verseNumber": 37,
            "verseString": "Don’t walk arrogantly on earth, for you can’t pierce the ground, nor can you reach the mountains in height."
        },
        {
            "verseNumber": 38,
            "verseString": "All of this—the evil of it—is hated by your Lord."
        },
        {
            "verseNumber": 39,
            "verseString": "This is some of the wisdom your Lord revealed to you. Don’t set up another deity with God, lest you be thrown into Hell, blamed and banished.",
            "verseStringReplacedWithAllah": "This is some of the wisdom your Lord revealed to you. Don’t set up another deity with Allah, lest you be thrown into Hell, blamed and banished."
        },
        {
            "verseNumber": 40,
            "verseString": "Did your Lord favor you with sons while taking for Himself daughters from among the angels? Indeed, you’ve made a grave statement."
        },
        {
            "verseNumber": 41,
            "verseString": "We’ve explained variously in this Quran so that they may remember, but it only increases their rebellion."
        },
        {
            "verseNumber": 42,
            "verseString": "Say, “If there were other gods along with Him, as they claim, they would’ve sought a way to the Lord of the Throne.”"
        },
        {
            "verseNumber": 43,
            "verseString": "Far exalted is He above what they say, in His grandeur and supremacy."
        },
        {
            "verseNumber": 44,
            "verseString": "The seven heavens, the earth, and everything within them praise His glory. There is not a thing that does not glorify Him with praise, but you do not understand their glorification. He is Ever-Forbearing, Most Forgiving."
        },
        {
            "verseNumber": 45,
            "verseString": "When you read the Quran, We place an invisible barrier between you and those who don’t believe in the Hereafter."
        },
        {
            "verseNumber": 46,
            "verseString": "We placed covers on their hearts, preventing them from understanding it, and deafness in their ears. When you mention your Lord’s singularity in the Quran, they recoil in repulsion."
        },
        {
            "verseNumber": 47,
            "verseString": "We know what they listen to, when they listen to you, when they conspire, when the wrongdoers say, “You are merely following a man under a spell.”"
        },
        {
            "verseNumber": 48,
            "verseString": "Look at the comparisons they make for you; they are astray and can’t find a way."
        },
        {
            "verseNumber": 49,
            "verseString": "And they say, “When we are bones and crumbled particles, will we truly be resurrected in a new creation?”"
        },
        {
            "verseNumber": 50,
            "verseString": "Respond, “Be you stones or iron."
        },
        {
            "verseNumber": 51,
            "verseString": "Or any creation you deem more even formidable.” Then they will question, “Who will restore us?” Respond, “The One who created you in the first place.” Then they’ll shake their heads at you and ask, “When will this happen?” Say, “It could be quite soon.”"
        },
        {
            "verseNumber": 52,
            "verseString": "On the Day He calls you, you will respond praising Him, realizing that you lingered only briefly."
        },
        {
            "verseNumber": 53,
            "verseString": "Tell My servants to speak in a most kindly manner, for Satan sows discord among them. Satan is a clear enemy of man."
        },
        {
            "verseNumber": 54,
            "verseString": "Your Lord knows you best. If He wills, He will have mercy on you. And if He wills, He will punish you. We didn’t send you as their overseer."
        },
        {
            "verseNumber": 55,
            "verseString": "Your Lord knows everyone in the heavens and on earth. We’ve favored some prophets over others. To David, We gave the Psalms."
        },
        {
            "verseNumber": 56,
            "verseString": "Say, “Invoke those you presume besides Him; they lack the power to alleviate your suffering or change your condition.”"
        },
        {
            "verseNumber": 57,
            "verseString": "Those whom they call upon are themselves seeking a way to their Lord, vying for His proximity, hoping for His mercy, and dreading His punishment. Your Lord’s punishment is to be avoided."
        },
        {
            "verseNumber": 58,
            "verseString": "There is no community that We won’t obliterate or severely chastise before Resurrection Day. This is inscribed in the Book."
        },
        {
            "verseNumber": 59,
            "verseString": "Nothing prevents Us from sending miracles, except that the previous generations rejected them. We gave Thamud the she-camel as a clear sign, but they maltreated her. We send signs only to instill fear."
        },
        {
            "verseNumber": 60,
            "verseString": "We’ve informed you that your Lord encompasses all people. The vision We showed you and the cursed tree mentioned in the Quran are trials for people. We frighten them, but it only increases their defiance."
        },
        {
            "verseNumber": 61,
            "verseString": "We commanded the angels, “Prostrate before Adam.” They all did, except for Iblis. He said, “Should I prostrate to one You created from mud?”"
        },
        {
            "verseNumber": 62,
            "verseString": "He added, “Do you see this one whom You honored over me? If You defer me until Resurrection Day, I will dominate his descendants, except for a few.”"
        },
        {
            "verseNumber": 63,
            "verseString": "He replied, “Go away! Whoever among them follows you, then Hell is your recompensation, an ample recompensation.”"
        },
        {
            "verseNumber": 64,
            "verseString": "“And entice whomever you can from among them with your voice. Muster against them your cavalry and your infantry, share the promises of wealth and children, and make promises to them.” However, Satan promises them nothing except deceit."
        },
        {
            "verseNumber": 65,
            "verseString": "“As for My devotees, you have no power over them. Your Lord is sufficient as a Protector.”"
        },
        {
            "verseNumber": 66,
            "verseString": "It is your Lord who causes the ship to move for you through the sea, so you may seek His bounty. Indeed, He is Most Merciful to you."
        },
        {
            "verseNumber": 67,
            "verseString": "When danger befalls you at sea, all those you call upon vanish, except for Him. Yet, when He brings you safely to land, you turn away. Man is ever ungrateful."
        },
        {
            "verseNumber": 68,
            "verseString": "Are you confident that He won’t collapse a tract of land beneath you, or unleash a hailstorm upon you? Then, you would find no protector."
        },
        {
            "verseNumber": 69,
            "verseString": "Or are you confident that He won’t return you to it again, unleash a hurricane against you, and drown you due to your ingratitude? Then, you would find no avenger against Us."
        },
        {
            "verseNumber": 70,
            "verseString": "We honored the Children of Adam, transported them on land and sea, provided them with good things, and gave them preference over many of those We created."
        },
        {
            "verseNumber": 71,
            "verseString": "On the Day when We summon every people with their leader, whoever is given his record in his right hand will read his record, and not a thread will be wronged."
        },
        {
            "verseNumber": 72,
            "verseString": "But whoever is blind in this life, will be blind in the Hereafter, and further astray from the path."
        },
        {
            "verseNumber": 73,
            "verseString": "They were about to entice you away from what We have revealed to you, in the hope that you would invent something else about Us; and then they would’ve taken you as a friend."
        },
        {
            "verseNumber": 74,
            "verseString": "Had We not fortified you, you might have leaned towards them a little."
        },
        {
            "verseNumber": 75,
            "verseString": "In that case, We would’ve made you taste double in life, and double at death, and then you would’ve found no helper with respect to Us."
        },
        {
            "verseNumber": 76,
            "verseString": "They almost provoked you, to expel you from the land. But then they wouldn’t have remained after you, except for a short while."
        },
        {
            "verseNumber": 77,
            "verseString": "That is the established way with the messengers We sent before you, and you won’t find any change in Our ways."
        },
        {
            "verseNumber": 78,
            "verseString": "Perform the prayer at the sun’s decline until the darkness of the night, and the Quran at daybreak. The recitation at daybreak is witnessed."
        },
        {
            "verseNumber": 79,
            "verseString": "Spend part of the night in vigil, as a supplementary prayer, so that your Lord may elevate you to a commendable station."
        },
        {
            "verseNumber": 80,
            "verseString": "And pray, “My Lord, let my entry be truthful, and my exit be truthful; and grant me, from You, a supporting authority.”"
        },
        {
            "verseNumber": 81,
            "verseString": "And say, “The truth has come, and falsehood has dissipated. Falsehood is bound to dissipate.”"
        },
        {
            "verseNumber": 82,
            "verseString": "We reveal in the Quran healing and mercy for believers, but it increases the wrongdoers in nothing but loss."
        },
        {
            "verseNumber": 83,
            "verseString": "When We bestow favor upon a person, he withdraws and turns aside; but when adversity touches him, he is in despair."
        },
        {
            "verseNumber": 84,
            "verseString": "Say, “Each person acts according to his character, and your Lord knows best who is rightly guided.”"
        },
        {
            "verseNumber": 85,
            "verseString": "They ask you about the spirit. Respond, “The spirit is by the command of my Lord, and you’ve been given only a little knowledge.”"
        },
        {
            "verseNumber": 86,
            "verseString": "If We willed, We could take away what We revealed to you. Then, you would find no one to defend you against Us."
        },
        {
            "verseNumber": 87,
            "verseString": "This is only by the mercy of your Lord. His grace unto you is immense."
        },
        {
            "verseNumber": 88,
            "verseString": "Say, “Even if all humans and jinn were to collaborate to produce something akin to this Quran, they would not succeed, despite their collective efforts.”"
        },
        {
            "verseNumber": 89,
            "verseString": "In this Quran, We provide diverse parables for people, yet the majority persist in disbelief."
        },
        {
            "verseNumber": 90,
            "verseString": "They say, “We won’t believe in you unless you make a spring gush out from the ground for us."
        },
        {
            "verseNumber": 91,
            "verseString": "Or unless you own a garden of date palms and grapevines and you make rivers burst forth within it."
        },
        {
            "verseNumber": 92,
            "verseString": "Or unless you cause the sky to fall upon us in pieces, as you claim, or bring God and the angels before us.",
            "verseStringReplacedWithAllah": "Or unless you cause the sky to fall upon us in pieces, as you claim, or bring Allah and the angels before us."
        },
        {
            "verseNumber": 93,
            "verseString": "Or unless you have a house of gold. Or unless you ascend into the sky. Even then, we won’t believe in your ascension, until you bring down a book for us to read.” Say, “Glory be to my Lord! Am I anything more than a human messenger?”"
        },
        {
            "verseNumber": 94,
            "verseString": "What prevents people from believing when guidance has come to them, is their saying, “God sent a human as a messenger?”",
            "verseStringReplacedWithAllah": "What prevents people from believing when guidance has come to them, is their saying, “Allah sent a human as a messenger?”"
        },
        {
            "verseNumber": 95,
            "verseString": "Say, “If there were angels on earth walking peacefully, We’d certainly send an angel from heaven as a messenger to them.”"
        },
        {
            "verseNumber": 96,
            "verseString": "Say, “God is sufficient as a witness between you and me. He is fully aware and observant of His beings.”",
            "verseStringReplacedWithAllah": "Say, “Allah is sufficient as a witness between you and me. He is fully aware and observant of His beings.”"
        },
        {
            "verseNumber": 97,
            "verseString": "Whomever God guides is guided, and whomever He misguides, you will find no helpers for him other than Him. We will gather them on the Day of Resurrection, on their faces—blind, dumb and deaf. Their destination is Hell; whenever it subsides, We will intensify the flames for them.",
            "verseStringReplacedWithAllah": "Whomever Allah guides is guided, and whomever He misguides, you will find no helpers for him other than Him. We will gather them on the Day of Resurrection, on their faces—blind, dumb and deaf. Their destination is Hell; whenever it subsides, We will intensify the flames for them."
        },
        {
            "verseNumber": 98,
            "verseString": "That is their retribution for rejecting Our revelations and questioning, “When we are reduced to bones and fragments, will we truly be resurrected as a new creation?”"
        },
        {
            "verseNumber": 99,
            "verseString": "Don’t they realize that God, who created the heavens and the earth, is able to create their likes? He appointed for them a term, of which there is no doubt. But the wrongdoers refuse anything except disbelief.",
            "verseStringReplacedWithAllah": "Don’t they realize that Allah, who created the heavens and the earth, is able to create their likes? He appointed for them a term, of which there is no doubt. But the wrongdoers refuse anything except disbelief."
        },
        {
            "verseNumber": 100,
            "verseString": "Say, “If you possessed the treasures of the mercy of my Lord, then you would withhold out of fear of spending.” Man is ever reluctant to give."
        },
        {
            "verseNumber": 101,
            "verseString": "We gave Moses nine clear signs. Ask the Children of Israel, when he came to them, Pharaoh said to him, “O Moses, I suspect you are under a spell.”"
        },
        {
            "verseNumber": 102,
            "verseString": "He replied, “You’ve certainly known that none sent these down except the Lord of the heavens and the earth, as eye-openers. It seems to me, O Pharaoh, that you are perishing.”"
        },
        {
            "verseNumber": 103,
            "verseString": "So he intended to drive them out from the land, but We drowned him and those with him all together."
        },
        {
            "verseNumber": 104,
            "verseString": "Subsequently, We told the Children of Israel, “Settle in the land, and when the promise of the final time comes to pass, We will gather you all together.”"
        },
        {
            "verseNumber": 105,
            "verseString": "We revealed it with the truth, and in truth, it descended. We sent you only to give good news and to issue warnings."
        },
        {
            "verseNumber": 106,
            "verseString": "A Quran that We unfolded gradually, for you to read to people over time. We revealed it in stages."
        },
        {
            "verseNumber": 107,
            "verseString": "Say, “Believe in it, or don’t believe. Those who were given knowledge before it, when it is recited to them, fall down on their faces, in humility."
        },
        {
            "verseNumber": 108,
            "verseString": "And they exclaim, “Praise be to our Lord! The promise of our Lord has been fulfilled.”"
        },
        {
            "verseNumber": 109,
            "verseString": "And they will fall down, crying, and it would increase them in humility."
        },
        {
            "verseNumber": 110,
            "verseString": "Say, “Call upon God, or call upon the Most Merciful. Whichever you call upon Him with, for Him are the most beautiful names.” And don’t be loud in your prayer nor quiet in it, but seek a way in between.",
            "verseStringReplacedWithAllah": "Say, “Call upon Allah, or call upon the Most Merciful. Whichever you call upon Him with, for Him are the most beautiful names.” And don’t be loud in your prayer nor quiet in it, but seek a way in between."
        },
        {
            "verseNumber": 111,
            "verseString": "And say, “Praise be to God, who has not begotten a child, who has no partner in sovereignty, who has no ally out of weakness, and magnify Him with all the magnificence.”",
            "verseStringReplacedWithAllah": "And say, “Praise be to Allah, who has not begotten a child, who has no partner in sovereignty, who has no ally out of weakness, and magnify Him with all the magnificence.”"
        }
    ],
    "chapterNumber": 17,
    "nameInEnglish": "Night Journey",
    "nameInTransliteration": "Al Isra",
    "nameInArabic": "الإسراء",
    "numberOfVerses": 111
}