{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Ta. Seen. These are the verses of the Quran—a clear and enlightening Scripture."
        },
        {
            "verseNumber": 2,
            "verseString": "A guide and good news to the believers."
        },
        {
            "verseNumber": 3,
            "verseString": "Those who establish prayer, give the purifying charity, and have firm belief in the Hereafter."
        },
        {
            "verseNumber": 4,
            "verseString": "For those who don’t believe in the Hereafter, We make their deeds appear attractive to them, so they wander aimlessly."
        },
        {
            "verseNumber": 5,
            "verseString": "These will suffer the worst punishment, and in the Hereafter, they will be the most significant losers."
        },
        {
            "verseNumber": 6,
            "verseString": "You are receiving the Quran from the One who is All-Wise, All-Knowing."
        },
        {
            "verseNumber": 7,
            "verseString": "When Moses said to his family, “I noticed a fire. I will bring you news from it, or a burning torch to warm yourselves.”"
        },
        {
            "verseNumber": 8,
            "verseString": "As he approached it, he was called, “Blessed is whoever is at the fire and whoever is around it, and glory be to God, the Lord of the worlds.",
            "verseStringReplacedWithAllah": "As he approached it, he was called, “Blessed is whoever is at the fire and whoever is around it, and glory be to Allah, the Lord of the worlds."
        },
        {
            "verseNumber": 9,
            "verseString": "O Moses, it is I, God, the Almighty, the All-Wise.",
            "verseStringReplacedWithAllah": "O Moses, it is I, Allah, the Almighty, the All-Wise."
        },
        {
            "verseNumber": 10,
            "verseString": "Lay down your staff.” As he saw it moving like a serpent, he turned to flee. “O Moses, fear not; the messengers don’t fear in My presence."
        },
        {
            "verseNumber": 11,
            "verseString": "However, anyone who does wrong and then replaces it with good—I am Oft-Forgiving, Most Merciful."
        },
        {
            "verseNumber": 12,
            "verseString": "Now, insert your hand into your cloak; it will come out white and flawless. These are among nine signs for Pharaoh and his people. They are sinful people.”"
        },
        {
            "verseNumber": 13,
            "verseString": "When Our signs were presented to them, they said, “This is nothing but obvious magic.”"
        },
        {
            "verseNumber": 14,
            "verseString": "They denied them unjustly and arrogantly, despite their inner selves being convinced of them. Observe, then, the end of the corruptors."
        },
        {
            "verseNumber": 15,
            "verseString": "We granted knowledge to David and Solomon. They said, “Praise be to God, who has favored us over many of His believing servants.”",
            "verseStringReplacedWithAllah": "We granted knowledge to David and Solomon. They said, “Praise be to Allah, who has favored us over many of His believing servants.”"
        },
        {
            "verseNumber": 16,
            "verseString": "Solomon succeeded David. He said, “O people, we were taught the language of birds, and we were given a share of everything. Indeed, these are the evident blessings.”"
        },
        {
            "verseNumber": 17,
            "verseString": "And gathered for Solomon were his troops of jinn, men, and birds—all held in strict order."
        },
        {
            "verseNumber": 18,
            "verseString": "Upon reaching the Valley of the Ants, an ant warned, “O ants, retreat to your dwellings, lest Solomon and his troops inadvertently crush you.”"
        },
        {
            "verseNumber": 19,
            "verseString": "Amused by her words, he laughed and prayed, “My Lord, enable me to be thankful for the blessings You’ve bestowed upon me and my parents, and to perform righteous deeds that please You. And by Your mercy, include me among Your righteous servants.”"
        },
        {
            "verseNumber": 20,
            "verseString": "He surveyed the birds and said, “What’s amiss that I don’t see the hoopoe? Could he be among the absentees?"
        },
        {
            "verseNumber": 21,
            "verseString": "I will punish him severely or even slay him, unless he brings me a valid explanation.”"
        },
        {
            "verseNumber": 22,
            "verseString": "But he didn’t take long to return and said, “I have discovered what you didn’t know. I’ve come to you from Sheba with certain news."
        },
        {
            "verseNumber": 23,
            "verseString": "I found a woman ruling over them, endowed with every requisite, and she possesses a magnificent throne."
        },
        {
            "verseNumber": 24,
            "verseString": "I found her and her people prostrating to the sun instead of God. Satan made their deeds appear pleasing to them, thus diverting them from the path, so they are not guided.",
            "verseStringReplacedWithAllah": "I found her and her people prostrating to the sun instead of Allah. Satan made their deeds appear pleasing to them, thus diverting them from the path, so they are not guided."
        },
        {
            "verseNumber": 25,
            "verseString": "Shouldn’t they prostrate to God, who brings out the hidden in the heavens and the earth, and knows what you conceal and what you disclose?",
            "verseStringReplacedWithAllah": "Shouldn’t they prostrate to Allah, who brings out the hidden in the heavens and the earth, and knows what you conceal and what you disclose?"
        },
        {
            "verseNumber": 26,
            "verseString": "God—there is no deity except He, the Lord of the Majestic Throne.”",
            "verseStringReplacedWithAllah": "Allah—there is no deity except He, the Lord of the Majestic Throne.”"
        },
        {
            "verseNumber": 27,
            "verseString": "He responded, “We will see whether you told the truth or were lying."
        },
        {
            "verseNumber": 28,
            "verseString": "Take this letter of mine, deliver it to them, then withdraw from them and see what their response will be.”"
        },
        {
            "verseNumber": 29,
            "verseString": "She said, “O council, I have been delivered a noble letter."
        },
        {
            "verseNumber": 30,
            "verseString": "It is from Solomon, and it is ‘In the Name of God, the Most Gracious, the Most Merciful.’",
            "verseStringReplacedWithAllah": "It is from Solomon, and it is ‘In the Name of Allah, the Most Gracious, the Most Merciful.’"
        },
        {
            "verseNumber": 31,
            "verseString": "‘Don’t exalt yourselves above me, but come to me in submission.’”"
        },
        {
            "verseNumber": 32,
            "verseString": "She continued, “O my counselors, advise me in this matter. I don’t make a decision without your counsel.”"
        },
        {
            "verseNumber": 33,
            "verseString": "They responded, “We possess power and great military might, but the command is yours to decide. Consider what you will command.”"
        },
        {
            "verseNumber": 34,
            "verseString": "She said, “When kings enter a city, they ruin it and humiliate its noble citizens. Such is their way."
        },
        {
            "verseNumber": 35,
            "verseString": "I will send them a gift and await what the messengers will return.”"
        },
        {
            "verseNumber": 36,
            "verseString": "Upon receiving it, Solomon said, “Are you offering me money? What God gave me is far better than what He gave you. It is you who rejoice in your gift.",
            "verseStringReplacedWithAllah": "Upon receiving it, Solomon said, “Are you offering me money? What Allah gave me is far better than what He gave you. It is you who rejoice in your gift."
        },
        {
            "verseNumber": 37,
            "verseString": "Return to them; we will come at them with forces they can’t resist, and we will expel them from there, humiliated and belittled.”"
        },
        {
            "verseNumber": 38,
            "verseString": "He asked, “O nobles, who among you can bring me her throne before they come to me in submission?”"
        },
        {
            "verseNumber": 39,
            "verseString": "A powerful jinn responded, “I can bring it to you before you rise from your place. I am strong and trustworthy enough to do it.”"
        },
        {
            "verseNumber": 40,
            "verseString": "The one who had knowledge of the Scripture suggested, “I can bring it to you before you can blink.” When Solomon saw it placed before him, he exclaimed, “This is by the grace of my Lord, to test whether I am grateful or ungrateful. Whoever gives thanks, he gives thanks for his own good. And whoever is ungrateful—my Lord is Free of need and Generous.”"
        },
        {
            "verseNumber": 41,
            "verseString": "He said, “Alter her throne for her; we shall see whether she will be guided or she will be one of those not guided.”"
        },
        {
            "verseNumber": 42,
            "verseString": "Upon her arrival, she was asked, “Does your throne resemble this one?” She replied, “As if it were the same.” “We were given knowledge beforehand, and we have already submitted.”"
        },
        {
            "verseNumber": 43,
            "verseString": "What she was worshiping besides God had prevented her. She was from a disbelieving people.",
            "verseStringReplacedWithAllah": "What she was worshiping besides Allah had prevented her. She was from a disbelieving people."
        },
        {
            "verseNumber": 44,
            "verseString": "She was directed to enter the palace. Upon seeing it, she mistook it for a pool and bared her legs. He said, “It is a courtyard paved with glass.” She said, “My Lord, I have wronged myself, and I submit with Solomon, to God—Lord of the worlds.”",
            "verseStringReplacedWithAllah": "She was directed to enter the palace. Upon seeing it, she mistook it for a pool and bared her legs. He said, “It is a courtyard paved with glass.” She said, “My Lord, I have wronged myself, and I submit with Solomon, to Allah—Lord of the worlds.”"
        },
        {
            "verseNumber": 45,
            "verseString": "To Thamud, We sent their brother Saleh: “Worship God.” Yet, they became two quarreling factions.",
            "verseStringReplacedWithAllah": "To Thamud, We sent their brother Saleh: “Worship Allah.” Yet, they became two quarreling factions."
        },
        {
            "verseNumber": 46,
            "verseString": "He pleaded, “O my people, why do you hasten towards evil rather than good? Why not ask for God’s forgiveness, so you may receive mercy.”",
            "verseStringReplacedWithAllah": "He pleaded, “O my people, why do you hasten towards evil rather than good? Why not ask for Allah’s forgiveness, so you may receive mercy.”"
        },
        {
            "verseNumber": 47,
            "verseString": "They responded, “We see ill omens in you and those with you.” He replied, “Your omens are determined by God; you are a people being tested.”",
            "verseStringReplacedWithAllah": "They responded, “We see ill omens in you and those with you.” He replied, “Your omens are determined by Allah; you are a people being tested.”"
        },
        {
            "verseNumber": 48,
            "verseString": "In the city were nine individuals who made mischief in the land and didn’t reform."
        },
        {
            "verseNumber": 49,
            "verseString": "They conspired, “Let us swear by God to attack him and his family under the cover of night. Then, we will tell his guardian that we didn’t know of his family’s demise; we are telling the truth.”",
            "verseStringReplacedWithAllah": "They conspired, “Let us swear by Allah to attack him and his family under the cover of night. Then, we will tell his guardian that we didn’t know of his family’s demise; we are telling the truth.”"
        },
        {
            "verseNumber": 50,
            "verseString": "And they plotted a conspiracy, and We plotted a conspiracy, while they were unaware."
        },
        {
            "verseNumber": 51,
            "verseString": "Consider the outcome of their scheming: We obliterated them and their entire community."
        },
        {
            "verseNumber": 52,
            "verseString": "Their homes now lie deserted due to their wrongdoings, a clear sign for those who understand."
        },
        {
            "verseNumber": 53,
            "verseString": "And We saved those who believed and led righteous lives."
        },
        {
            "verseNumber": 54,
            "verseString": "Lot admonished his people, “Do you openly commit such indecencies?"
        },
        {
            "verseNumber": 55,
            "verseString": "Do you approach men with lust instead of women? You are a people acting ignorantly.”"
        },
        {
            "verseNumber": 56,
            "verseString": "But the answer of his people was nothing more than, “Drive Lot’s family out of your town. They are people who want to stay pure!”"
        },
        {
            "verseNumber": 57,
            "verseString": "So, We rescued him and his family, except for his wife, whom We destined to be among those left behind."
        },
        {
            "verseNumber": 58,
            "verseString": "Then We rained down on them a torrent. How terrible was the rain for the forewarned!"
        },
        {
            "verseNumber": 59,
            "verseString": "Say, “Praise be to God, and peace be upon His chosen servants. Is God better, or what they associate with Him?”",
            "verseStringReplacedWithAllah": "Say, “Praise be to Allah, and peace be upon His chosen servants. Is Allah better, or what they associate with Him?”"
        },
        {
            "verseNumber": 60,
            "verseString": "Who created the heavens and the earth, and sent down water from the sky for you, with which We cultivate delightful gardens, the likes of which you couldn’t have grown? Is there a god along with God? They are people who equate.",
            "verseStringReplacedWithAllah": "Who created the heavens and the earth, and sent down water from the sky for you, with which We cultivate delightful gardens, the likes of which you couldn’t have grown? Is there a god along with Allah? They are people who equate."
        },
        {
            "verseNumber": 61,
            "verseString": "Who made the earth a stable home, set rivers through it, placed firm mountains, and created a barrier between the two seas? Is there a god along with God? Yet, most of them don’t know.",
            "verseStringReplacedWithAllah": "Who made the earth a stable home, set rivers through it, placed firm mountains, and created a barrier between the two seas? Is there a god along with Allah? Yet, most of them don’t know."
        },
        {
            "verseNumber": 62,
            "verseString": "Who responds to the distressed when he calls upon Him, alleviates affliction, and makes you inheritors of the earth? Is there a god along with God? Yet, you reflect little.",
            "verseStringReplacedWithAllah": "Who responds to the distressed when he calls upon Him, alleviates affliction, and makes you inheritors of the earth? Is there a god along with Allah? Yet, you reflect little."
        },
        {
            "verseNumber": 63,
            "verseString": "Who guides you through the darkness on land and sea, and sends winds heralding His mercy? Is there a god along with God? God is far beyond what they associate.",
            "verseStringReplacedWithAllah": "Who guides you through the darkness on land and sea, and sends winds heralding His mercy? Is there a god along with Allah? Allah is far beyond what they associate."
        },
        {
            "verseNumber": 64,
            "verseString": "Who initiates the creation, repeats it, and provides for you from the sky and the earth? Is there a god along with God? Say, “Present your evidence, if you are truthful.”",
            "verseStringReplacedWithAllah": "Who initiates the creation, repeats it, and provides for you from the sky and the earth? Is there a god along with Allah? Say, “Present your evidence, if you are truthful.”"
        },
        {
            "verseNumber": 65,
            "verseString": "Say, “None in the heavens and the earth knows the unseen, except for God, and they don’t perceive when they will be resurrected.”",
            "verseStringReplacedWithAllah": "Say, “None in the heavens and the earth knows the unseen, except for Allah, and they don’t perceive when they will be resurrected.”"
        },
        {
            "verseNumber": 66,
            "verseString": "Their understanding of the Hereafter is obscure; they are skeptical about it, and they are blind to it."
        },
        {
            "verseNumber": 67,
            "verseString": "Those who disbelieve say, “When we and our ancestors become dust, will we be resurrected?"
        },
        {
            "verseNumber": 68,
            "verseString": "We and our ancestors were promised this before; these are nothing but legends of the ancients.”"
        },
        {
            "verseNumber": 69,
            "verseString": "Say, “Roam the earth and see the fate that befell the wrongdoers.”"
        },
        {
            "verseNumber": 70,
            "verseString": "Don’t grieve for them, nor be distressed by their schemes."
        },
        {
            "verseNumber": 71,
            "verseString": "They ask, “When will this promise come to pass, if you are truthful?”"
        },
        {
            "verseNumber": 72,
            "verseString": "Reply, “It may be that what you wish to hasten is already near you.”"
        },
        {
            "verseNumber": 73,
            "verseString": "Your Lord is generous towards people, yet most of them don’t express gratitude."
        },
        {
            "verseNumber": 74,
            "verseString": "Surely your Lord knows what their hearts hide and what they reveal."
        },
        {
            "verseNumber": 75,
            "verseString": "There is nothing concealed in the heavens or on the earth that is not in a clear record."
        },
        {
            "verseNumber": 76,
            "verseString": "This Quran clarifies many of the disagreements amongst the Children of Israel."
        },
        {
            "verseNumber": 77,
            "verseString": "Furthermore, it is a guide and a mercy to the believers."
        },
        {
            "verseNumber": 78,
            "verseString": "Your Lord will judge among them by His wisdom. He is the Mighty, the All-Knowing."
        },
        {
            "verseNumber": 79,
            "verseString": "Therefore, put your trust in God. You are on the path of apparent truth.",
            "verseStringReplacedWithAllah": "Therefore, put your trust in Allah. You are on the path of apparent truth."
        },
        {
            "verseNumber": 80,
            "verseString": "You can’t make the dead hear, nor can you make the deaf hear the call when they retreat."
        },
        {
            "verseNumber": 81,
            "verseString": "You can’t guide the blind out of their errancy. You can make none hear except those who believe in Our revelations; they are in submission."
        },
        {
            "verseNumber": 82,
            "verseString": "When the Decree is issued against them, We will produce for them a creature from the earth that will speak to them because people had no faith in Our signs."
        },
        {
            "verseNumber": 83,
            "verseString": "On the Day we will gather from every community a group of those who denied Our revelations, they will be marshaled."
        },
        {
            "verseNumber": 84,
            "verseString": "When they arrive, He will say, “Did you reject My verses without understanding them, or what exactly were you doing?”"
        },
        {
            "verseNumber": 85,
            "verseString": "The Decree will befall them due to their wrongdoings, rendering them speechless."
        },
        {
            "verseNumber": 86,
            "verseString": "Don’t they contemplate how We created the night so they can rest and the day for visibility? In this are signs for those who believe."
        },
        {
            "verseNumber": 87,
            "verseString": "On the Day when the Trumpet will be blown, and everyone in the heavens and everyone on earth will be terrified, except those whom God wills. Everyone will come humbly submissive before Him.",
            "verseStringReplacedWithAllah": "On the Day when the Trumpet will be blown, and everyone in the heavens and everyone on earth will be terrified, except those whom Allah wills. Everyone will come humbly submissive before Him."
        },
        {
            "verseNumber": 88,
            "verseString": "You see the mountains, and you think they are fixed, but they pass, as the passing of the clouds. The making of God, who perfected everything; He is fully aware of everything you do.",
            "verseStringReplacedWithAllah": "You see the mountains, and you think they are fixed, but they pass, as the passing of the clouds. The making of Allah, who perfected everything; He is fully aware of everything you do."
        },
        {
            "verseNumber": 89,
            "verseString": "Whoever brings a good deed, he will have better than it, and they will be secure from terror on that day."
        },
        {
            "verseNumber": 90,
            "verseString": "But those who commit evil deeds, their faces will be thrown into the Fire. Are you recompensed except for what you used to do?"
        },
        {
            "verseNumber": 91,
            "verseString": "“I have been commanded only to worship the Lord of this town, Who has declared it sacred, and to Whom all things belong. And I am commanded to be of those who submit."
        },
        {
            "verseNumber": 92,
            "verseString": "And to convey the Quran.” Whoever is guided, is only guided for his soul. As for those who go astray, then say, “I am only a warner.”"
        },
        {
            "verseNumber": 93,
            "verseString": "And say, “Praise be to God, He will show you His signs, and you will recognize them. Your Lord is not unaware of what you do.”",
            "verseStringReplacedWithAllah": "And say, “Praise be to Allah, He will show you His signs, and you will recognize them. Your Lord is not unaware of what you do.”"
        }
    ],
    "chapterNumber": 27,
    "nameInEnglish": "The Ant",
    "nameInTransliteration": "An Naml",
    "nameInArabic": "النمل",
    "numberOfVerses": 93
}