{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif. Lam. Ra. This is a Scripture that We revealed to you, to guide people from darkness into light, by the permission of their Lord, towards the path of the Almighty, the Praiseworthy."
        },
        {
            "verseNumber": 2,
            "verseString": "God, to whom belongs everything in the heavens and on the earth. Woe unto the unbelievers, for a severe punishment awaits them.",
            "verseStringReplacedWithAllah": "Allah, to whom belongs everything in the heavens and on the earth. Woe unto the unbelievers, for a severe punishment awaits them."
        },
        {
            "verseNumber": 3,
            "verseString": "Those who prefer the worldly life over the Hereafter, who deter others from God’s path, and seek to bend it. These are far astray.",
            "verseStringReplacedWithAllah": "Those who prefer the worldly life over the Hereafter, who deter others from Allah’s path, and seek to bend it. These are far astray."
        },
        {
            "verseNumber": 4,
            "verseString": "We sent every messenger in the language of his people, to clarify things for them. God leaves astray whom He wills, and He guides whom He wills. He is the All-Wise, the All-Powerful.",
            "verseStringReplacedWithAllah": "We sent every messenger in the language of his people, to clarify things for them. Allah leaves astray whom He wills, and He guides whom He wills. He is the All-Wise, the All-Powerful."
        },
        {
            "verseNumber": 5,
            "verseString": "We sent Moses with Our signs: “Lead your people from darkness into light, and remind them of God’s days.” In this are signs for every patient, thankful person.",
            "verseStringReplacedWithAllah": "We sent Moses with Our signs: “Lead your people from darkness into light, and remind them of Allah’s days.” In this are signs for every patient, thankful person."
        },
        {
            "verseNumber": 6,
            "verseString": "Moses told his people, “Remember God’s favor upon you, when He saved you from Pharaoh’s people, who imposed terrible suffering upon you, slaughtering your sons and sparing your daughters. That was a grave test from your Lord.”",
            "verseStringReplacedWithAllah": "Moses told his people, “Remember Allah’s favor upon you, when He saved you from Pharaoh’s people, who imposed terrible suffering upon you, slaughtering your sons and sparing your daughters. That was a grave test from your Lord.”"
        },
        {
            "verseNumber": 7,
            "verseString": "Your Lord declared, “If you are grateful, I will surely increase you; but if you are ungrateful, then My punishment is severe.”"
        },
        {
            "verseNumber": 8,
            "verseString": "Moses said, ”Even if you, along with everyone on earth, are ungrateful, God is still Self-Sufficient, Praiseworthy.”",
            "verseStringReplacedWithAllah": "Moses said, ”Even if you, along with everyone on earth, are ungrateful, Allah is still Self-Sufficient, Praiseworthy.”"
        },
        {
            "verseNumber": 9,
            "verseString": "Didn’t the stories of those before you reach you—the people of Noah, Aad, Thamud, and those after them? None knows them except God. Their messengers came to them with clear signs, but they tried to muzzle them, saying, “We disbelieve in what you’ve been sent with, and we are in serious doubt about what you invite us to.”",
            "verseStringReplacedWithAllah": "Didn’t the stories of those before you reach you—the people of Noah, Aad, Thamud, and those after them? None knows them except Allah. Their messengers came to them with clear signs, but they tried to muzzle them, saying, “We disbelieve in what you’ve been sent with, and we are in serious doubt about what you invite us to.”"
        },
        {
            "verseNumber": 10,
            "verseString": "Their messengers responded, “Is there doubt about God, the Originator of the heavens and the earth? He invites you to forgive your sins and delay you to a specified time.” They replied, “You are but humans like us, wanting to turn us away from what our ancestors worshiped. So, bring us clear evidence.”",
            "verseStringReplacedWithAllah": "Their messengers responded, “Is there doubt about Allah, the Originator of the heavens and the earth? He invites you to forgive your sins and delay you to a specified time.” They replied, “You are but humans like us, wanting to turn us away from what our ancestors worshiped. So, bring us clear evidence.”"
        },
        {
            "verseNumber": 11,
            "verseString": "Their messengers replied, “Indeed, we are only humans like you, yet God favors whom He wills of His servants. It’s not up to us to bring you proof except by God’s permission. In God, should the believers put their trust.”",
            "verseStringReplacedWithAllah": "Their messengers replied, “Indeed, we are only humans like you, yet Allah favors whom He wills of His servants. It’s not up to us to bring you proof except by Allah’s permission. In Allah, should the believers put their trust.”"
        },
        {
            "verseNumber": 12,
            "verseString": "“Why shouldn’t we trust God when He has guided us along our paths? We will patiently endure what you inflict upon us. Let those who trust place their trust in God.”",
            "verseStringReplacedWithAllah": "“Why shouldn’t we trust Allah when He has guided us along our paths? We will patiently endure what you inflict upon us. Let those who trust place their trust in Allah.”"
        },
        {
            "verseNumber": 13,
            "verseString": "The unbelievers told their messengers, “We will expel you from our land, unless you return to our religion.” Then their Lord revealed to them, “Most certainly, We will destroy the wrongdoers.”"
        },
        {
            "verseNumber": 14,
            "verseString": "“And after them, We will settle you in the land. This is for those who fear My position and heed My warnings.”"
        },
        {
            "verseNumber": 15,
            "verseString": "They sought victory, and every stubborn tyrant was disappointed."
        },
        {
            "verseNumber": 16,
            "verseString": "In front of him is Hell, and he will be given purulent water to drink."
        },
        {
            "verseNumber": 17,
            "verseString": "He will gulp it, yet he won’t swallow it. Death will come at him from every direction, yet he won’t die. And ahead of him, there is unrelenting torment."
        },
        {
            "verseNumber": 18,
            "verseString": "Those who deny their Lord, their works are like ashes, swept away by a fierce wind on a stormy day. They have no control over anything they’ve earned. This is the far straying."
        },
        {
            "verseNumber": 19,
            "verseString": "Don’t you see how God created the heavens and the earth in truth? If He wills, He can remove you and produce a new creation.",
            "verseStringReplacedWithAllah": "Don’t you see how Allah created the heavens and the earth in truth? If He wills, He can remove you and produce a new creation."
        },
        {
            "verseNumber": 20,
            "verseString": "And this is not difficult for God.",
            "verseStringReplacedWithAllah": "And this is not difficult for Allah."
        },
        {
            "verseNumber": 21,
            "verseString": "They will all appear before God. The weak will plead with the arrogant, “We were your followers; can you spare us from God’s punishment?” They will respond, “Had God guided us, we would’ve guided you. Whether we express impatience or endure patiently, there’s no escape for us.”",
            "verseStringReplacedWithAllah": "They will all appear before Allah. The weak will plead with the arrogant, “We were your followers; can you spare us from Allah’s punishment?” They will respond, “Had Allah guided us, we would’ve guided you. Whether we express impatience or endure patiently, there’s no escape for us.”"
        },
        {
            "verseNumber": 22,
            "verseString": "When judgment is passed, Satan will say, “God gave you a truthful promise, and I made you promises too, but I failed you. I had no authority over you, except that I invited you, and you responded to me. So, don’t blame me, but blame yourselves. I can’t answer your cries, nor can you answer mine. I disavow what you previously associated me with. For the wrongdoers, there is a severe punishment.”",
            "verseStringReplacedWithAllah": "When judgment is passed, Satan will say, “Allah gave you a truthful promise, and I made you promises too, but I failed you. I had no authority over you, except that I invited you, and you responded to me. So, don’t blame me, but blame yourselves. I can’t answer your cries, nor can you answer mine. I disavow what you previously associated me with. For the wrongdoers, there is a severe punishment.”"
        },
        {
            "verseNumber": 23,
            "verseString": "Those who believed and worked righteousness will be admitted into Gardens beneath which rivers flow, abiding therein by the permission of their Lord, and their greeting therein will be “Peace.”"
        },
        {
            "verseNumber": 24,
            "verseString": "Don’t you see how God presents a parable? A good word is like a good tree: its roots are firmly anchored, and its branches extend towards the sky.",
            "verseStringReplacedWithAllah": "Don’t you see how Allah presents a parable? A good word is like a good tree: its roots are firmly anchored, and its branches extend towards the sky."
        },
        {
            "verseNumber": 25,
            "verseString": "It produces its fruit every season by the permission of its Lord. God presents such analogies to people so they may reflect.",
            "verseStringReplacedWithAllah": "It produces its fruit every season by the permission of its Lord. Allah presents such analogies to people so they may reflect."
        },
        {
            "verseNumber": 26,
            "verseString": "The analogy of a wicked word is like a rotten tree, uprooted from the ground, lacking stability."
        },
        {
            "verseNumber": 27,
            "verseString": "God anchors the believers with the firm word, in this life and the Hereafter. God makes the wrongdoers go astray, for God does what He wills.",
            "verseStringReplacedWithAllah": "Allah anchors the believers with the firm word, in this life and the Hereafter. Allah makes the wrongdoers go astray, for Allah does what He wills."
        },
        {
            "verseNumber": 28,
            "verseString": "Haven’t you considered those who exchanged God’s favor for disbelief and brought their people to ruins?",
            "verseStringReplacedWithAllah": "Haven’t you considered those who exchanged Allah’s favor for disbelief and brought their people to ruins?"
        },
        {
            "verseNumber": 29,
            "verseString": "Hell, where they will burn; a terrible dwelling!"
        },
        {
            "verseNumber": 30,
            "verseString": "They set up equals to God, intending to mislead others from His path. Say, “Enjoy your brief pleasures; your final destination is the Fire.”",
            "verseStringReplacedWithAllah": "They set up equals to Allah, intending to mislead others from His path. Say, “Enjoy your brief pleasures; your final destination is the Fire.”"
        },
        {
            "verseNumber": 31,
            "verseString": "Tell My servants who have believed to establish their prayers and to give from what We provide for them, secretly and openly, before the arrival of a day in which there will be neither bargaining nor befriending."
        },
        {
            "verseNumber": 32,
            "verseString": "It is God who created the heavens and the earth and sends down rain from the sky, thereby producing fruits for your sustenance. And He subjected to you the ships to sail through the sea by His command, and He subjected the rivers to you.",
            "verseStringReplacedWithAllah": "It is Allah who created the heavens and the earth and sends down rain from the sky, thereby producing fruits for your sustenance. And He subjected to you the ships to sail through the sea by His command, and He subjected the rivers to you."
        },
        {
            "verseNumber": 33,
            "verseString": "Also, He subjected to you the sun and the moon, both diligently pursuing their courses, and He subjected the night and the day to you."
        },
        {
            "verseNumber": 34,
            "verseString": "He gave you something of all that you requested. If you were to count God’s blessings, you could never enumerate them. Man is given to wrongdoing and ingratitude.",
            "verseStringReplacedWithAllah": "He gave you something of all that you requested. If you were to count Allah’s blessings, you could never enumerate them. Man is given to wrongdoing and ingratitude."
        },
        {
            "verseNumber": 35,
            "verseString": "And when Abraham said, “My Lord, make this city safe, and keep me and my offspring from worshiping idols.”"
        },
        {
            "verseNumber": 36,
            "verseString": "“My Lord, they have misled many among the people. So whoever follows me, then he is of me; and whoever disobeys me, then You are Forgiving and Merciful.”"
        },
        {
            "verseNumber": 37,
            "verseString": "“Our Lord, I have settled some of my descendants in an uncultivated valley, near Your Sacred House, so they may establish prayer. Our Lord, make people’s hearts incline towards them, and provide them with fruits, so they may be thankful.”"
        },
        {
            "verseNumber": 38,
            "verseString": "“Our Lord, You know what we conceal and what we declare. And nothing is hidden from God on the earth or in the heavens.”",
            "verseStringReplacedWithAllah": "“Our Lord, You know what we conceal and what we declare. And nothing is hidden from Allah on the earth or in the heavens.”"
        },
        {
            "verseNumber": 39,
            "verseString": "“Praise be to God, Who, even in my old age, granted me Ishmael and Isaac. My Lord is the Hearer of prayers.”",
            "verseStringReplacedWithAllah": "“Praise be to Allah, Who, even in my old age, granted me Ishmael and Isaac. My Lord is the Hearer of prayers.”"
        },
        {
            "verseNumber": 40,
            "verseString": "“My Lord, make me an establisher of prayer, and of my descendants. Our Lord, and accept my supplication.”"
        },
        {
            "verseNumber": 41,
            "verseString": "“Our Lord, forgive me, my parents, and the believers on the Day when judgment occurs.”"
        },
        {
            "verseNumber": 42,
            "verseString": "Never think that God is unaware of what the wrongdoers do. He only delays them to a Day when the eyes transfix.",
            "verseStringReplacedWithAllah": "Never think that Allah is unaware of what the wrongdoers do. He only delays them to a Day when the eyes transfix."
        },
        {
            "verseNumber": 43,
            "verseString": "Rushing forward, their heads upraised, their gaze unflinching, their hearts void."
        },
        {
            "verseNumber": 44,
            "verseString": "Warn the people of the Day when the punishment will befall them, and the wrongdoers will say, “Our Lord, delay us for a little while, and we will answer Your call and follow the messengers.” But didn’t you swear before that there will be no end for you?"
        },
        {
            "verseNumber": 45,
            "verseString": "You inhabited the homes of those who wronged themselves, and it became clear to you how We treated them. And We have illustrated for you the examples."
        },
        {
            "verseNumber": 46,
            "verseString": "They devised their plan, and their plan is known to God, even if their plan were to eliminate mountains.",
            "verseStringReplacedWithAllah": "They devised their plan, and their plan is known to Allah, even if their plan were to eliminate mountains."
        },
        {
            "verseNumber": 47,
            "verseString": "Never think that God will fail in His promise to His messengers. God is Mighty, Owner of Retribution.",
            "verseStringReplacedWithAllah": "Never think that Allah will fail in His promise to His messengers. Allah is Mighty, Owner of Retribution."
        },
        {
            "verseNumber": 48,
            "verseString": "On the Day when the earth will be changed to another earth, and the heavens as well, and they will appear before God, the One, the Dominant.",
            "verseStringReplacedWithAllah": "On the Day when the earth will be changed to another earth, and the heavens as well, and they will appear before Allah, the One, the Dominant."
        },
        {
            "verseNumber": 49,
            "verseString": "On that Day, you will see the criminals bound in chains."
        },
        {
            "verseNumber": 50,
            "verseString": "Their garments made of tar, and the flames covering their faces."
        },
        {
            "verseNumber": 51,
            "verseString": "So that God may recompense every soul for what it has earned. God is swift in accounting.",
            "verseStringReplacedWithAllah": "So that Allah may recompense every soul for what it has earned. Allah is swift in accounting."
        },
        {
            "verseNumber": 52,
            "verseString": "This is a proclamation for humankind, that they may be warned thereby, and that they may know that He is One God, and so that those possessed of understanding may take heed."
        }
    ],
    "chapterNumber": 14,
    "nameInEnglish": "Abraham",
    "nameInTransliteration": "Ibrahim",
    "nameInArabic": "إبراهيم",
    "numberOfVerses": 52
}