{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "O people, be conscious of your Lord, who created you from a single soul, and created from it its mate. From them both, He spread many men and women. Revere God, the one through whom you demand your mutual rights, and respect family relationships. God is always watchful over you.",
            "verseStringReplacedWithAllah": "O people, be conscious of your Lord, who created you from a single soul, and created from it its mate. From them both, He spread many men and women. Revere Allah, the one through whom you demand your mutual rights, and respect family relationships. Allah is always watchful over you."
        },
        {
            "verseNumber": 2,
            "verseString": "To orphans, return their properties rightfully. Don’t substitute bad with good, nor absorb their wealth into your own. Indeed, it is a great sin."
        },
        {
            "verseNumber": 3,
            "verseString": "But if you fear you can’t treat orphaned girls fairly, then marry women that seem good to you: two, three, or four. But if you fear you won’t be fair, then only one, or what your right hands possess. This is more likely to prevent you from committing injustice."
        },
        {
            "verseNumber": 4,
            "verseString": "Give the women their dowries graciously. But if they willingly give up a portion of it, then consume it with good cheer and gratitude."
        },
        {
            "verseNumber": 5,
            "verseString": "Don’t entrust your properties, which God made a means of support for you, to the weak-minded. But provide for them from it, clothe them, and speak to them kindly.",
            "verseStringReplacedWithAllah": "Don’t entrust your properties, which Allah made a means of support for you, to the weak-minded. But provide for them from it, clothe them, and speak to them kindly."
        },
        {
            "verseNumber": 6,
            "verseString": "And test the orphans until they reach the age of marriage. If you find them to be of good judgment, release their wealth to them. Don’t consume it wastefully and hastily before they grow up. Whoever is well-off, let him abstain; whoever is poor, let him consume reasonably. When you hand over their properties to them, call witnesses. God is sufficient as a Reckoner.",
            "verseStringReplacedWithAllah": "And test the orphans until they reach the age of marriage. If you find them to be of good judgment, release their wealth to them. Don’t consume it wastefully and hastily before they grow up. Whoever is well-off, let him abstain; whoever is poor, let him consume reasonably. When you hand over their properties to them, call witnesses. Allah is sufficient as a Reckoner."
        },
        {
            "verseNumber": 7,
            "verseString": "Men have a share in what parents and close relatives leave behind, and women have a share in what parents and relatives leave behind, be it little or much—a prescribed share."
        },
        {
            "verseNumber": 8,
            "verseString": "When relatives, orphans, and those in need are present at the distribution, give them something from it, and speak kindly to them."
        },
        {
            "verseNumber": 9,
            "verseString": "Those who worry about leaving behind weak offspring should fear God and say correct words.",
            "verseStringReplacedWithAllah": "Those who worry about leaving behind weak offspring should fear Allah and say correct words."
        },
        {
            "verseNumber": 10,
            "verseString": "Those who consume the wealth of orphans unjustly, are only ingesting fire into their bellies, and they will be subjected to a blazing Hellfire."
        },
        {
            "verseNumber": 11,
            "verseString": "God instructs you regarding your children: for a male, the share is equivalent to that of two females. If there are more than two daughters, they get two-thirds of what he leaves behind. If there is only one daughter, she gets half. As for the parents, each gets one-sixth of what he leaves behind if he had a child. If he had no children and his parents are the sole inheritors, his mother gets a third. But if he had brothers and sisters, then, his mother will get a sixth. This is after fulfilling any will or debt. You don’t know whether your parents or children are closer to you in benefit. These are God’s decrees. God is ever Knowing and Wise.",
            "verseStringReplacedWithAllah": "Allah instructs you regarding your children: for a male, the share is equivalent to that of two females. If there are more than two daughters, they get two-thirds of what he leaves behind. If there is only one daughter, she gets half. As for the parents, each gets one-sixth of what he leaves behind if he had a child. If he had no children and his parents are the sole inheritors, his mother gets a third. But if he had brothers and sisters, then, his mother will get a sixth. This is after fulfilling any will or debt. You don’t know whether your parents or children are closer to you in benefit. These are Allah’s decrees. Allah is ever Knowing and Wise."
        },
        {
            "verseNumber": 12,
            "verseString": "You get half of what your wives leave behind, if they had no children. If they had children, you get one-fourth of what they leave behind, after fulfilling any will or debt. They get a fourth of what you leave behind if you have no children. If you have children, they get one-eighth of what you leave behind, after fulfilling any will or debt. If a man or woman leaves neither parents nor children, but has a brother or sister, each of them gets a sixth. If there are more siblings, they share a third, after fulfilling any will or debt. Without causing harm. A command from God. And God is All-Knowing, Most Forbearing.",
            "verseStringReplacedWithAllah": "You get half of what your wives leave behind, if they had no children. If they had children, you get one-fourth of what they leave behind, after fulfilling any will or debt. They get a fourth of what you leave behind if you have no children. If you have children, they get one-eighth of what you leave behind, after fulfilling any will or debt. If a man or woman leaves neither parents nor children, but has a brother or sister, each of them gets a sixth. If there are more siblings, they share a third, after fulfilling any will or debt. Without causing harm. A command from Allah. And Allah is All-Knowing, Most Forbearing."
        },
        {
            "verseNumber": 13,
            "verseString": "These are the limits set by God. Whoever obeys God and His Messenger, He will admit him into gardens through which rivers flow, to dwell there eternally. That is the supreme triumph.",
            "verseStringReplacedWithAllah": "These are the limits set by Allah. Whoever obeys Allah and His Messenger, He will admit him into gardens through which rivers flow, to dwell there eternally. That is the supreme triumph."
        },
        {
            "verseNumber": 14,
            "verseString": "However, whoever disobeys God and His Messenger, and transgresses His limits, will be thrown into a Fire, where he will dwell forever, and he will have a humiliating punishment.",
            "verseStringReplacedWithAllah": "However, whoever disobeys Allah and His Messenger, and transgresses His limits, will be thrown into a Fire, where he will dwell forever, and he will have a humiliating punishment."
        },
        {
            "verseNumber": 15,
            "verseString": "If any of your women commit an immoral act, call upon four witnesses from among you against them. If they testify, confine them to the houses until death claims them, or God makes a way for them.",
            "verseStringReplacedWithAllah": "If any of your women commit an immoral act, call upon four witnesses from among you against them. If they testify, confine them to the houses until death claims them, or Allah makes a way for them."
        },
        {
            "verseNumber": 16,
            "verseString": "If two men among you commit it, then punish them. However, if they repent and reform, leave them alone. God is Accepting of Repentance, Most Merciful.",
            "verseStringReplacedWithAllah": "If two men among you commit it, then punish them. However, if they repent and reform, leave them alone. Allah is Accepting of Repentance, Most Merciful."
        },
        {
            "verseNumber": 17,
            "verseString": "God accepts the repentance of those who do evil in ignorance and then repent shortly after that. To them, God will grant forgiveness. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "Allah accepts the repentance of those who do evil in ignorance and then repent shortly after that. To them, Allah will grant forgiveness. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 18,
            "verseString": "However, repentance is not accepted from those who persist in wrongdoing, only to say, “Now I repent” when death is imminent, nor from those who die disbelieving. For them, We’ve prepared a severe punishment."
        },
        {
            "verseNumber": 19,
            "verseString": "O you who believe, it’s not lawful for you to inherit women against their will. Nor should you coerce them to return anything you’ve given them—unless they commit a clear immoral act. Live with them in kindness. If you dislike them, it may well be that you dislike something in which God has placed much good.",
            "verseStringReplacedWithAllah": "O you who believe, it’s not lawful for you to inherit women against their will. Nor should you coerce them to return anything you’ve given them—unless they commit a clear immoral act. Live with them in kindness. If you dislike them, it may well be that you dislike something in which Allah has placed much good."
        },
        {
            "verseNumber": 20,
            "verseString": "If you wish to replace one wife with another, and you’ve given one of them a fortune, don’t take anything from it. Would you take it out of falsehood and blatant sin?"
        },
        {
            "verseNumber": 21,
            "verseString": "How could you take it back after having shared intimate relations and they received a solemn covenant from you?"
        },
        {
            "verseNumber": 22,
            "verseString": "Don’t marry the women your fathers had married, except what has already transpired; it’s an indecent act, shameful, and a vile path."
        },
        {
            "verseNumber": 23,
            "verseString": "Forbidden to you are your mothers, daughters, sisters, paternal aunts, maternal aunts, brother’s daughters, sister’s daughters, nursing mothers, nursing sisters, mothers-in-law, and stepdaughters under your guardianship from wives with whom you’ve been intimate. If you haven’t been intimate with them, you are not blamed. Also the wives of your biological sons, and marrying two sisters simultaneously, unless it has already occurred. God is Oft-Forgiving, Merciful.",
            "verseStringReplacedWithAllah": "Forbidden to you are your mothers, daughters, sisters, paternal aunts, maternal aunts, brother’s daughters, sister’s daughters, nursing mothers, nursing sisters, mothers-in-law, and stepdaughters under your guardianship from wives with whom you’ve been intimate. If you haven’t been intimate with them, you are not blamed. Also the wives of your biological sons, and marrying two sisters simultaneously, unless it has already occurred. Allah is Oft-Forgiving, Merciful."
        },
        {
            "verseNumber": 24,
            "verseString": "And all married women, except those whom you rightfully possess. This is a decree from God upon you. Beyond these, all others are lawful, provided you seek them with your wealth in a legal marriage, not in fornication. When you wish to enjoy them, give them their bridal gifts, as an obligation. You commit no wrong by mutually agreeing to any adjustments to these gifts. God is All-Knowing, Most Wise.",
            "verseStringReplacedWithAllah": "And all married women, except those whom you rightfully possess. This is a decree from Allah upon you. Beyond these, all others are lawful, provided you seek them with your wealth in a legal marriage, not in fornication. When you wish to enjoy them, give them their bridal gifts, as an obligation. You commit no wrong by mutually agreeing to any adjustments to these gifts. Allah is All-Knowing, Most Wise."
        },
        {
            "verseNumber": 25,
            "verseString": "Those among you who can’t afford to marry free, believing women, may marry believing maids under your care. God is well aware of your faith; you are of one another. Marry them with their guardians’ permission, and give them their rightful dowries, in pursuit of virtue, not immorality or secret affairs. If they commit adultery after their marriage, their punishment is half that of free women. This is for those who fear falling into sin, but it’s better for you to be patient. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "Those among you who can’t afford to marry free, believing women, may marry believing maids under your care. Allah is well aware of your faith; you are of one another. Marry them with their guardians’ permission, and give them their rightful dowries, in pursuit of virtue, not immorality or secret affairs. If they commit adultery after their marriage, their punishment is half that of free women. This is for those who fear falling into sin, but it’s better for you to be patient. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 26,
            "verseString": "God wants to clarify for you, and to guide you to the ways of those who came before you, and to accept your repentance. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "Allah wants to clarify for you, and to guide you to the ways of those who came before you, and to accept your repentance. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 27,
            "verseString": "God intends to accept your repentance, but those who follow their desires desire you to deviate in a great deviation.",
            "verseStringReplacedWithAllah": "Allah intends to accept your repentance, but those who follow their desires desire you to deviate in a great deviation."
        },
        {
            "verseNumber": 28,
            "verseString": "God intends to lighten your burdens, for the human being was created weak.",
            "verseStringReplacedWithAllah": "Allah intends to lighten your burdens, for the human being was created weak."
        },
        {
            "verseNumber": 29,
            "verseString": "O you who believe, don’t consume each other’s wealth unjustly, but trade by mutual consent. And don’t kill yourselves, for God is Merciful to you.",
            "verseStringReplacedWithAllah": "O you who believe, don’t consume each other’s wealth unjustly, but trade by mutual consent. And don’t kill yourselves, for Allah is Merciful to you."
        },
        {
            "verseNumber": 30,
            "verseString": "Whoever commits such acts out of aggression and injustice, We will throw him in a Fire. And that’s easy for God.",
            "verseStringReplacedWithAllah": "Whoever commits such acts out of aggression and injustice, We will throw him in a Fire. And that’s easy for Allah."
        },
        {
            "verseNumber": 31,
            "verseString": "If you avoid the major sins you’re forbidden, We will erase your misdeeds and admit you into a noble entrance."
        },
        {
            "verseNumber": 32,
            "verseString": "Don’t covet what God favored some over others with. Men have a share in what they’ve earned, and women have a share in what they’ve earned. Ask God for His bounty, for God has full knowledge of everything.",
            "verseStringReplacedWithAllah": "Don’t covet what Allah favored some over others with. Men have a share in what they’ve earned, and women have a share in what they’ve earned. Ask Allah for His bounty, for Allah has full knowledge of everything."
        },
        {
            "verseNumber": 33,
            "verseString": "To everyone, We’ve appointed beneficiaries in what parents and near relatives leave behind. As for those with whom you’ve pledged, give them their share. God is a witness to all things.",
            "verseStringReplacedWithAllah": "To everyone, We’ve appointed beneficiaries in what parents and near relatives leave behind. As for those with whom you’ve pledged, give them their share. Allah is a witness to all things."
        },
        {
            "verseNumber": 34,
            "verseString": "Men are the protectors and maintainers of women, as God has given some more than others, and because they spend from their wealth. Righteous women are obedient, guarding in absence what God would have them guard. those whose disobedience or ill-conduct you fear, advise them, separate from them in bed, and then strike them. If they obey you, seek no means against them. God is Exalted, Supreme.",
            "verseStringReplacedWithAllah": "Men are the protectors and maintainers of women, as Allah has given some more than others, and because they spend from their wealth. Righteous women are obedient, guarding in absence what Allah would have them guard. those whose disobedience or ill-conduct you fear, advise them, separate from them in bed, and then strike them. If they obey you, seek no means against them. Allah is Exalted, Supreme."
        },
        {
            "verseNumber": 35,
            "verseString": "If you fear a breach between a couple, appoint an arbitrator from his family and another from hers. If they desire reconciliation, God will reconcile them. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "If you fear a breach between a couple, appoint an arbitrator from his family and another from hers. If they desire reconciliation, Allah will reconcile them. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 36,
            "verseString": "Worship God and associate nothing with Him. Honor your parents, relatives, orphans, those in need, near and distant neighbors, companions, travelers, and servants. God doesn’t love the arrogant and boastful.",
            "verseStringReplacedWithAllah": "Worship Allah and associate nothing with Him. Honor your parents, relatives, orphans, those in need, near and distant neighbors, companions, travelers, and servants. Allah doesn’t love the arrogant and boastful."
        },
        {
            "verseNumber": 37,
            "verseString": "Those who are stingy, encourage stinginess, and conceal what God has given them from His bounty—for the unbelievers, We’ve prepared a humiliating torment.",
            "verseStringReplacedWithAllah": "Those who are stingy, encourage stinginess, and conceal what Allah has given them from His bounty—for the unbelievers, We’ve prepared a humiliating torment."
        },
        {
            "verseNumber": 38,
            "verseString": "Those who spend their wealth to be seen by people, without faith in God and the Last Day. Whoever takes Satan as an ally—what a terrible ally!",
            "verseStringReplacedWithAllah": "Those who spend their wealth to be seen by people, without faith in Allah and the Last Day. Whoever takes Satan as an ally—what a terrible ally!"
        },
        {
            "verseNumber": 39,
            "verseString": "What harm would befall them if they believed in God and the Last Day, and donated from what God has provided them? God is fully aware of them.",
            "verseStringReplacedWithAllah": "What harm would befall them if they believed in Allah and the Last Day, and donated from what Allah has provided them? Allah is fully aware of them."
        },
        {
            "verseNumber": 40,
            "verseString": "God doesn’t do injustice, even as much as an atom’s weight; while if there is a good deed, He multiplies it and gives from Himself a great reward.",
            "verseStringReplacedWithAllah": "Allah doesn’t do injustice, even as much as an atom’s weight; while if there is a good deed, He multiplies it and gives from Himself a great reward."
        },
        {
            "verseNumber": 41,
            "verseString": "How will it be, when We summon a witness from every community, and We bring you as a witness against these people?"
        },
        {
            "verseNumber": 42,
            "verseString": "On that Day, those who disbelieved and defied the Messenger will wish they were leveled with the earth. They won’t be able to conceal anything from God.",
            "verseStringReplacedWithAllah": "On that Day, those who disbelieved and defied the Messenger will wish they were leveled with the earth. They won’t be able to conceal anything from Allah."
        },
        {
            "verseNumber": 43,
            "verseString": "O you who believe, don’t approach prayer while intoxicated, until you know what you’re saying, nor while unclean—except when traveling—until you have bathed. If you are ill, on a journey, have relieved yourselves, or have been intimate with women, and can’t find water, find clean sand and wipe your faces and hands with it. God is Ever-Pardoning, Most Forgiving.",
            "verseStringReplacedWithAllah": "O you who believe, don’t approach prayer while intoxicated, until you know what you’re saying, nor while unclean—except when traveling—until you have bathed. If you are ill, on a journey, have relieved yourselves, or have been intimate with women, and can’t find water, find clean sand and wipe your faces and hands with it. Allah is Ever-Pardoning, Most Forgiving."
        },
        {
            "verseNumber": 44,
            "verseString": "Haven’t you seen those who were given a portion of the Scripture, who purchase error and want you to lose the way?"
        },
        {
            "verseNumber": 45,
            "verseString": "But God is better aware of your enemies, and God is a sufficient protector, and God is a sufficient helper.",
            "verseStringReplacedWithAllah": "But Allah is better aware of your enemies, and Allah is a sufficient protector, and Allah is a sufficient helper."
        },
        {
            "verseNumber": 46,
            "verseString": "Among those who are Jewish, some distort words out of their contexts and say, “We hear and disobey,” and “Hear, but don’t listen,” and “Ra’ina,” twisting their tongues and defaming the religion. But if they had said, “We hear and we obey,” and “Listen,” and “Unzurna,” it would’ve been better for them and more upright. But God has cursed them for their disbelief, so they believe not, except for a few.",
            "verseStringReplacedWithAllah": "Among those who are Jewish, some distort words out of their contexts and say, “We hear and disobey,” and “Hear, but don’t listen,” and “Ra’ina,” twisting their tongues and defaming the religion. But if they had said, “We hear and we obey,” and “Listen,” and “Unzurna,” it would’ve been better for them and more upright. But Allah has cursed them for their disbelief, so they believe not, except for a few."
        },
        {
            "verseNumber": 47,
            "verseString": "O you who were given the Scripture, believe in what We’ve revealed, confirming what’s already with you, before We obliterate faces and turn them backward or curse them as We cursed the Sabbath-breakers. God’s command is always executed.",
            "verseStringReplacedWithAllah": "O you who were given the Scripture, believe in what We’ve revealed, confirming what’s already with you, before We obliterate faces and turn them backward or curse them as We cursed the Sabbath-breakers. Allah’s command is always executed."
        },
        {
            "verseNumber": 48,
            "verseString": "God doesn’t forgive the association with Him, but He forgives anything less than that to whom He wills. Whoever associates partners with God has devised a grave sin.",
            "verseStringReplacedWithAllah": "Allah doesn’t forgive the association with Him, but He forgives anything less than that to whom He wills. Whoever associates partners with Allah has devised a grave sin."
        },
        {
            "verseNumber": 49,
            "verseString": "Did you see those who claim purity for themselves? Instead, God purifies whom He wills, and they won’t be wronged even by the width of a thread.",
            "verseStringReplacedWithAllah": "Did you see those who claim purity for themselves? Instead, Allah purifies whom He wills, and they won’t be wronged even by the width of a thread."
        },
        {
            "verseNumber": 50,
            "verseString": "See how they invent lies against God. That in itself is a clear sin.",
            "verseStringReplacedWithAllah": "See how they invent lies against Allah. That in itself is a clear sin."
        },
        {
            "verseNumber": 51,
            "verseString": "Did you notice those who were given a portion of the Scripture? They believe in superstition and oppressive powers, even saying to the disbelievers, “These are better guided on the path than the believers.”"
        },
        {
            "verseNumber": 52,
            "verseString": "These are the ones whom God has cursed. Whomever God curses—you won’t find a helper for him.",
            "verseStringReplacedWithAllah": "These are the ones whom Allah has cursed. Whomever Allah curses—you won’t find a helper for him."
        },
        {
            "verseNumber": 53,
            "verseString": "Do they own a portion of the sovereignty? If so, they wouldn’t give others even a speck."
        },
        {
            "verseNumber": 54,
            "verseString": "Or do they envy people for what God has granted them from His bounty? We gave the family of Abraham the Scripture, wisdom, and a grand kingdom.",
            "verseStringReplacedWithAllah": "Or do they envy people for what Allah has granted them from His bounty? We gave the family of Abraham the Scripture, wisdom, and a grand kingdom."
        },
        {
            "verseNumber": 55,
            "verseString": "Some of them believed in it, while others held back from it. Hell is a sufficient inferno."
        },
        {
            "verseNumber": 56,
            "verseString": "Those who disbelieve in Our verses, We will scorch them in a Fire. Every time their skins are roasted through, We substitute them with new skins so they may taste the punishment. Indeed, God is ever Exalted in Might and Wise.",
            "verseStringReplacedWithAllah": "Those who disbelieve in Our verses, We will scorch them in a Fire. Every time their skins are roasted through, We substitute them with new skins so they may taste the punishment. Indeed, Allah is ever Exalted in Might and Wise."
        },
        {
            "verseNumber": 57,
            "verseString": "As for those who believe and do righteous deeds—We will admit them into gardens through which rivers flow, where they will abide forever. There, they will have purified spouses, and We will admit them into abundant shade."
        },
        {
            "verseNumber": 58,
            "verseString": "God instructs you to return trusts to their rightful owners, and when you judge between people, judge with fairness. God’s instructions to you are excellent. God is All-Hearing, All-Seeing.",
            "verseStringReplacedWithAllah": "Allah instructs you to return trusts to their rightful owners, and when you judge between people, judge with fairness. Allah’s instructions to you are excellent. Allah is All-Hearing, All-Seeing."
        },
        {
            "verseNumber": 59,
            "verseString": "O you who believe, obey God, the Messenger, and those of authority among you. If you disagree on something, refer it to God and the Messenger if you truly believe in God and the Last Day. This is the best way and will result in the best outcome.",
            "verseStringReplacedWithAllah": "O you who believe, obey Allah, the Messenger, and those of authority among you. If you disagree on something, refer it to Allah and the Messenger if you truly believe in Allah and the Last Day. This is the best way and will result in the best outcome."
        },
        {
            "verseNumber": 60,
            "verseString": "Did you notice those who claim to believe in what was revealed to you, and in what was revealed before you, yet they seek judgment from oppressive sources of law? Satan aims to lead them far astray."
        },
        {
            "verseNumber": 61,
            "verseString": "When it is said to them, “Come to what God revealed, and to the Messenger,” you see the hypocrites turning away from you completely.",
            "verseStringReplacedWithAllah": "When it is said to them, “Come to what Allah revealed, and to the Messenger,” you see the hypocrites turning away from you completely."
        },
        {
            "verseNumber": 62,
            "verseString": "How about when a misfortune strikes them because of what they’ve done? Then they come to you, swearing by God, “We intended nothing but goodwill and conciliation.”",
            "verseStringReplacedWithAllah": "How about when a misfortune strikes them because of what they’ve done? Then they come to you, swearing by Allah, “We intended nothing but goodwill and conciliation.”"
        },
        {
            "verseNumber": 63,
            "verseString": "Those are the ones whom God knows what’s in their hearts. So, turn away from them, admonish them, and speak to them with insightful words.",
            "verseStringReplacedWithAllah": "Those are the ones whom Allah knows what’s in their hearts. So, turn away from them, admonish them, and speak to them with insightful words."
        },
        {
            "verseNumber": 64,
            "verseString": "We sent no Messenger, but to be obeyed by the leave of God. If they had only, when they wronged themselves, come to you and asked God’s forgiveness, and the Messenger had asked forgiveness for them, they would’ve found God Accepting of repentance, Most Merciful.",
            "verseStringReplacedWithAllah": "We sent no Messenger, but to be obeyed by the leave of Allah. If they had only, when they wronged themselves, come to you and asked Allah’s forgiveness, and the Messenger had asked forgiveness for them, they would’ve found Allah Accepting of repentance, Most Merciful."
        },
        {
            "verseNumber": 65,
            "verseString": "But no, by your Lord, they won’t believe until they seek your arbitration in their disputes, then find no resistance within themselves to your decisions and fully submit themselves."
        },
        {
            "verseNumber": 66,
            "verseString": "Had We commanded them, “Lay down your lives,” or “Abandon your homes,” only a few would have complied. If they had done what they were advised, it would’ve been better for them and strengthened their conviction."
        },
        {
            "verseNumber": 67,
            "verseString": "Then We would’ve rewarded them generously from Us."
        },
        {
            "verseNumber": 68,
            "verseString": "And We would’ve guided them to a straight path."
        },
        {
            "verseNumber": 69,
            "verseString": "Whoever obeys God and the Messenger will be among those whom God has blessed: the prophets, the truthful, the martyrs, and the righteous. What excellent companions they are!",
            "verseStringReplacedWithAllah": "Whoever obeys Allah and the Messenger will be among those whom Allah has blessed: the prophets, the truthful, the martyrs, and the righteous. What excellent companions they are!"
        },
        {
            "verseNumber": 70,
            "verseString": "This is the bounty from God, and sufficient is God as the All-Knowing.",
            "verseStringReplacedWithAllah": "This is the bounty from Allah, and sufficient is Allah as the All-Knowing."
        },
        {
            "verseNumber": 71,
            "verseString": "O you who believe, take your precautions and advance in units or advance altogether."
        },
        {
            "verseNumber": 72,
            "verseString": "Among you, is he who hesitates. If a disaster strikes you, he would say, “God has favored me, since I wasn’t martyred with them.”",
            "verseStringReplacedWithAllah": "Among you, is he who hesitates. If a disaster strikes you, he would say, “Allah has favored me, since I wasn’t martyred with them.”"
        },
        {
            "verseNumber": 73,
            "verseString": "Yet, should a bounty from God come your way, he would say, as if there was never any love between you and him, “I wish I had been with them, so I could have achieved a great victory.”",
            "verseStringReplacedWithAllah": "Yet, should a bounty from Allah come your way, he would say, as if there was never any love between you and him, “I wish I had been with them, so I could have achieved a great victory.”"
        },
        {
            "verseNumber": 74,
            "verseString": "Therefore, let those who trade this worldly life for the Hereafter fight in God’s path. Whoever fights in God’s path, whether he is slain or victorious, We will grant him a great reward.",
            "verseStringReplacedWithAllah": "Therefore, let those who trade this worldly life for the Hereafter fight in Allah’s path. Whoever fights in Allah’s path, whether he is slain or victorious, We will grant him a great reward."
        },
        {
            "verseNumber": 75,
            "verseString": "Why shouldn’t you fight in God’s path, when the oppressed among men, women, and children implore, “Our Lord, deliver us from this town of oppressive people, and appoint for us from You a protector and appoint for us from You a helper.”?",
            "verseStringReplacedWithAllah": "Why shouldn’t you fight in Allah’s path, when the oppressed among men, women, and children implore, “Our Lord, deliver us from this town of oppressive people, and appoint for us from You a protector and appoint for us from You a helper.”?"
        },
        {
            "verseNumber": 76,
            "verseString": "Those who believe fight in the cause of God, while those who disbelieve fight in the cause of tyranny. So, fight against Satan’s allies; surely, Satan’s strategies are weak.",
            "verseStringReplacedWithAllah": "Those who believe fight in the cause of Allah, while those who disbelieve fight in the cause of tyranny. So, fight against Satan’s allies; surely, Satan’s strategies are weak."
        },
        {
            "verseNumber": 77,
            "verseString": "Didn’t you see those who were told, “Hold back your hands, perform the prayer, and give the obligatory charity”? Yet, when fighting was prescribed for them, a group among them feared people as they should fear God, or even more so. They said, “Our Lord, why did You decree fighting upon us? Couldn’t You have postponed it for us for a little while?” Say, “The enjoyment of this world is fleeting, but the Hereafter is better for the righteous, and you won’t be wronged in the slightest.”",
            "verseStringReplacedWithAllah": "Didn’t you see those who were told, “Hold back your hands, perform the prayer, and give the obligatory charity”? Yet, when fighting was prescribed for them, a group among them feared people as they should fear Allah, or even more so. They said, “Our Lord, why did You decree fighting upon us? Couldn’t You have postponed it for us for a little while?” Say, “The enjoyment of this world is fleeting, but the Hereafter is better for the righteous, and you won’t be wronged in the slightest.”"
        },
        {
            "verseNumber": 78,
            "verseString": "Wherever you may be, death will overtake you, even if you are in fortified towers. If they receive good, they say, “This is from God,” but if misfortune strikes them, they say, “This is from you.” Say, “All is from God.” So, what is wrong with these people, that they hardly understand any statement?",
            "verseStringReplacedWithAllah": "Wherever you may be, death will overtake you, even if you are in fortified towers. If they receive good, they say, “This is from Allah,” but if misfortune strikes them, they say, “This is from you.” Say, “All is from Allah.” So, what is wrong with these people, that they hardly understand any statement?"
        },
        {
            "verseNumber": 79,
            "verseString": "Whatever good befalls you is from God, and whatever ill befalls you is from yourself. We sent you as a messenger to the people, and God is sufficient as a witness.",
            "verseStringReplacedWithAllah": "Whatever good befalls you is from Allah, and whatever ill befalls you is from yourself. We sent you as a messenger to the people, and Allah is sufficient as a witness."
        },
        {
            "verseNumber": 80,
            "verseString": "Whoever obeys the Messenger has obeyed God. As for those who turn away, We didn’t send you as their overseer.",
            "verseStringReplacedWithAllah": "Whoever obeys the Messenger has obeyed Allah. As for those who turn away, We didn’t send you as their overseer."
        },
        {
            "verseNumber": 81,
            "verseString": "They profess obedience. But when they leave your presence, a group among them plans during the night something contrary to what you say. God writes down what they plan by night. Turn away from them then, and rely on God. God is enough as a trustee.",
            "verseStringReplacedWithAllah": "They profess obedience. But when they leave your presence, a group among them plans during the night something contrary to what you say. Allah writes down what they plan by night. Turn away from them then, and rely on Allah. Allah is enough as a trustee."
        },
        {
            "verseNumber": 82,
            "verseString": "Why don’t they contemplate the Quran? Had it been from anyone other than God, they would’ve found many discrepancies in it.",
            "verseStringReplacedWithAllah": "Why don’t they contemplate the Quran? Had it been from anyone other than Allah, they would’ve found many discrepancies in it."
        },
        {
            "verseNumber": 83,
            "verseString": "When news of security or fear reaches them, they broadcast it. But if they had referred it to the Messenger and those of authority among them, those who can draw correct conclusions would’ve understood it. Were it not for God’s grace and mercy upon you, you would’ve followed Satan, save a few.",
            "verseStringReplacedWithAllah": "When news of security or fear reaches them, they broadcast it. But if they had referred it to the Messenger and those of authority among them, those who can draw correct conclusions would’ve understood it. Were it not for Allah’s grace and mercy upon you, you would’ve followed Satan, save a few."
        },
        {
            "verseNumber": 84,
            "verseString": "So, fight in the path of God—you are accountable only for yourself—and rouse the believers. Perhaps God will restrain the might of the unbelievers. God is the strongest in enforcing punishment and the most severe in assault.",
            "verseStringReplacedWithAllah": "So, fight in the path of Allah—you are accountable only for yourself—and rouse the believers. Perhaps Allah will restrain the might of the unbelievers. Allah is the strongest in enforcing punishment and the most severe in assault."
        },
        {
            "verseNumber": 85,
            "verseString": "Whoever intercedes for good will have a share therein, and whoever intercedes for evil will bear a part of its burden. God oversees everything.",
            "verseStringReplacedWithAllah": "Whoever intercedes for good will have a share therein, and whoever intercedes for evil will bear a part of its burden. Allah oversees everything."
        },
        {
            "verseNumber": 86,
            "verseString": "When you are greeted, respond with a better greeting, or return it. God takes account of everything.",
            "verseStringReplacedWithAllah": "When you are greeted, respond with a better greeting, or return it. Allah takes account of everything."
        },
        {
            "verseNumber": 87,
            "verseString": "God—there is no deity but Him. He will gather you on Resurrection Day, about which there is no doubt. And who is more truthful than God in speech?",
            "verseStringReplacedWithAllah": "Allah—there is no deity but Him. He will gather you on Resurrection Day, about which there is no doubt. And who is more truthful than Allah in speech?"
        },
        {
            "verseNumber": 88,
            "verseString": "Why are you divided over the hypocrites, when God has cast them aside due to their deeds? Do you seek to guide those whom God has led astray? For those whom God misguides, you will find no way for them.",
            "verseStringReplacedWithAllah": "Why are you divided over the hypocrites, when Allah has cast them aside due to their deeds? Do you seek to guide those whom Allah has led astray? For those whom Allah misguides, you will find no way for them."
        },
        {
            "verseNumber": 89,
            "verseString": "They wish you to disbelieve as they disbelieve, so you become equal. So, take not from among them allies until they emigrate in God’s path. If they turn away, capture and execute them wherever you find them; and take no ally or helper from among them.",
            "verseStringReplacedWithAllah": "They wish you to disbelieve as they disbelieve, so you become equal. So, take not from among them allies until they emigrate in Allah’s path. If they turn away, capture and execute them wherever you find them; and take no ally or helper from among them."
        },
        {
            "verseNumber": 90,
            "verseString": "Except for those who take refuge with a people with whom you have a treaty, or those who come to you, their hearts unwilling to fight you or their people. Had God willed, He could’ve given them power over you, and they would’ve fought you. But if they withdraw from you, don’t fight you, and offer you peace, God gives you no grounds against them.",
            "verseStringReplacedWithAllah": "Except for those who take refuge with a people with whom you have a treaty, or those who come to you, their hearts unwilling to fight you or their people. Had Allah willed, He could’ve given them power over you, and they would’ve fought you. But if they withdraw from you, don’t fight you, and offer you peace, Allah gives you no grounds against them."
        },
        {
            "verseNumber": 91,
            "verseString": "You will find others who seek safety from you and their people. Yet, whenever they are returned to temptation, they fall into it. If they don’t withdraw from you, offer you peace, and restrain their hands, seize and kill them wherever you find them. Against these, We have given you a clear warrant."
        },
        {
            "verseNumber": 92,
            "verseString": "It’s not for a believer to kill a believer, except by mistake. Whoever kills a believer accidentally, the compensation is to free a believing captive and pay compensation to his family, unless they remit it as a charity. If he belonged to a people hostile to you, yet was a believer, the atonement is to free a believing captive. If he belonged to a people with whom you have a treaty, compensation must be paid to his family, and a believing captive must be freed. If one lacks the means, fasting for two consecutive months—is a penance from God. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "It’s not for a believer to kill a believer, except by mistake. Whoever kills a believer accidentally, the compensation is to free a believing captive and pay compensation to his family, unless they remit it as a charity. If he belonged to a people hostile to you, yet was a believer, the atonement is to free a believing captive. If he belonged to a people with whom you have a treaty, compensation must be paid to his family, and a believing captive must be freed. If one lacks the means, fasting for two consecutive months—is a penance from Allah. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 93,
            "verseString": "But whoever kills a believer intentionally, his recompense is Hell, where he will abide eternally. God’s wrath is upon him. He has cursed him and prepared for him a tremendous punishment.",
            "verseStringReplacedWithAllah": "But whoever kills a believer intentionally, his recompense is Hell, where he will abide eternally. Allah’s wrath is upon him. He has cursed him and prepared for him a tremendous punishment."
        },
        {
            "verseNumber": 94,
            "verseString": "O you who believe, when you set out in the cause of God, be discerning. And don’t say to one who greets you with peace, “You are not a believer,” pursuing the perishable goods of worldly life. You were like them before, until God bestowed His favor upon you. So, be discerning; God is always aware of what you do.",
            "verseStringReplacedWithAllah": "O you who believe, when you set out in the cause of Allah, be discerning. And don’t say to one who greets you with peace, “You are not a believer,” pursuing the perishable goods of worldly life. You were like them before, until Allah bestowed His favor upon you. So, be discerning; Allah is always aware of what you do."
        },
        {
            "verseNumber": 95,
            "verseString": "Those believers who sit idle, other than those with a disability, aren’t on par with those who strive in God’s path with their wealth and lives. God has given preference to the strivers with their wealth and lives over the inactive. Yet, to both, God promises good. However, God favors the strivers over the inactive, with a distinguished reward.",
            "verseStringReplacedWithAllah": "Those believers who sit idle, other than those with a disability, aren’t on par with those who strive in Allah’s path with their wealth and lives. Allah has given preference to the strivers with their wealth and lives over the inactive. Yet, to both, Allah promises good. However, Allah favors the strivers over the inactive, with a distinguished reward."
        },
        {
            "verseNumber": 96,
            "verseString": "Degrees of rank from Him, forgiveness, and mercy. God is Ever Forgiving, Most Merciful.",
            "verseStringReplacedWithAllah": "Degrees of rank from Him, forgiveness, and mercy. Allah is Ever Forgiving, Most Merciful."
        },
        {
            "verseNumber": 97,
            "verseString": "The angels will take the souls of those who died wronging themselves saying, “What was your condition?” They will reply, “We were oppressed in the land.” They will then say, “Wasn’t God’s earth vast enough for you to emigrate?” For such individuals, their dwelling will be Hell—a terrible destination.",
            "verseStringReplacedWithAllah": "The angels will take the souls of those who died wronging themselves saying, “What was your condition?” They will reply, “We were oppressed in the land.” They will then say, “Wasn’t Allah’s earth vast enough for you to emigrate?” For such individuals, their dwelling will be Hell—a terrible destination."
        },
        {
            "verseNumber": 98,
            "verseString": "Except for the oppressed among men, women, and children, who can’t devise a plan nor find a way."
        },
        {
            "verseNumber": 99,
            "verseString": "For these individuals, God may extend His forgiveness. God is Pardoning and Forgiving.",
            "verseStringReplacedWithAllah": "For these individuals, Allah may extend His forgiveness. Allah is Pardoning and Forgiving."
        },
        {
            "verseNumber": 100,
            "verseString": "Whoever emigrates for God’s cause will find many places of refuge and abundance on earth. Whoever leaves his home, migrating towards God and His Messenger, and then death overtakes him—God assures his reward. God is Ever Forgiving, Most Merciful.",
            "verseStringReplacedWithAllah": "Whoever emigrates for Allah’s cause will find many places of refuge and abundance on earth. Whoever leaves his home, migrating towards Allah and His Messenger, and then death overtakes him—Allah assures his reward. Allah is Ever Forgiving, Most Merciful."
        },
        {
            "verseNumber": 101,
            "verseString": "While traveling through the land, you are not at fault for shortening your prayers, particularly if you fear an attack from the unbelievers. The unbelievers are your clear adversaries."
        },
        {
            "verseNumber": 102,
            "verseString": "When you’re among them, leading them in prayer, let a group of them stand with you, armed. After they’ve prostrated, they should withdraw, allowing another group that has not yet prayed to come forward and pray with you. They should remain vigilant and keep their weapons ready. Those who disbelieve wish that you would neglect your weapons and your baggage, so they can launch a surprise attack. If rain or illness prevents you, there’s no blame upon you for setting aside your weapons. However, remain cautious. God has prepared a humiliating punishment for the unbelievers.",
            "verseStringReplacedWithAllah": "When you’re among them, leading them in prayer, let a group of them stand with you, armed. After they’ve prostrated, they should withdraw, allowing another group that has not yet prayed to come forward and pray with you. They should remain vigilant and keep their weapons ready. Those who disbelieve wish that you would neglect your weapons and your baggage, so they can launch a surprise attack. If rain or illness prevents you, there’s no blame upon you for setting aside your weapons. However, remain cautious. Allah has prepared a humiliating punishment for the unbelievers."
        },
        {
            "verseNumber": 103,
            "verseString": "Once the prayer is concluded, remember God while standing, sitting, or lying on your sides. When you are secure, establish the prayer. Prayer is a mandatory obligation for believers at prescribed times.",
            "verseStringReplacedWithAllah": "Once the prayer is concluded, remember Allah while standing, sitting, or lying on your sides. When you are secure, establish the prayer. Prayer is a mandatory obligation for believers at prescribed times."
        },
        {
            "verseNumber": 104,
            "verseString": "Don’t weaken in pursuit of the enemy. If you are suffering, they, too, are suffering. And you expect from God what they don’t expect. God is Knowing and Wise.",
            "verseStringReplacedWithAllah": "Don’t weaken in pursuit of the enemy. If you are suffering, they, too, are suffering. And you expect from Allah what they don’t expect. Allah is Knowing and Wise."
        },
        {
            "verseNumber": 105,
            "verseString": "We revealed the Scripture to you in truth, so that you may judge between people according to what God has shown you. Don’t be an advocate for the treacherous.",
            "verseStringReplacedWithAllah": "We revealed the Scripture to you in truth, so that you may judge between people according to what Allah has shown you. Don’t be an advocate for the treacherous."
        },
        {
            "verseNumber": 106,
            "verseString": "And ask God for forgiveness, for God is Ever Forgiving, Most Merciful.",
            "verseStringReplacedWithAllah": "And ask Allah for forgiveness, for Allah is Ever Forgiving, Most Merciful."
        },
        {
            "verseNumber": 107,
            "verseString": "And don’t argue for those who deceive themselves. God doesn’t love the deceitful sinner.",
            "verseStringReplacedWithAllah": "And don’t argue for those who deceive themselves. Allah doesn’t love the deceitful sinner."
        },
        {
            "verseNumber": 108,
            "verseString": "They may hide from people, but they can’t hide from God. He is with them when they plan at night with words He disapproves of. God encompasses all their actions.",
            "verseStringReplacedWithAllah": "They may hide from people, but they can’t hide from Allah. He is with them when they plan at night with words He disapproves of. Allah encompasses all their actions."
        },
        {
            "verseNumber": 109,
            "verseString": "Here you are, arguing on their behalf in this life, but who will argue on their behalf before God on Resurrection Day, or who will be their advocate?",
            "verseStringReplacedWithAllah": "Here you are, arguing on their behalf in this life, but who will argue on their behalf before Allah on Resurrection Day, or who will be their advocate?"
        },
        {
            "verseNumber": 110,
            "verseString": "Whoever commits a sin or wrongs himself, then seeks forgiveness from God, will find God Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "Whoever commits a sin or wrongs himself, then seeks forgiveness from Allah, will find Allah Forgiving and Merciful."
        },
        {
            "verseNumber": 111,
            "verseString": "Whoever earns a wrong earns it against himself. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "Whoever earns a wrong earns it against himself. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 112,
            "verseString": "Whoever commits wrongdoing or a sin, and then blames an innocent person, has taken on a slander and clear sin."
        },
        {
            "verseNumber": 113,
            "verseString": "If it wasn’t for God’s grace and mercy upon you, a group from among them would’ve attempted to mislead you. However, they only mislead themselves. And they won’t harm you at all. God revealed to you the Scripture and wisdom, and He taught you what you didn’t know. God’s grace upon you is immense.",
            "verseStringReplacedWithAllah": "If it wasn’t for Allah’s grace and mercy upon you, a group from among them would’ve attempted to mislead you. However, they only mislead themselves. And they won’t harm you at all. Allah revealed to you the Scripture and wisdom, and He taught you what you didn’t know. Allah’s grace upon you is immense."
        },
        {
            "verseNumber": 114,
            "verseString": "No good comes from much of their private conversations, except those who enjoin charity, kindness, or reconciliation among people. Whosoever does this seeking God’s approval, We will grant him a great reward.",
            "verseStringReplacedWithAllah": "No good comes from much of their private conversations, except those who enjoin charity, kindness, or reconciliation among people. Whosoever does this seeking Allah’s approval, We will grant him a great reward."
        },
        {
            "verseNumber": 115,
            "verseString": "Whoever opposes the Messenger, after the guidance has become clear to him, and follows a path other than that of the believers, We will leave him in the direction he has chosen and consign him to Hell—a dreadful destination."
        },
        {
            "verseNumber": 116,
            "verseString": "God doesn’t forgive the association of partners with Him, but He forgives anything less than that to whomever He wills. Whoever associates partners with God has strayed far off course.",
            "verseStringReplacedWithAllah": "Allah doesn’t forgive the association of partners with Him, but He forgives anything less than that to whomever He wills. Whoever associates partners with Allah has strayed far off course."
        },
        {
            "verseNumber": 117,
            "verseString": "They invoke, in His stead, only females. They invoke none other than a defiant devil."
        },
        {
            "verseNumber": 118,
            "verseString": "God has cursed him. He said, “I will take a portion of Your servants.”",
            "verseStringReplacedWithAllah": "Allah has cursed him. He said, “I will take a portion of Your servants.”"
        },
        {
            "verseNumber": 119,
            "verseString": "“I will mislead them, I will entice them, I will command them to slit the ears of cattle, I will command them and they will change the creation of God.” Whoever takes Satan as a friend instead of God has suffered an evident loss.",
            "verseStringReplacedWithAllah": "“I will mislead them, I will entice them, I will command them to slit the ears of cattle, I will command them and they will change the creation of Allah.” Whoever takes Satan as a friend instead of Allah has suffered an evident loss."
        },
        {
            "verseNumber": 120,
            "verseString": "Satan makes promises to them and arouses desires in them. But Satan promises them nothing but deceit."
        },
        {
            "verseNumber": 121,
            "verseString": "These are the ones whose place is Hell, and they will find no way to escape from it."
        },
        {
            "verseNumber": 122,
            "verseString": "However, those who believe and do righteous deeds, We will admit them into gardens through which rivers flow, where they will reside forever. This is God’s true promise, and who is truer in speech than God?",
            "verseStringReplacedWithAllah": "However, those who believe and do righteous deeds, We will admit them into gardens through which rivers flow, where they will reside forever. This is Allah’s true promise, and who is truer in speech than Allah?"
        },
        {
            "verseNumber": 123,
            "verseString": "It’s not according to your wishful thinking, nor the wishful thinking of the People of the Bible. Whoever does wrong will be paid for it, and will find no protector or helper against God.",
            "verseStringReplacedWithAllah": "It’s not according to your wishful thinking, nor the wishful thinking of the People of the Bible. Whoever does wrong will be paid for it, and will find no protector or helper against Allah."
        },
        {
            "verseNumber": 124,
            "verseString": "And whoever works righteousness, male or female, and is a believer—these will enter Paradise, and they won’t be wronged even as much as a speck."
        },
        {
            "verseNumber": 125,
            "verseString": "Who is better in religion than one who surrenders his whole being to God, acts virtuously, and follows the monotheistic creed of Abraham? God chose Abraham as a cherished friend.",
            "verseStringReplacedWithAllah": "Who is better in religion than one who surrenders his whole being to Allah, acts virtuously, and follows the monotheistic creed of Abraham? Allah chose Abraham as a cherished friend."
        },
        {
            "verseNumber": 126,
            "verseString": "Everything within the heavens and the earth belongs to God, and God encompasses all things.",
            "verseStringReplacedWithAllah": "Everything within the heavens and the earth belongs to Allah, and Allah encompasses all things."
        },
        {
            "verseNumber": 127,
            "verseString": "They ask you for a legal ruling concerning women. Say, “God gives you a legal ruling about them, as well as what was communicated to you in the Scripture concerning orphan girls whom you deny what’s prescribed for them and yet you wish to marry, and concerning the vulnerable among children. You are urged to treat orphans with fairness.” Whatever good you do, God is fully aware of it.",
            "verseStringReplacedWithAllah": "They ask you for a legal ruling concerning women. Say, “Allah gives you a legal ruling about them, as well as what was communicated to you in the Scripture concerning orphan girls whom you deny what’s prescribed for them and yet you wish to marry, and concerning the vulnerable among children. You are urged to treat orphans with fairness.” Whatever good you do, Allah is fully aware of it."
        },
        {
            "verseNumber": 128,
            "verseString": "If a woman fears ill-treatment or estrangement from her husband, there is no fault in them if they reconcile. Reconciliation is always preferable, yet human nature gravitates towards selfishness. If you behave with righteousness and reverence, God is Ever-Aware of what you do.",
            "verseStringReplacedWithAllah": "If a woman fears ill-treatment or estrangement from her husband, there is no fault in them if they reconcile. Reconciliation is always preferable, yet human nature gravitates towards selfishness. If you behave with righteousness and reverence, Allah is Ever-Aware of what you do."
        },
        {
            "verseNumber": 129,
            "verseString": "You will never be able to treat women with perfect fairness, no matter how sincere your intentions. Therefore, don’t incline excessively towards one and leave the other hanging. And if you act righteously and practice piety—God is ever Forgiving, Most Merciful.",
            "verseStringReplacedWithAllah": "You will never be able to treat women with perfect fairness, no matter how sincere your intentions. Therefore, don’t incline excessively towards one and leave the other hanging. And if you act righteously and practice piety—Allah is ever Forgiving, Most Merciful."
        },
        {
            "verseNumber": 130,
            "verseString": "If they do separate, God will suffice each from His bounty. God is All-Encompassing, All-Wise.",
            "verseStringReplacedWithAllah": "If they do separate, Allah will suffice each from His bounty. Allah is All-Encompassing, All-Wise."
        },
        {
            "verseNumber": 131,
            "verseString": "Everything in the heavens and on earth belongs to God. We’ve instructed those who were given the Scripture before you, and also you, to fear God. If you disbelieve, know that everything in the heavens and on earth belongs to God. God is Independent and Praiseworthy.",
            "verseStringReplacedWithAllah": "Everything in the heavens and on earth belongs to Allah. We’ve instructed those who were given the Scripture before you, and also you, to fear Allah. If you disbelieve, know that everything in the heavens and on earth belongs to Allah. Allah is Independent and Praiseworthy."
        },
        {
            "verseNumber": 132,
            "verseString": "Everything in the heavens and on earth is God’s, and God is enough to rely upon.",
            "verseStringReplacedWithAllah": "Everything in the heavens and on earth is Allah’s, and Allah is enough to rely upon."
        },
        {
            "verseNumber": 133,
            "verseString": "If He wills, He can eliminate you, O people, and bring about others. God has the power to do this.",
            "verseStringReplacedWithAllah": "If He wills, He can eliminate you, O people, and bring about others. Allah has the power to do this."
        },
        {
            "verseNumber": 134,
            "verseString": "Whoever desires the reward of this world—with God is the reward of the world and the Hereafter. God is All-Hearing, All-Seeing.",
            "verseStringReplacedWithAllah": "Whoever desires the reward of this world—with Allah is the reward of the world and the Hereafter. Allah is All-Hearing, All-Seeing."
        },
        {
            "verseNumber": 135,
            "verseString": "O you who believe, stand firmly for justice, as witnesses to God, even if against yourselves, or your parents, or your relatives. Whether one is rich or poor, God is more worthy of both. So, don’t follow personal inclination to avoid justice. If you distort or refuse—God is fully aware of what you do.",
            "verseStringReplacedWithAllah": "O you who believe, stand firmly for justice, as witnesses to Allah, even if against yourselves, or your parents, or your relatives. Whether one is rich or poor, Allah is more worthy of both. So, don’t follow personal inclination to avoid justice. If you distort or refuse—Allah is fully aware of what you do."
        },
        {
            "verseNumber": 136,
            "verseString": "O you who believe, believe in God and His Messenger, and the Scripture He revealed to His Messenger, and the Scripture He revealed before. Whoever denies God, His angels, His Scriptures, His messengers, and the Last Day, has strayed far away.",
            "verseStringReplacedWithAllah": "O you who believe, believe in Allah and His Messenger, and the Scripture He revealed to His Messenger, and the Scripture He revealed before. Whoever denies Allah, His angels, His Scriptures, His messengers, and the Last Day, has strayed far away."
        },
        {
            "verseNumber": 137,
            "verseString": "Those who believe, then disbelieve, then believe, then disbelieve and increase in disbelief—God will neither forgive them nor guide them on any path.",
            "verseStringReplacedWithAllah": "Those who believe, then disbelieve, then believe, then disbelieve and increase in disbelief—Allah will neither forgive them nor guide them on any path."
        },
        {
            "verseNumber": 138,
            "verseString": "Announce to the hypocrites that they will have a painful torment."
        },
        {
            "verseNumber": 139,
            "verseString": "Those who take unbelievers as allies instead of the believers. Do they seek with them honor and power? All honor and power belong to God alone.",
            "verseStringReplacedWithAllah": "Those who take unbelievers as allies instead of the believers. Do they seek with them honor and power? All honor and power belong to Allah alone."
        },
        {
            "verseNumber": 140,
            "verseString": "He revealed to you in the Scripture that when you hear God’s verses being denied and ridiculed, don’t sit with them until they change the topic, lest you become like them. God will gather the hypocrites and the unbelievers in Hell, all together.",
            "verseStringReplacedWithAllah": "He revealed to you in the Scripture that when you hear Allah’s verses being denied and ridiculed, don’t sit with them until they change the topic, lest you become like them. Allah will gather the hypocrites and the unbelievers in Hell, all together."
        },
        {
            "verseNumber": 141,
            "verseString": "Those who eagerly await your downfall: when God’s victory is granted to you, they question, “Were we not with you?” Yet, if the unbelievers have a moment of success, they ask, “Didn’t we stand by your side and protect you from the believers?” On the Day of Resurrection, God will judge between you. God won’t allow the unbelievers to triumph over the believers.",
            "verseStringReplacedWithAllah": "Those who eagerly await your downfall: when Allah’s victory is granted to you, they question, “Were we not with you?” Yet, if the unbelievers have a moment of success, they ask, “Didn’t we stand by your side and protect you from the believers?” On the Day of Resurrection, Allah will judge between you. Allah won’t allow the unbelievers to triumph over the believers."
        },
        {
            "verseNumber": 142,
            "verseString": "The hypocrites seek to deceive God, but He causes them to be deceived. When they rise for prayer, they do so lethargically, merely to be seen by others, and they barely remember God.",
            "verseStringReplacedWithAllah": "The hypocrites seek to deceive Allah, but He causes them to be deceived. When they rise for prayer, they do so lethargically, merely to be seen by others, and they barely remember Allah."
        },
        {
            "verseNumber": 143,
            "verseString": "They are indecisive, neither with these nor with those. You will find no path for those whom God leads astray.",
            "verseStringReplacedWithAllah": "They are indecisive, neither with these nor with those. You will find no path for those whom Allah leads astray."
        },
        {
            "verseNumber": 144,
            "verseString": "O you who believe, don’t favor unbelievers over believers. Do you wish to provide God with clear evidence against yourselves?",
            "verseStringReplacedWithAllah": "O you who believe, don’t favor unbelievers over believers. Do you wish to provide Allah with clear evidence against yourselves?"
        },
        {
            "verseNumber": 145,
            "verseString": "The hypocrites will be in the lowest depths of the Fire, and you will find no one to help them."
        },
        {
            "verseNumber": 146,
            "verseString": "Except for those who repent, reform their ways, firmly adhere, and sincerely dedicate their faith to God. These will be among the believers, and God will grant the believers a magnificent reward.",
            "verseStringReplacedWithAllah": "Except for those who repent, reform their ways, firmly adhere, and sincerely dedicate their faith to Allah. These will be among the believers, and Allah will grant the believers a magnificent reward."
        },
        {
            "verseNumber": 147,
            "verseString": "What would God do with your punishment if you are grateful and believe? And ever is God Appreciative and Knowing.",
            "verseStringReplacedWithAllah": "What would Allah do with your punishment if you are grateful and believe? And ever is Allah Appreciative and Knowing."
        },
        {
            "verseNumber": 148,
            "verseString": "God does not like the public mention of evil, except when someone has been wronged. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "Allah does not like the public mention of evil, except when someone has been wronged. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 149,
            "verseString": "Whether you publicly declare a good deed or hide it, or pardon an evil act—God is Pardoner and Competent.",
            "verseStringReplacedWithAllah": "Whether you publicly declare a good deed or hide it, or pardon an evil act—Allah is Pardoner and Competent."
        },
        {
            "verseNumber": 150,
            "verseString": "Those who deny God and His messengers, and wish to separate between God and His messengers, saying, “We believe in some and disbelieve in others,” and wish to adopt a way in between.",
            "verseStringReplacedWithAllah": "Those who deny Allah and His messengers, and wish to separate between Allah and His messengers, saying, “We believe in some and disbelieve in others,” and wish to adopt a way in between."
        },
        {
            "verseNumber": 151,
            "verseString": "These are the true disbelievers, and We prepared for the disbelievers a humiliating punishment."
        },
        {
            "verseNumber": 152,
            "verseString": "But those who believe in God and His messengers, and make no distinction between any of them, to them, We will grant their rewards. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "But those who believe in Allah and His messengers, and make no distinction between any of them, to them, We will grant their rewards. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 153,
            "verseString": "The People of the Scripture demand that you send down upon them a book from the heavens. They demanded even more of Moses, saying, “Show us God visibly.” A thunderbolt struck them for their audacity. Then, they worshiped the calf even after clear signs had come to them. Still, We forgave them. Furthermore, We granted Moses evident authority.",
            "verseStringReplacedWithAllah": "The People of the Scripture demand that you send down upon them a book from the heavens. They demanded even more of Moses, saying, “Show us Allah visibly.” A thunderbolt struck them for their audacity. Then, they worshiped the calf even after clear signs had come to them. Still, We forgave them. Furthermore, We granted Moses evident authority."
        },
        {
            "verseNumber": 154,
            "verseString": "We held the mountain over them as a testament to their covenant, and We commanded them, “Enter the gate humbly.” We also commanded: “Violate not the Sabbath”, and We took a solemn pledge from them."
        },
        {
            "verseNumber": 155,
            "verseString": "Yet, they broke their pledge, denied God’s revelations, unjustly killed the prophets, and said, “Our hearts are sealed.” God sealed them due to their disbelief, so they believe only a little.",
            "verseStringReplacedWithAllah": "Yet, they broke their pledge, denied Allah’s revelations, unjustly killed the prophets, and said, “Our hearts are sealed.” Allah sealed them due to their disbelief, so they believe only a little."
        },
        {
            "verseNumber": 156,
            "verseString": "They disbelieved and said a grave false charge against Mary."
        },
        {
            "verseNumber": 157,
            "verseString": "And they declared, “We killed the Messiah, Jesus, son of Mary, the Messenger of God.” Yet, in reality, they neither killed nor crucified him—but it was made to appear to them so. Those who argue this are full of doubts, lacking any definitive knowledge, and relying solely on conjecture. Certainly, they didn’t kill him.",
            "verseStringReplacedWithAllah": "And they declared, “We killed the Messiah, Jesus, son of Mary, the Messenger of Allah.” Yet, in reality, they neither killed nor crucified him—but it was made to appear to them so. Those who argue this are full of doubts, lacking any definitive knowledge, and relying solely on conjecture. Certainly, they didn’t kill him."
        },
        {
            "verseNumber": 158,
            "verseString": "Rather, God raised him up to Himself. God is Mighty and Wise.",
            "verseStringReplacedWithAllah": "Rather, Allah raised him up to Himself. Allah is Mighty and Wise."
        },
        {
            "verseNumber": 159,
            "verseString": "There are none of the People of the Scripture but will believe in him before his death, and on the Day of Resurrection, he will bear witness against them."
        },
        {
            "verseNumber": 160,
            "verseString": "For the wrongdoings of the Jews and their frequent straying from God’s path, We prohibited them from certain good things that were previously allowed.",
            "verseStringReplacedWithAllah": "For the wrongdoings of the Jews and their frequent straying from Allah’s path, We prohibited them from certain good things that were previously allowed."
        },
        {
            "verseNumber": 161,
            "verseString": "And for their taking of usury while they had been forbidden from it, and unjustly consuming people’s wealth. We prepared a severe punishment for those who persist in disbelief."
        },
        {
            "verseNumber": 162,
            "verseString": "But those firm in knowledge among them and the believers believe in what was revealed to you and what was revealed before you. Those who perform prayers, give charity and believe in God and the Last Day—upon them, We will bestow a great reward.",
            "verseStringReplacedWithAllah": "But those firm in knowledge among them and the believers believe in what was revealed to you and what was revealed before you. Those who perform prayers, give charity and believe in Allah and the Last Day—upon them, We will bestow a great reward."
        },
        {
            "verseNumber": 163,
            "verseString": "We revealed to you, as We revealed to Noah and the prophets after him. We also revealed to Abraham, Ishmael, Isaac, Jacob, the Tribes, Jesus, Job, Jonah, Aaron, and Solomon. And to David, We gave the Psalms."
        },
        {
            "verseNumber": 164,
            "verseString": "We’ve told you the stories of some messengers, while of others, We haven’t. God spoke directly to Moses.",
            "verseStringReplacedWithAllah": "We’ve told you the stories of some messengers, while of others, We haven’t. Allah spoke directly to Moses."
        },
        {
            "verseNumber": 165,
            "verseString": "Messengers as bearers of good news and warning, so that people would have no excuse before God after the messengers. God is All-Powerful, All-Wise.",
            "verseStringReplacedWithAllah": "Messengers as bearers of good news and warning, so that people would have no excuse before Allah after the messengers. Allah is All-Powerful, All-Wise."
        },
        {
            "verseNumber": 166,
            "verseString": "God Himself bears witness to what He revealed to you. He revealed it with His knowledge, and the angels also bear witness. Yet, God is sufficient as a Witness.",
            "verseStringReplacedWithAllah": "Allah Himself bears witness to what He revealed to you. He revealed it with His knowledge, and the angels also bear witness. Yet, Allah is sufficient as a Witness."
        },
        {
            "verseNumber": 167,
            "verseString": "Those who disbelieve and hinder others from God’s path have gone far astray.",
            "verseStringReplacedWithAllah": "Those who disbelieve and hinder others from Allah’s path have gone far astray."
        },
        {
            "verseNumber": 168,
            "verseString": "Those who disbelieve and commit wrong—God won’t forgive them, nor will He guide them to a path.",
            "verseStringReplacedWithAllah": "Those who disbelieve and commit wrong—Allah won’t forgive them, nor will He guide them to a path."
        },
        {
            "verseNumber": 169,
            "verseString": "Except the path of Hell, to abide therein forever. And that, for God, is always easy.",
            "verseStringReplacedWithAllah": "Except the path of Hell, to abide therein forever. And that, for Allah, is always easy."
        },
        {
            "verseNumber": 170,
            "verseString": "O people, the Messenger has come to you with the truth from your Lord, so believe; it is better for you. But if you disbelieve—to God belongs whatever is in the heavens and earth. God is Ever-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "O people, the Messenger has come to you with the truth from your Lord, so believe; it is better for you. But if you disbelieve—to Allah belongs whatever is in the heavens and earth. Allah is Ever-Knowing, All-Wise."
        },
        {
            "verseNumber": 171,
            "verseString": "O People of the Bible, don’t exaggerate in your religion, and say only the truth about God. Jesus Christ, the son of Mary, is the Messenger of God, His Word bestowed upon Mary, and a spirit of Him. So believe in God and His messengers, and don’t say, “Trinity.” Cease—it is better for you. God is but One God. Exalted is He—He is far above having a son. To Him belongs all that’s in the heavens and on earth, and God is enough as a Trustee.",
            "verseStringReplacedWithAllah": "O People of the Bible, don’t exaggerate in your religion, and say only the truth about Allah. Jesus Christ, the son of Mary, is the Messenger of Allah, His Word bestowed upon Mary, and a spirit of Him. So believe in Allah and His messengers, and don’t say, “Trinity.” Cease—it is better for you. Allah is but One God. Exalted is He—He is far above having a son. To Him belongs all that’s in the heavens and on earth, and Allah is enough as a Trustee."
        },
        {
            "verseNumber": 172,
            "verseString": "The Messiah would never disdain to be a servant of God, nor would the nearest angels. Whosoever disdains His worship and is arrogant, He will gather them all to Himself.",
            "verseStringReplacedWithAllah": "The Messiah would never disdain to be a servant of Allah, nor would the nearest angels. Whosoever disdains His worship and is arrogant, He will gather them all to Himself."
        },
        {
            "verseNumber": 173,
            "verseString": "Those who believe and perform righteous deeds—He will reward them in full and give them more from His grace. But those who disdain His worship and behave arrogantly, He will punish them with a severe punishment, and they won’t find for themselves any protector or helper apart from God.",
            "verseStringReplacedWithAllah": "Those who believe and perform righteous deeds—He will reward them in full and give them more from His grace. But those who disdain His worship and behave arrogantly, He will punish them with a severe punishment, and they won’t find for themselves any protector or helper apart from Allah."
        },
        {
            "verseNumber": 174,
            "verseString": "O people, a persuasive evidence has come to you from your Lord, and We sent down to you a clear light."
        },
        {
            "verseNumber": 175,
            "verseString": "Those who believe in God and hold firmly to Him, He will admit them into His mercy and favor, and He will guide them to Himself on a Straight Path.",
            "verseStringReplacedWithAllah": "Those who believe in Allah and hold firmly to Him, He will admit them into His mercy and favor, and He will guide them to Himself on a Straight Path."
        },
        {
            "verseNumber": 176,
            "verseString": "They seek a legal ruling from you. Say, “God gives you a legal ruling concerning those who die without heirs. If a person dies childless and has a sister, she inherits half of what he left behind. If she dies childless, he inherits from her. If there are two sisters, they receive two-thirds of what he left behind. If there are brothers and sisters, the male gets the share of two females.” God makes this clear for you, lest you go err. God is fully aware of everything.",
            "verseStringReplacedWithAllah": "They seek a legal ruling from you. Say, “Allah gives you a legal ruling concerning those who die without heirs. If a person dies childless and has a sister, she inherits half of what he left behind. If she dies childless, he inherits from her. If there are two sisters, they receive two-thirds of what he left behind. If there are brothers and sisters, the male gets the share of two females.” Allah makes this clear for you, lest you go err. Allah is fully aware of everything."
        }
    ],
    "chapterNumber": 4,
    "nameInEnglish": "Women",
    "nameInTransliteration": "An Nisa",
    "nameInArabic": "النساء",
    "numberOfVerses": 176
}