{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "O you who believe, don’t take as allies My enemies and yours, showing them affection, even though they have rejected the truth that has come to you. They expelled the Messenger and yourselves because you believe in God, your Lord. If you’ve set out to strive in My cause and to seek My approval, how can you secretly express affection to them? I know what you hide and what you reveal. Whoever among you does this has deviated from the right path.",
            "verseStringReplacedWithAllah": "O you who believe, don’t take as allies My enemies and yours, showing them affection, even though they have rejected the truth that has come to you. They expelled the Messenger and yourselves because you believe in Allah, your Lord. If you’ve set out to strive in My cause and to seek My approval, how can you secretly express affection to them? I know what you hide and what you reveal. Whoever among you does this has deviated from the right path."
        },
        {
            "verseNumber": 2,
            "verseString": "If they gain dominance over you, they become your adversaries, extend their hands and tongues against you with evil, desiring that you renounce your faith."
        },
        {
            "verseNumber": 3,
            "verseString": "On the Day of Resurrection, neither your relatives nor your offspring will benefit you. He will separate between you. And God sees your actions.",
            "verseStringReplacedWithAllah": "On the Day of Resurrection, neither your relatives nor your offspring will benefit you. He will separate between you. And Allah sees your actions."
        },
        {
            "verseNumber": 4,
            "verseString": "There has been a good example set for you by Abraham and those with him, when they said to their people, “We disassociate ourselves from you and from whatever you worship besides God. We renounce you. Enmity and hatred have surfaced between us and you, indefinitely, until you believe in God alone.” Except for Abraham’s promise to his father: “I will seek forgiveness for you, but I am powerless to protect you from God.” “Our Lord, in You we place our trust, and to You we turn in repentance, and to You is the destiny.",
            "verseStringReplacedWithAllah": "There has been a good example set for you by Abraham and those with him, when they said to their people, “We disassociate ourselves from you and from whatever you worship besides Allah. We renounce you. Enmity and hatred have surfaced between us and you, indefinitely, until you believe in Allah alone.” Except for Abraham’s promise to his father: “I will seek forgiveness for you, but I am powerless to protect you from Allah.” “Our Lord, in You we place our trust, and to You we turn in repentance, and to You is the destiny."
        },
        {
            "verseNumber": 5,
            "verseString": "Our Lord, don’t make us trial for the unbelievers, and forgive us. You are the Mighty and Wise.”"
        },
        {
            "verseNumber": 6,
            "verseString": "In them, there is an excellent example for those who hope for God and the Last Day. But whoever turns away—God is the Self-Sufficient, the Praiseworthy.",
            "verseStringReplacedWithAllah": "In them, there is an excellent example for those who hope for Allah and the Last Day. But whoever turns away—Allah is the Self-Sufficient, the Praiseworthy."
        },
        {
            "verseNumber": 7,
            "verseString": "Perhaps God will foster love between you and those you consider enemies. God is capable of everything, and God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "Perhaps Allah will foster love between you and those you consider enemies. Allah is capable of everything, and Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 8,
            "verseString": "God doesn’t prohibit you from being kind and just towards those who don’t fight you because of religion or expel you from your homes. God loves those who act justly.",
            "verseStringReplacedWithAllah": "Allah doesn’t prohibit you from being kind and just towards those who don’t fight you because of religion or expel you from your homes. Allah loves those who act justly."
        },
        {
            "verseNumber": 9,
            "verseString": "God only forbids you from those who fight you because of religion, expel you from your homes, or assist others in your expulsion. Whoever allies with them—these are the wrongdoers.",
            "verseStringReplacedWithAllah": "Allah only forbids you from those who fight you because of religion, expel you from your homes, or assist others in your expulsion. Whoever allies with them—these are the wrongdoers."
        },
        {
            "verseNumber": 10,
            "verseString": "O you who believe, when believing women come to you as refugees, test them. God is best aware of their faith. If you ascertain that they are believers, don’t send them back to the unbelievers. They are not lawful for them, nor are they lawful for them. Reimburse them for what they had spent. There is no fault in you if you marry them, provided you give them their dowries. Don’t maintain the marital ties with the unbelieving women; demand what you spent, and let them demand what they spent. This is God’s decree. He judges between you. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "O you who believe, when believing women come to you as refugees, test them. Allah is best aware of their faith. If you ascertain that they are believers, don’t send them back to the unbelievers. They are not lawful for them, nor are they lawful for them. Reimburse them for what they had spent. There is no fault in you if you marry them, provided you give them their dowries. Don’t maintain the marital ties with the unbelieving women; demand what you spent, and let them demand what they spent. This is Allah’s decree. He judges between you. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 11,
            "verseString": "If any of your wives leave you for the unbelievers, and you subsequently retaliate, then pay those whose wives have gone the equivalent of what they had spent. And be mindful of God, in whom you believe.",
            "verseStringReplacedWithAllah": "If any of your wives leave you for the unbelievers, and you subsequently retaliate, then pay those whose wives have gone the equivalent of what they had spent. And be mindful of Allah, in whom you believe."
        },
        {
            "verseNumber": 12,
            "verseString": "O Prophet, when believing women come to you, pledging allegiance to you, that they won’t associate anything with God, nor steal, nor commit adultery, nor kill their children, nor fabricate any falsehood, nor disobey you in what is right, then accept their pledge and ask forgiveness for them from God. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "O Prophet, when believing women come to you, pledging allegiance to you, that they won’t associate anything with Allah, nor steal, nor commit adultery, nor kill their children, nor fabricate any falsehood, nor disobey you in what is right, then accept their pledge and ask forgiveness for them from Allah. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 13,
            "verseString": "O you who believe, don’t befriend people with whom God has become angry. They have despaired of the Hereafter, just as the unbelievers have despaired of the occupants of the graves.",
            "verseStringReplacedWithAllah": "O you who believe, don’t befriend people with whom Allah has become angry. They have despaired of the Hereafter, just as the unbelievers have despaired of the occupants of the graves."
        }
    ],
    "chapterNumber": 60,
    "nameInEnglish": "She Tested",
    "nameInTransliteration": "Al Mumtahina",
    "nameInArabic": "الـمـمـتـحنة",
    "numberOfVerses": 13
}