{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif. Lam. Meem. Saad."
        },
        {
            "verseNumber": 2,
            "verseString": "A Scripture was revealed to you, so let there be no anxiety in your heart because of it. Use it to warn, and as a reminder for the believers."
        },
        {
            "verseNumber": 3,
            "verseString": "Follow what was revealed to you from your Lord, and don’t follow other masters beside Him. Yet, little do you remember."
        },
        {
            "verseNumber": 4,
            "verseString": "How many a town have We destroyed! Our might came upon them by night or while they were taking a midday nap."
        },
        {
            "verseNumber": 5,
            "verseString": "When Our wrath befell them, their only plea was, “Indeed, we were wrongdoers.”"
        },
        {
            "verseNumber": 6,
            "verseString": "We will question those to whom the messengers were sent, and We will question the messengers themselves."
        },
        {
            "verseNumber": 7,
            "verseString": "We will narrate their stories to them with knowledge, for We were not absent."
        },
        {
            "verseNumber": 8,
            "verseString": "On that Day, the weighing is the truth. Those whose scales are heavy will find success."
        },
        {
            "verseNumber": 9,
            "verseString": "However, those with light scales will have lost their souls, for they had denied Our signs."
        },
        {
            "verseNumber": 10,
            "verseString": "We established you on earth and provided for your sustenance and growth. Yet, seldom do you give thanks."
        },
        {
            "verseNumber": 11,
            "verseString": "We created you, then We fashioned you, then We said to the angels, “Prostrate yourselves before Adam.” They all prostrated, except Iblis, he was not of those who prostrated."
        },
        {
            "verseNumber": 12,
            "verseString": "He asked, “What prevented you from prostrating when I commanded you?” He replied, “I am superior to him; You created me from fire, but You created him from mud.”"
        },
        {
            "verseNumber": 13,
            "verseString": "He said, “Descend from this place; it’s not for you to be arrogant here! Get out, for you are disgraced!”"
        },
        {
            "verseNumber": 14,
            "verseString": "He pleaded, “Delay me until the Day they are resurrected.”"
        },
        {
            "verseNumber": 15,
            "verseString": "He replied, “You are granted a delay.”"
        },
        {
            "verseNumber": 16,
            "verseString": "He said, “Since You caused me to stray, I will sit in wait for them on Your straight path."
        },
        {
            "verseNumber": 17,
            "verseString": "Then, I will come at them from before them and from behind them, from their right and their left. And You won’t find most of them as thankful.”"
        },
        {
            "verseNumber": 18,
            "verseString": "He said, “Get out of it, despised and defeated. Whoever among them follows you—I will fill up Hell with you all."
        },
        {
            "verseNumber": 19,
            "verseString": "And you, Adam, reside with your wife in Paradise, and eat freely from wherever you wish; but don’t approach that tree, lest you become of the wrongdoers.”"
        },
        {
            "verseNumber": 20,
            "verseString": "Then Satan whispered to them, revealing their hidden nudity. He said, “Your Lord only forbade you this tree to prevent you from becoming angels or achieving immortality.”"
        },
        {
            "verseNumber": 21,
            "verseString": "And he swore to them, “I am truly a sincere advisor to you.”"
        },
        {
            "verseNumber": 22,
            "verseString": "Thus, he cunningly deceived them. And when they tasted the fruit of the tree, their nudity was exposed to them, and they started covering themselves with leaves from the Garden. Then their Lord called out to them, “Didn’t I prohibit you from that tree and warn you that Satan is your avowed enemy?”"
        },
        {
            "verseNumber": 23,
            "verseString": "They responded, “Our Lord, we have wronged ourselves. If You don’t forgive us and have mercy on us, we will be among the losers.”"
        },
        {
            "verseNumber": 24,
            "verseString": "He said, “Descend, with enmity among some of you. For you will have on the earth a settlement and enjoyment until a time.”"
        },
        {
            "verseNumber": 25,
            "verseString": "He added, “There, you will live; there, you will die, and from there, you will be resurrected.”"
        },
        {
            "verseNumber": 26,
            "verseString": "O Children of Adam, We provided you with clothing to cover your bodies and for fineries. But the clothing of piety—that is the best. These are among God’s verses, so they may take heed.",
            "verseStringReplacedWithAllah": "O Children of Adam, We provided you with clothing to cover your bodies and for fineries. But the clothing of piety—that is the best. These are among Allah’s verses, so they may take heed."
        },
        {
            "verseNumber": 27,
            "verseString": "O Children of Adam, let not Satan tempt you, as he expelled your parents from Paradise, stripping them of their clothing to show them their nudity. He and his type see you from where you don’t see them. We made the devils allies to those who don’t believe."
        },
        {
            "verseNumber": 28,
            "verseString": "When they commit an immoral act, they say, “We found our ancestors doing it, and God commanded us to do it.” Say, “God never commands immorality. Do you say about God what you don’t know?”",
            "verseStringReplacedWithAllah": "When they commit an immoral act, they say, “We found our ancestors doing it, and Allah commanded us to do it.” Say, “Allah never commands immorality. Do you say about Allah what you don’t know?”"
        },
        {
            "verseNumber": 29,
            "verseString": "Say, “My Lord commands justice. Set your faces towards every place of worship, and pray to Him, devoting your faith to Him alone. Just as He originated you, so will you return.”"
        },
        {
            "verseNumber": 30,
            "verseString": "Some He has guided, and some deserved to lose their way. They’ve taken the devils as allies instead of God, thinking they are guided.",
            "verseStringReplacedWithAllah": "Some He has guided, and some deserved to lose their way. They’ve taken the devils as allies instead of Allah, thinking they are guided."
        },
        {
            "verseNumber": 31,
            "verseString": "O Children of Adam, take your adornment at every place of prayer. Eat and drink, but don’t commit excesses, for He doesn’t like the extravagant."
        },
        {
            "verseNumber": 32,
            "verseString": "Say, “Who prohibited the beautiful things that God produced for His beings, and the wholesome sustenance?” Say, “They are for those who believe during their life in this world, exclusively for them on Resurrection Day.” Thus, We detail the verses for people who know.",
            "verseStringReplacedWithAllah": "Say, “Who prohibited the beautiful things that Allah produced for His beings, and the wholesome sustenance?” Say, “They are for those who believe during their life in this world, exclusively for them on Resurrection Day.” Thus, We detail the verses for people who know."
        },
        {
            "verseNumber": 33,
            "verseString": "Say, “My Lord forbids shameless acts, whether open or hidden, and sin, and oppression, and associating anything with God without His permission, and speaking about God without knowledge.”",
            "verseStringReplacedWithAllah": "Say, “My Lord forbids shameless acts, whether open or hidden, and sin, and oppression, and associating anything with Allah without His permission, and speaking about Allah without knowledge.”"
        },
        {
            "verseNumber": 34,
            "verseString": "Every nation has an appointed time. When their appointed time comes, they won’t be able to delay it by a single hour. nor will they be able to advance it."
        },
        {
            "verseNumber": 35,
            "verseString": "O Children of Adam, when messengers come to you from among you, conveying My messages to you, those who adhere to righteousness and reform will have no fear, nor will they grieve."
        },
        {
            "verseNumber": 36,
            "verseString": "But those who deny Our verses and treat them with arrogance are the residents of the Fire, where they will dwell forever."
        },
        {
            "verseNumber": 37,
            "verseString": "Who is more unjust than one who fabricates lies against God or denies His verses? These must have their share as decreed. Until Our messengers come to take their souls, they will ask, “Where are those you used to invoke besides God?” They will respond, “They have forsaken us.” And they will testify against themselves that they were unbelievers.",
            "verseStringReplacedWithAllah": "Who is more unjust than one who fabricates lies against Allah or denies His verses? These must have their share as decreed. Until Our messengers come to take their souls, they will ask, “Where are those you used to invoke besides Allah?” They will respond, “They have forsaken us.” And they will testify against themselves that they were unbelievers."
        },
        {
            "verseNumber": 38,
            "verseString": "He will say, “Enter among the communities of jinn and humans that have gone before you into the Fire.” Every time a community enters, it will curse its predecessor. Until, when they have all arrived therein, the last of them will say about the first, “Our Lord, these misled us, so give them a double punishment in the Fire.” He will say, “Each will receive a double, but you don’t know.”"
        },
        {
            "verseNumber": 39,
            "verseString": "The first of them will say to the last, “You have no advantage over us, so taste the punishment for what you used to earn.”"
        },
        {
            "verseNumber": 40,
            "verseString": "Those who denied our verses and were arrogant towards them—for them, the gates of Heaven won’t open, nor will they enter Paradise, until a camel can pass through the eye of a needle. Thus do We recompense the wrongdoers."
        },
        {
            "verseNumber": 41,
            "verseString": "For them will be beds in Hell, and from over them will be coverings. Thus do We recompense the wrongdoers."
        },
        {
            "verseNumber": 42,
            "verseString": "As for those who believe and live righteously—We don’t burden any soul beyond its scope—these are the inhabitants of Paradise, where they will reside forever."
        },
        {
            "verseNumber": 43,
            "verseString": "We will remove any ill feeling from their hearts, beneath them rivers will flow, and they will exclaim, “Praise be to God, who guided us to this. Had God not guided us, we wouldn’t have been guided. The messengers of our Lord truly brought the truth.” And they will be called, “This is the Paradise which you are made to inherit because of what you used to do.”",
            "verseStringReplacedWithAllah": "We will remove any ill feeling from their hearts, beneath them rivers will flow, and they will exclaim, “Praise be to Allah, who guided us to this. Had Allah not guided us, we wouldn’t have been guided. The messengers of our Lord truly brought the truth.” And they will be called, “This is the Paradise which you are made to inherit because of what you used to do.”"
        },
        {
            "verseNumber": 44,
            "verseString": "The inhabitants of Paradise will call out to the inhabitants of the Fire, “We found what our Lord promised us to be true; did you find your Lord’s promise to be true?” They will answer, “Yes.” An announcer between them will proclaim, “The curse of God is upon the wrongdoers.",
            "verseStringReplacedWithAllah": "The inhabitants of Paradise will call out to the inhabitants of the Fire, “We found what our Lord promised us to be true; did you find your Lord’s promise to be true?” They will answer, “Yes.” An announcer between them will proclaim, “The curse of Allah is upon the wrongdoers."
        },
        {
            "verseNumber": 45,
            "verseString": "Those who obstructed God’s path, sought to make it crooked, and denied the Hereafter.”",
            "verseStringReplacedWithAllah": "Those who obstructed Allah’s path, sought to make it crooked, and denied the Hereafter.”"
        },
        {
            "verseNumber": 46,
            "verseString": "Between them is a partition, and on the Heights are men who recognize everyone by their marks. They will call out to the residents of Paradise, “Peace be upon you.” They haven’t yet entered it, but they hope to."
        },
        {
            "verseNumber": 47,
            "verseString": "And when their gaze is directed towards the dwellers of the Fire, they will say, “Our Lord, don’t place us with the wrongdoers.”"
        },
        {
            "verseNumber": 48,
            "verseString": "The people on the Heights will call out to men they recognize by their features, saying, “Your hoardings availed you nothing, nor did your arrogance."
        },
        {
            "verseNumber": 49,
            "verseString": "Are these the ones you swore God would never touch with mercy?” “Enter Paradise; there is no fear for you, nor will you grieve.”",
            "verseStringReplacedWithAllah": "Are these the ones you swore Allah would never touch with mercy?” “Enter Paradise; there is no fear for you, nor will you grieve.”"
        },
        {
            "verseNumber": 50,
            "verseString": "The dwellers of the Fire will plead with the dwellers of Paradise, “Pour some water over us, or with some of what God has provided you with.” They will reply, “God prohibited them to the unbelievers.”",
            "verseStringReplacedWithAllah": "The dwellers of the Fire will plead with the dwellers of Paradise, “Pour some water over us, or with some of what Allah has provided you with.” They will reply, “Allah prohibited them to the unbelievers.”"
        },
        {
            "verseNumber": 51,
            "verseString": "Those who treated their religion as a pastime and amusement, and whom the worldly life deceived. Today, We will neglect them, as they neglected the meeting of this Day and denied Our signs."
        },
        {
            "verseNumber": 52,
            "verseString": "We provided them with a Scripture which We detailed with knowledge, a guide and mercy for those who believe."
        },
        {
            "verseNumber": 53,
            "verseString": "Are they merely waiting for its interpretation? The day its interpretation comes, those who had previously ignored it will say, “Indeed, the messengers of our Lord came with the truth. Do we have any intercessors who will intercede for us now? Or could we be sent back to behave differently?” They have lost their souls, and what they used to invent has failed them."
        },
        {
            "verseNumber": 54,
            "verseString": "Your Lord is God, who created the heavens and the earth in six periods, then He positioned Himself on the throne. He makes the night cover the day, which is in rapid pursuit of it. He made the sun, the moon, and the stars subservient; all are obedient to His command. Blessed is God, the Lord of all realms.",
            "verseStringReplacedWithAllah": "Your Lord is Allah, who created the heavens and the earth in six periods, then He positioned Himself on the throne. He makes the night cover the day, which is in rapid pursuit of it. He made the sun, the moon, and the stars subservient; all are obedient to His command. Blessed is Allah, the Lord of all realms."
        },
        {
            "verseNumber": 55,
            "verseString": "Call upon your Lord humbly and privately. He doesn’t love the transgressors."
        },
        {
            "verseNumber": 56,
            "verseString": "Don’t cause corruption on earth after its reformation. And call upon Him in fear and aspiration. The mercy of God is close to those who do good.",
            "verseStringReplacedWithAllah": "Don’t cause corruption on earth after its reformation. And call upon Him in fear and aspiration. The mercy of Allah is close to those who do good."
        },
        {
            "verseNumber": 57,
            "verseString": "It is He who sends the winds, heralding His mercy. When they carry heavy clouds, We drive them to a lifeless land, and then We release the rain, producing all kinds of fruits. Thus We will bring out the dead; perhaps you will reflect."
        },
        {
            "verseNumber": 58,
            "verseString": "Fertile land yields its produce by its Lord’s permission, while infertile land produces but little. Thus, We diversify the signs for those who are grateful."
        },
        {
            "verseNumber": 59,
            "verseString": "We sent Noah to his people, and he said, “O my people, worship God. You have no deity other than Him. I fear for you the punishment of a great day.”",
            "verseStringReplacedWithAllah": "We sent Noah to his people, and he said, “O my people, worship Allah. You have no deity other than Him. I fear for you the punishment of a great day.”"
        },
        {
            "verseNumber": 60,
            "verseString": "The chiefs of his people said, “We see you in manifest error.”"
        },
        {
            "verseNumber": 61,
            "verseString": "He said, “O my people, there is no error in me. Rather, I am a messenger from the Lord of the worlds."
        },
        {
            "verseNumber": 62,
            "verseString": "I convey to you my Lord’s messages, I offer you sincere advice, and I know from God what you don’t know.”",
            "verseStringReplacedWithAllah": "I convey to you my Lord’s messages, I offer you sincere advice, and I know from Allah what you don’t know.”"
        },
        {
            "verseNumber": 63,
            "verseString": "“Are you astonished that a reminder from your Lord has come to you through one of your own, to warn you and that you may guard yourselves, so that you may receive mercy?”"
        },
        {
            "verseNumber": 64,
            "verseString": "But they rejected him, so We saved him and those with him in the Ark, and We drowned those who denied Our revelations. They were blind people."
        },
        {
            "verseNumber": 65,
            "verseString": "To Aad, their brother Hud. He said, “O my people, worship God; You have no other god besides Him. Won’t you then be righteous?”",
            "verseStringReplacedWithAllah": "To Aad, their brother Hud. He said, “O my people, worship Allah; You have no other god besides Him. Won’t you then be righteous?”"
        },
        {
            "verseNumber": 66,
            "verseString": "The disbelieving leaders of his people responded, “We see you as foolish, and we think you’re a liar.”"
        },
        {
            "verseNumber": 67,
            "verseString": "He replied, “O my people, I am not foolish; I am a messenger from the Lord of the worlds."
        },
        {
            "verseNumber": 68,
            "verseString": "“I convey to you the messages of my Lord, and I am a reliable counselor for you.”"
        },
        {
            "verseNumber": 69,
            "verseString": "“Do you find it strange that a message from your Lord has come to you through a man from amongst you, to warn you? Remember, He made you successors after Noah’s people and increased your stature. Remember God’s blessings, so you may thrive.”",
            "verseStringReplacedWithAllah": "“Do you find it strange that a message from your Lord has come to you through a man from amongst you, to warn you? Remember, He made you successors after Noah’s people and increased your stature. Remember Allah’s blessings, so you may thrive.”"
        },
        {
            "verseNumber": 70,
            "verseString": "They replied, “Did you come to us to make us worship God alone and give up what our fathers worshiped? If you are truthful, bring us what you threaten us with.”",
            "verseStringReplacedWithAllah": "They replied, “Did you come to us to make us worship Allah alone and give up what our fathers worshiped? If you are truthful, bring us what you threaten us with.”"
        },
        {
            "verseNumber": 71,
            "verseString": "He replied, “Condemnation and wrath from your Lord have befallen you. Are you arguing with me over names you and your ancestors invented that God didn’t authorize? So wait, and I will wait with you.”",
            "verseStringReplacedWithAllah": "He replied, “Condemnation and wrath from your Lord have befallen you. Are you arguing with me over names you and your ancestors invented that Allah didn’t authorize? So wait, and I will wait with you.”"
        },
        {
            "verseNumber": 72,
            "verseString": "We saved him and those with him by a mercy from Us, and We obliterated those who denied Our signs and were not believers."
        },
        {
            "verseNumber": 73,
            "verseString": "To Thamud, their brother Saleh. He pleaded, “O my people, worship God; You have no other god besides Him. A clear sign has come to you from your Lord: this she-camel of God is a sign for you. Let her graze on God’s earth, and don’t harm her, lest a severe punishment befalls you.”",
            "verseStringReplacedWithAllah": "To Thamud, their brother Saleh. He pleaded, “O my people, worship Allah; You have no other god besides Him. A clear sign has come to you from your Lord: this she-camel of Allah is a sign for you. Let her graze on Allah’s earth, and don’t harm her, lest a severe punishment befalls you.”"
        },
        {
            "verseNumber": 74,
            "verseString": "“Remember, He made you successors after Aad, and He established you in the land. You construct palaces on its plains and carve out homes in the mountains. Remember God’s blessings, and don’t cause corruption in the land.”",
            "verseStringReplacedWithAllah": "“Remember, He made you successors after Aad, and He established you in the land. You construct palaces on its plains and carve out homes in the mountains. Remember Allah’s blessings, and don’t cause corruption in the land.”"
        },
        {
            "verseNumber": 75,
            "verseString": "The arrogant leaders among his people said to those oppressed who believed, “Do you believe that Saleh is sent by his Lord?” They replied, “Yes, we believe in the message he brought.”"
        },
        {
            "verseNumber": 76,
            "verseString": "The arrogant ones replied, “We reject what you’ve believed in.”"
        },
        {
            "verseNumber": 77,
            "verseString": "So, they hamstrung the she-camel, brazenly defying their Lord’s command, and said, “O Saleh, bring upon us what you threaten us with, if you are one of the messengers.”"
        },
        {
            "verseNumber": 78,
            "verseString": "So the earthquake seized them, leaving them lifeless in their homes."
        },
        {
            "verseNumber": 79,
            "verseString": "So he turned away from them, saying, “O my people, I have delivered my Lord’s message to you, and I advised you sincerely, but you don’t appreciate advisers.”"
        },
        {
            "verseNumber": 80,
            "verseString": "And Lot told his people, “You commit an immorality no one in the world has ever perpetrated before.”"
        },
        {
            "verseNumber": 81,
            "verseString": "“You lust after men instead of women. Indeed, you are a people of excess.”"
        },
        {
            "verseNumber": 82,
            "verseString": "His people responded, “Expel them from your village; they are purist people.”"
        },
        {
            "verseNumber": 83,
            "verseString": "So, We saved him and his family, except for his wife; she was one of those who lingered behind."
        },
        {
            "verseNumber": 84,
            "verseString": "And We rained upon them a downpour. Consider the fate of those who committed wrongdoings."
        },
        {
            "verseNumber": 85,
            "verseString": "To Midian, their brother Shuaib. He said, “O my people, worship God; you have no other god but Him. Clear proof has come to you from your Lord. Maintain just measures and weights, do not devalue people’s goods, and don’t spread corruption on earth after it was set right. This is better for you, if only you are believers.”",
            "verseStringReplacedWithAllah": "To Midian, their brother Shuaib. He said, “O my people, worship Allah; you have no other god but Him. Clear proof has come to you from your Lord. Maintain just measures and weights, do not devalue people’s goods, and don’t spread corruption on earth after it was set right. This is better for you, if only you are believers.”"
        },
        {
            "verseNumber": 86,
            "verseString": "“Don’t sit on every trail, intimidating and hindering from the path of God those who believe in Him, seeking to make it crooked. Remember when you were few, and He multiplied you. And consider the fate of the wrongdoers.”",
            "verseStringReplacedWithAllah": "“Don’t sit on every trail, intimidating and hindering from the path of Allah those who believe in Him, seeking to make it crooked. Remember when you were few, and He multiplied you. And consider the fate of the wrongdoers.”"
        },
        {
            "verseNumber": 87,
            "verseString": "“Given that some of you have believed in what I was sent with, and some haven’t, be patient until God renders His judgment between us. He is the best of judges.”",
            "verseStringReplacedWithAllah": "“Given that some of you have believed in what I was sent with, and some haven’t, be patient until Allah renders His judgment between us. He is the best of judges.”"
        },
        {
            "verseNumber": 88,
            "verseString": "The arrogant leaders from his community declared, “O Shuaib, we will expel you and those who believed with you from our town, unless you return to our religion.” He responded, “Even against our will?”"
        },
        {
            "verseNumber": 89,
            "verseString": "“We would be fabricating a lie against God if we returned to your religion after God has rescued us from it. It’s not for us to return to it unless God, our Lord, permits. Our Lord encompasses everything in His knowledge. In God, we’ve placed our trust. Our Lord, decide between us and our people in truth, for You are the best decision maker.”",
            "verseStringReplacedWithAllah": "“We would be fabricating a lie against Allah if we returned to your religion after Allah has rescued us from it. It’s not for us to return to it unless Allah, our Lord, permits. Our Lord encompasses everything in His knowledge. In Allah, we’ve placed our trust. Our Lord, decide between us and our people in truth, for You are the best decision maker.”"
        },
        {
            "verseNumber": 90,
            "verseString": "The disbelieving elites among his people said, “If you follow Shuaib, you will surely be among the losers.”"
        },
        {
            "verseNumber": 91,
            "verseString": "A tremor overtook them, and they lay lifeless in their homes."
        },
        {
            "verseNumber": 92,
            "verseString": "Those who denied Shuaib—it is as though they had never thrived there. Those who denied Shuaib—they were the losers."
        },
        {
            "verseNumber": 93,
            "verseString": "Then he turned away from them and said, “O my people, I have conveyed to you my Lord’s messages, and I have advised you. So, How could I grieve for a people who reject faith?”"
        },
        {
            "verseNumber": 94,
            "verseString": "Whenever We sent a prophet to a city, We tested its people with adversity and hardship so that they might turn in humility."
        },
        {
            "verseNumber": 95,
            "verseString": "Then, We replaced their hardship with ease until they multiplied and said, “Our ancestors, too, experienced hardship and ease.” Suddenly, We seized them unawares."
        },
        {
            "verseNumber": 96,
            "verseString": "Had the residents of the towns believed and been righteous, We would’ve opened upon them blessings from the sky and the earth. But they denied the truth, so We seized them on account of their misdeeds."
        },
        {
            "verseNumber": 97,
            "verseString": "Are the people of the towns feeling secure from Our punishment coming upon them suddenly at night while they sleep?"
        },
        {
            "verseNumber": 98,
            "verseString": "Are the townsfolk carefree that Our punishment won’t come to them in the daytime while they play?"
        },
        {
            "verseNumber": 99,
            "verseString": "Do they feel safe from God’s scheme? None feel secure from God’s scheme except the losers.",
            "verseStringReplacedWithAllah": "Do they feel safe from Allah’s scheme? None feel secure from Allah’s scheme except the losers."
        },
        {
            "verseNumber": 100,
            "verseString": "Doesn’t it guide those who inherit the earth after its inhabitants, that if We wish, We could afflict them because of their sins and seal their hearts, so they would not hear?"
        },
        {
            "verseNumber": 101,
            "verseString": "These are the towns; We tell you their stories. Their messengers came to them with evident signs, but they would not believe in what they had already rejected. Thus, God seals the hearts of the unbelievers.",
            "verseStringReplacedWithAllah": "These are the towns; We tell you their stories. Their messengers came to them with evident signs, but they would not believe in what they had already rejected. Thus, Allah seals the hearts of the unbelievers."
        },
        {
            "verseNumber": 102,
            "verseString": "We found most of them not true to their commitments; We found most of them sinful."
        },
        {
            "verseNumber": 103,
            "verseString": "Then, after them, We sent Moses with Our signs to Pharaoh and his establishment, but they were unjust toward them. See, then, how was the end of the corrupters."
        },
        {
            "verseNumber": 104,
            "verseString": "Moses said, “O Pharaoh, I am a messenger from the Lord of the worlds.”"
        },
        {
            "verseNumber": 105,
            "verseString": "“Rightly so, I can’t say anything other than the truth about God. I’ve come to you with clear proof from your Lord, so release the Children of Israel with me.”",
            "verseStringReplacedWithAllah": "“Rightly so, I can’t say anything other than the truth about Allah. I’ve come to you with clear proof from your Lord, so release the Children of Israel with me.”"
        },
        {
            "verseNumber": 106,
            "verseString": "He responded, “If you have a miracle, then present it, if you are truthful.”"
        },
        {
            "verseNumber": 107,
            "verseString": "So, he threw down his staff, and behold, it turned into a conspicuous serpent."
        },
        {
            "verseNumber": 108,
            "verseString": "And he exposed his hand, and suddenly, it was white for all to see."
        },
        {
            "verseNumber": 109,
            "verseString": "Pharaoh’s council exclaimed, “This man is a skilled magician!”"
        },
        {
            "verseNumber": 110,
            "verseString": "“He intends to expel you from your land; what, then, do you command?”"
        },
        {
            "verseNumber": 111,
            "verseString": "They proposed, “Put off him and his brother for some time, and send envoys to the cities.”"
        },
        {
            "verseNumber": 112,
            "verseString": "“To gather and bring to you every accomplished magician.”"
        },
        {
            "verseNumber": 113,
            "verseString": "So, the magicians arrived at Pharaoh’s presence, and they inquired, “Will we be rewarded if we triumph?”"
        },
        {
            "verseNumber": 114,
            "verseString": "He answered, “Yes, and you will be among the ones closest to me.”"
        },
        {
            "verseNumber": 115,
            "verseString": "They asked, “O Moses, should you throw first, or should we?”"
        },
        {
            "verseNumber": 116,
            "verseString": "He replied, “You throw.” And when they performed their enchantment, they cast a spell upon the people’s eyes, struck fear in their hearts, and exhibited a magnificent spectacle of sorcery."
        },
        {
            "verseNumber": 117,
            "verseString": "Then, We revealed to Moses, “Throw down your staff.” And suddenly, it swallowed the illusions they had fabricated."
        },
        {
            "verseNumber": 118,
            "verseString": "So, the truth was established, and what they were doing became null."
        },
        {
            "verseNumber": 119,
            "verseString": "They were defeated there and then, and were utterly humiliated."
        },
        {
            "verseNumber": 120,
            "verseString": "The magicians fell prostrate."
        },
        {
            "verseNumber": 121,
            "verseString": "They proclaimed, “We have believed in the Lord of the worlds."
        },
        {
            "verseNumber": 122,
            "verseString": "The Lord of Moses and Aaron.”"
        },
        {
            "verseNumber": 123,
            "verseString": "Pharaoh said, “You dare to believe in him before I give you permission? You hatched this plot in the city to expel its inhabitants. But you will soon know.”"
        },
        {
            "verseNumber": 124,
            "verseString": "“I will sever your hands and feet on opposite sides; then I will crucify you all.”"
        },
        {
            "verseNumber": 125,
            "verseString": "They responded, “Indeed, to our Lord we will return.”"
        },
        {
            "verseNumber": 126,
            "verseString": "“You are penalizing us merely because we believed in our Lord’s signs when they came to us.” “Our Lord, pour upon us patience and receive our souls in submission.”"
        },
        {
            "verseNumber": 127,
            "verseString": "The elite among Pharaoh’s people questioned, “Will you let Moses and his people cause disorder in the land and forsake you and your gods?” He replied, “We will kill their sons and spare their women; we have absolute power over them.”"
        },
        {
            "verseNumber": 128,
            "verseString": "Moses said to his people, “Seek help from God and be patient. The earth belongs to God; He grants it to whomever He wills among His servants. And the end is for the righteous.”",
            "verseStringReplacedWithAllah": "Moses said to his people, “Seek help from Allah and be patient. The earth belongs to Allah; He grants it to whomever He wills among His servants. And the end is for the righteous.”"
        },
        {
            "verseNumber": 129,
            "verseString": "They replied, “We were oppressed before you came to us and after you arrived.” He replied, “Perhaps your Lord will destroy your enemy and make you inherit the land, then He will observe how you conduct yourselves.”"
        },
        {
            "verseNumber": 130,
            "verseString": "We afflicted Pharaoh’s people with drought and crop failure so they might take heed."
        },
        {
            "verseNumber": 131,
            "verseString": "Whenever good fortune came their way, they would say, “This is our due.” But when adversity struck them, they attributed it to an ill omen of Moses and those with him. Surely, their misfortune was ordained by God, but most of them know not.",
            "verseStringReplacedWithAllah": "Whenever good fortune came their way, they would say, “This is our due.” But when adversity struck them, they attributed it to an ill omen of Moses and those with him. Surely, their misfortune was ordained by Allah, but most of them know not."
        },
        {
            "verseNumber": 132,
            "verseString": "They said, “Whatever sign you bring to fascinate us, we won’t believe in you.”"
        },
        {
            "verseNumber": 133,
            "verseString": "So, We unleashed upon them the flood, locusts, lice, frogs, and blood—all detailed signs. Yet they persisted in arrogance; they were a sinful people."
        },
        {
            "verseNumber": 134,
            "verseString": "Whenever a calamity struck them, they would plead, “O Moses, pray to your Lord for us, under His promise to you. If you lift this affliction from us, we will believe in you and let the Children of Israel go with you.”"
        },
        {
            "verseNumber": 135,
            "verseString": "Yet when We removed from them the plague until a term which they should reach, they broke their promise."
        },
        {
            "verseNumber": 136,
            "verseString": "As a result, We exacted retribution from them and drowned them in the sea, for they denied Our signs and paid them no heed."
        },
        {
            "verseNumber": 137,
            "verseString": "We granted the oppressed the inheritance of the Eastern and Western parts of land We had blessed. Thus, the benevolent promise of your Lord to the Children of Israel was fulfilled, in recognition of their patience. And we destroyed what Pharaoh and his people were constructing and what they were establishing."
        },
        {
            "verseNumber": 138,
            "verseString": "We led the Children of Israel across the sea. Upon encountering a people kneeling before their idols, they said, “O Moses, make a god for us, as they have gods.” He responded, “You are truly an ignorant people.”"
        },
        {
            "verseNumber": 139,
            "verseString": "“These people are doomed for their destruction, and what they do is futile.”"
        },
        {
            "verseNumber": 140,
            "verseString": "He said, “Would I seek for you a god other than God, while He has preferred you over the worlds?”",
            "verseStringReplacedWithAllah": "He said, “Would I seek for you a god other than Allah, while He has preferred you over the worlds?”"
        },
        {
            "verseNumber": 141,
            "verseString": "And remember when We rescued you from Pharaoh’s people, who subjected you to the harshest torment, killing your sons and sparing your women. That was a severe trial from your Lord."
        },
        {
            "verseNumber": 142,
            "verseString": "We set a meeting with Moses for thirty nights, which We completed with another ten; so the term of his Lord was completed in forty nights. Moses instructed his brother Aaron, “Take my place among my people, act rightly, and don’t follow the way of the mischief-makers.”"
        },
        {
            "verseNumber": 143,
            "verseString": "When Moses arrived for Our appointment, and his Lord spoke to him, he pleaded, “My Lord, allow me to see You.” He replied, “You won’t see Me, but look at the mountain; if it remains in its place, you’ll see Me.” When his Lord revealed His glory to the mountain, He made it crumble to dust, and Moses fell down fainting. Upon regaining consciousness, he exclaimed, “Glory be to You, I turn to You in repentance, I am the first of the believers.”"
        },
        {
            "verseNumber": 144,
            "verseString": "He said, “O Moses, I have chosen you over people by My Messages and My speech. Therefore, take what I’ve given you, and be among the grateful.”"
        },
        {
            "verseNumber": 145,
            "verseString": "We inscribed for him on the Tablets comprehensive instructions and detailed explanation for everything. “Adhere to them, and instruct your people to uphold the best of them. I will show you the dwelling of the wicked.”"
        },
        {
            "verseNumber": 146,
            "verseString": "I will divert from My signs those who behave arrogantly without right on Earth. Even if they witness every sign, they won’t believe in it. If they see the path of righteousness, they won’t adopt it. But if they see the path of error, they will embrace it. This is because they denied Our signs and remained heedless of them."
        },
        {
            "verseNumber": 147,
            "verseString": "Those who deny Our revelations and the meeting in the Hereafter—their deeds will come to nothing. Won’t they be repaid for what they’ve done?"
        },
        {
            "verseNumber": 148,
            "verseString": "In Moses’ absence, his people fabricated a calf from their jewelry—a body that emitted a mooing sound. Couldn’t they see that it could neither speak to them nor guide them on a path? They took it as an object of worship and were in the wrong."
        },
        {
            "verseNumber": 149,
            "verseString": "And when regret overcame them and saw that they were astray, they lamented, “Unless our Lord bestows His mercy upon us and forgives us, we will surely be among the losers.”"
        },
        {
            "verseNumber": 150,
            "verseString": "When Moses returned to his people, angered and grieved, he exclaimed, “What a terrible thing you did in my absence! Were you so eager to defy your Lord’s commands?” He threw down the Tablets and seized his brother by the head, dragging him towards himself. He said, “Son of my mother, the people took advantage of my weaknesses and almost killed me. Don’t let the enemies gloat over me, and don’t count me among the wrongdoing people.”"
        },
        {
            "verseNumber": 151,
            "verseString": "He prayed, “My Lord, forgive me and my brother, and in Your mercy, admit me and my brother, for You are the most merciful of the merciful.”"
        },
        {
            "verseNumber": 152,
            "verseString": "Those who idolized the calf incurred wrath from their Lord, and humiliation in this life. Thus do We recompense the inventors of lies."
        },
        {
            "verseNumber": 153,
            "verseString": "But those who commit misdeeds and then repent and believe—Surely your Lord, after this, is Forgiving, Merciful."
        },
        {
            "verseNumber": 154,
            "verseString": "When Moses’ anger had subsided, he picked up the Tablets; within their engraving was guidance and mercy for those who fear their Lord."
        },
        {
            "verseNumber": 155,
            "verseString": "Moses selected seventy men from his people for Our appointed meeting. When the tremor seized them, he said, “My Lord, if You had willed, You could’ve destroyed them—and me—before. Will You destroy us for the deeds of the foolish among us? This is but Your test, by which You lead astray whom You will and guide whom You will. You are our Protector, so forgive us and have mercy on us. You are the Best of those who forgive."
        },
        {
            "verseNumber": 156,
            "verseString": "Therefore, prescribe for us good in this world and in the Hereafter. We have turned to You.” He replied, “My punishment—I afflict with it whom I wish, but My mercy encompasses all things. I will specify it for those who conduct themselves righteously, give charity, and believe in Our revelations.”"
        },
        {
            "verseNumber": 157,
            "verseString": "Those who follow the Messenger, the illiterate prophet, whom they find referenced in their own Torah and Gospel—he guides them towards righteousness, forbids them from evil, permits for them all good things, forbids them from all impure things, and removes from them their burdens and the shackles that had bound them. Those who believe in him, honor him, assist him, and follow the light that was sent down with him—these are the ones who will succeed."
        },
        {
            "verseNumber": 158,
            "verseString": "Say, “O people, I am God’s Messenger to you all—to whom belongs the dominion of the heavens and the earth. There is no deity except Him; He gives life and causes death.” So, believe in God and His Messenger, the Gentile Prophet, who believes in God and His words. Follow him, so that you may be guided.",
            "verseStringReplacedWithAllah": "Say, “O people, I am Allah’s Messenger to you all—to whom belongs the dominion of the heavens and the earth. There is no deity except Him; He gives life and causes death.” So, believe in Allah and His Messenger, the Gentile Prophet, who believes in Allah and His words. Follow him, so that you may be guided."
        },
        {
            "verseNumber": 159,
            "verseString": "Among the people of Moses, a community exists that guides with truth and by which they establish justice."
        },
        {
            "verseNumber": 160,
            "verseString": "We divided them into twelve tribes, distinct nations. When his people asked Moses for water, We instructed, “Strike the rock with your staff.” From it, twelve springs gushed forth; each tribe recognized its designated drinking place. We shaded them with clouds and sent down upon them manna and quails: “Eat from the good things We provided you.” They didn’t wrong Us, but they wronged themselves."
        },
        {
            "verseNumber": 161,
            "verseString": "They were instructed, “Settle in this town, eat from it wherever you wish, say, ‘Relinquish,’ and enter the gate humbly; We will forgive your sins and enhance the reward for the doers of good.”"
        },
        {
            "verseNumber": 162,
            "verseString": "But the wrongdoers among them changed the words they were given to something different, so We sent down upon them a punishment from the sky due to their wrongdoing."
        },
        {
            "verseNumber": 163,
            "verseString": "Ask them about the town by the sea, where they violated the Sabbath. Fish would surface in abundance on their Sabbath days, but not on the days they didn’t observe the Sabbath. We tested them in this manner due to their defiance."
        },
        {
            "verseNumber": 164,
            "verseString": "Some of them questioned, “Why do you preach to people whom God is about to destroy or punish severely?” They replied, “To have an excuse before your Lord, and perhaps they may become righteous.”",
            "verseStringReplacedWithAllah": "Some of them questioned, “Why do you preach to people whom Allah is about to destroy or punish severely?” They replied, “To have an excuse before your Lord, and perhaps they may become righteous.”"
        },
        {
            "verseNumber": 165,
            "verseString": "So, when they forgot what they had been reminded of, We saved those who prohibited wrong, and We seized those who did wrong with a severe punishment because they were transgressors."
        },
        {
            "verseNumber": 166,
            "verseString": "And when they continued disregarding the reminders, We said to them, “Be despicable apes.”"
        },
        {
            "verseNumber": 167,
            "verseString": "Your Lord declared that He would send against them, until the Day of Resurrection, those who will inflict terrible suffering on them. Your Lord is swift in penalty; but He is also Forgiving, Most Merciful."
        },
        {
            "verseNumber": 168,
            "verseString": "We dispersed them into communities throughout the earth. Some of them are righteous, while some are less so. We tested them with both good and bad circumstances, so they might return."
        },
        {
            "verseNumber": 169,
            "verseString": "After them, succeeded generations who inherited the Scripture, they chose the fleeting pleasures of this world, saying, “We will be forgiven.” And if similar pleasures came their way, they would again seize them. Weren’t they bound by a covenant to uphold the Scripture and to speak nothing but the truth about God? Didn’t they study what was in it? The home of the Hereafter is better for the righteous. Don’t you understand?",
            "verseStringReplacedWithAllah": "After them, succeeded generations who inherited the Scripture, they chose the fleeting pleasures of this world, saying, “We will be forgiven.” And if similar pleasures came their way, they would again seize them. Weren’t they bound by a covenant to uphold the Scripture and to speak nothing but the truth about Allah? Didn’t they study what was in it? The home of the Hereafter is better for the righteous. Don’t you understand?"
        },
        {
            "verseNumber": 170,
            "verseString": "Those who adhere to the Scripture and perform prayers—We won’t let the reward of the reformers be lost."
        },
        {
            "verseNumber": 171,
            "verseString": "We held the mountain over them like a canopy, and they feared it would fall upon them. “Hold firmly to what We’ve given you, and remember what’s in it, so you may be protected.”"
        },
        {
            "verseNumber": 172,
            "verseString": "And when your Lord took out from the children of Adam—from their loins—their descendants and made them testify of themselves: “Am I not your Lord?” They responded, “Yes, we testify.” Lest you should say on the Resurrection Day, “We were unaware of this.”"
        },
        {
            "verseNumber": 173,
            "verseString": "Or lest you say, “It was only that our ancestors associated before, and we were but descendants after them. Will You destroy us because of the deeds of the fabricators?”"
        },
        {
            "verseNumber": 174,
            "verseString": "Thus, We detail the verses, so they may return."
        },
        {
            "verseNumber": 175,
            "verseString": "Tell them the story of the one to whom We presented Our signs, but he shrugged them off; thus, Satan followed him, and he became one of the deviants."
        },
        {
            "verseNumber": 176,
            "verseString": "Had We willed, We could’ve raised him by their means, but he clung to the earth and pursued his desires. His example is that of a dog: if you chase him, he pants, or if you leave him, he still pants. That’s the likeness of the people who deny Our verses. So, tell the stories so they may reflect."
        },
        {
            "verseNumber": 177,
            "verseString": "How terrible is the example of the people who deny Our revelations and wrong themselves!"
        },
        {
            "verseNumber": 178,
            "verseString": "Whomever God guides—he is the guided; and whomever He sends astray—those are the ones who are the losers.",
            "verseStringReplacedWithAllah": "Whomever Allah guides—he is the guided; and whomever He sends astray—those are the ones who are the losers."
        },
        {
            "verseNumber": 179,
            "verseString": "We’ve destined for Hell many jinns and humans. They have hearts with which they don’t understand, eyes with which they don’t see, and ears with which they don’t hear. They are like cattle; rather, they are more astray. These are the heedless ones."
        },
        {
            "verseNumber": 180,
            "verseString": "To God belong the most beautiful names; so call upon Him by them, and avoid those who disrespect His names. They will be recompensed for their deeds.",
            "verseStringReplacedWithAllah": "To Allah belong the most beautiful names; so call upon Him by them, and avoid those who disrespect His names. They will be recompensed for their deeds."
        },
        {
            "verseNumber": 181,
            "verseString": "Among those We’ve created is a community who guide by truth and by it establish justice."
        },
        {
            "verseNumber": 182,
            "verseString": "Those who reject Our communications—We will lead them gradually from where they don’t know."
        },
        {
            "verseNumber": 183,
            "verseString": "I will give them time. My plan is firm."
        },
        {
            "verseNumber": 184,
            "verseString": "Or don’t they think? There is no madness in their friend. He is but a transparent warner."
        },
        {
            "verseNumber": 185,
            "verseString": "Didn’t they contemplate the dominion of the heavens and the earth, and what God created, and that their term might be near? In what statement after this will they believe?",
            "verseStringReplacedWithAllah": "Didn’t they contemplate the dominion of the heavens and the earth, and what Allah created, and that their term might be near? In what statement after this will they believe?"
        },
        {
            "verseNumber": 186,
            "verseString": "Whomever God misguides—there is no guide for him. And He leaves them in their transgression, wandering blindly.",
            "verseStringReplacedWithAllah": "Whomever Allah misguides—there is no guide for him. And He leaves them in their transgression, wandering blindly."
        },
        {
            "verseNumber": 187,
            "verseString": "They ask you about the Hour, “When will it arrive?” Respond, “The knowledge of it lies only with my Lord. Only He will reveal it when its time comes. It hangs heavily in the heavens and the earth, and it will come upon you only unexpectedly.” They ask you as if you are privy to it. Say, “Only God possesses knowledge of it, yet most people are unaware.”",
            "verseStringReplacedWithAllah": "They ask you about the Hour, “When will it arrive?” Respond, “The knowledge of it lies only with my Lord. Only He will reveal it when its time comes. It hangs heavily in the heavens and the earth, and it will come upon you only unexpectedly.” They ask you as if you are privy to it. Say, “Only Allah possesses knowledge of it, yet most people are unaware.”"
        },
        {
            "verseNumber": 188,
            "verseString": "Say, “I have no power to benefit or harm myself, except as God wills. If I knew the unseen, I would’ve acquired much good, and no harm would’ve touched me. I am only a warner and a bearer of good news to those who believe.”",
            "verseStringReplacedWithAllah": "Say, “I have no power to benefit or harm myself, except as Allah wills. If I knew the unseen, I would’ve acquired much good, and no harm would’ve touched me. I am only a warner and a bearer of good news to those who believe.”"
        },
        {
            "verseNumber": 189,
            "verseString": "It is He who created you from a single person, and made its spouse from it, so he might find comfort in her. When he mates with her, she carries a light burden that she can hardly feel. When it becomes heavy, they pray to God, their Lord, “If You grant us a healthy child, we will surely be among the grateful.”",
            "verseStringReplacedWithAllah": "It is He who created you from a single person, and made its spouse from it, so he might find comfort in her. When he mates with her, she carries a light burden that she can hardly feel. When it becomes heavy, they pray to Allah, their Lord, “If You grant us a healthy child, we will surely be among the grateful.”"
        },
        {
            "verseNumber": 190,
            "verseString": "Yet, when He grants them a healthy child, they associate partners to Him in what He gave them. Exalted is God, far above the partners they associate with Him.",
            "verseStringReplacedWithAllah": "Yet, when He grants them a healthy child, they associate partners to Him in what He gave them. Exalted is Allah, far above the partners they associate with Him."
        },
        {
            "verseNumber": 191,
            "verseString": "Do they ascribe to Him partners who create nothing, yet are themselves created?"
        },
        {
            "verseNumber": 192,
            "verseString": "They can’t help them, nor can they help themselves."
        },
        {
            "verseNumber": 193,
            "verseString": "And if you invite them for guidance, they won’t follow you. It is the same whether you call them or you remain silent."
        },
        {
            "verseNumber": 194,
            "verseString": "Those whom you call upon besides God are servants like you. So call upon them, and let them respond to you, if you are truthful.",
            "verseStringReplacedWithAllah": "Those whom you call upon besides Allah are servants like you. So call upon them, and let them respond to you, if you are truthful."
        },
        {
            "verseNumber": 195,
            "verseString": "Do they have legs with which they walk? Or hands with which they strike? Or eyes with which they see? Or ears with which they hear? Say, “Call upon your ‘associates’, then scheme against me, and give me no respite.”"
        },
        {
            "verseNumber": 196,
            "verseString": "“My protector is God, who revealed the Book, and He protects the righteous.”",
            "verseStringReplacedWithAllah": "“My protector is Allah, who revealed the Book, and He protects the righteous.”"
        },
        {
            "verseNumber": 197,
            "verseString": "Those you call upon besides Him can’t help you, nor can they help themselves."
        },
        {
            "verseNumber": 198,
            "verseString": "And if you invite them for guidance, they can’t hear. You may see them looking towards you, but they don’t see."
        },
        {
            "verseNumber": 199,
            "verseString": "Accept forgiveness, commend what’s right, and turn away from the ignorant."
        },
        {
            "verseNumber": 200,
            "verseString": "If an evil suggestion from Satan should assault you, seek refuge in God. He is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "If an evil suggestion from Satan should assault you, seek refuge in Allah. He is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 201,
            "verseString": "Those who are righteous, when an impulse from Satan strikes them, they remind themselves, and immediately see clearly."
        },
        {
            "verseNumber": 202,
            "verseString": "And their brethren prolong them in error, and then cease not."
        },
        {
            "verseNumber": 203,
            "verseString": "When you don’t bring them a verse, they say, “Why can’t you make one up?” Say, “I only follow what’s revealed to me by my Lord. These are insights from your Lord, and guidance and mercy for people who believe.”"
        },
        {
            "verseNumber": 204,
            "verseString": "When the Quran is read, then listen to it attentively, so you may receive mercy."
        },
        {
            "verseNumber": 205,
            "verseString": "And remember your Lord within yourself, with humility and reverence, and without raising your voice, in the morning and the evening, and don’t be among the unmindful."
        },
        {
            "verseNumber": 206,
            "verseString": "Those who are in your Lord’s presence aren’t too proud to worship Him. They glorify Him, and to Him they prostrate."
        }
    ],
    "chapterNumber": 7,
    "nameInEnglish": "The Heights",
    "nameInTransliteration": "Al Araf",
    "nameInArabic": "الأعراف",
    "numberOfVerses": 206
}