{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Was there not a time in history when man was nothing to be mentioned?"
        },
        {
            "verseNumber": 2,
            "verseString": "We created man from a drop of mingled fluid, to test him, and We endowed him with hearing and sight."
        },
        {
            "verseNumber": 3,
            "verseString": "We guided him on the path, whether he be grateful or ungrateful."
        },
        {
            "verseNumber": 4,
            "verseString": "For the unbelievers, We prepared chains, shackles, and a blazing inferno."
        },
        {
            "verseNumber": 5,
            "verseString": "The righteous will drink from a cup whose mixture is camphor."
        },
        {
            "verseNumber": 6,
            "verseString": "A spring from which the servants of God will drink, causing it to gush abundantly.",
            "verseStringReplacedWithAllah": "A spring from which the servants of Allah will drink, causing it to gush abundantly."
        },
        {
            "verseNumber": 7,
            "verseString": "They fulfill their vows and dread a Day whose evil would be widespread."
        },
        {
            "verseNumber": 8,
            "verseString": "They feed, for the love of Him, the destitute, the orphan, and the captive."
        },
        {
            "verseNumber": 9,
            "verseString": "“We feed you only for the sake of God; we desire neither compensation nor thanks from you.",
            "verseStringReplacedWithAllah": "“We feed you only for the sake of Allah; we desire neither compensation nor thanks from you."
        },
        {
            "verseNumber": 10,
            "verseString": "We fear from our Lord a frowning, grim Day.”"
        },
        {
            "verseNumber": 11,
            "verseString": "So, God will protect them from the woes of that Day and grant them radiance and happiness.",
            "verseStringReplacedWithAllah": "So, Allah will protect them from the woes of that Day and grant them radiance and happiness."
        },
        {
            "verseNumber": 12,
            "verseString": "And He will reward them, for being patient, with a garden and silk."
        },
        {
            "verseNumber": 13,
            "verseString": "Reclining therein on adorned couches, they will see there neither the excessive heat of the sun, nor severe cold."
        },
        {
            "verseNumber": 14,
            "verseString": "Its shade hovering over them, with its fruit clusters hanging low."
        },
        {
            "verseNumber": 15,
            "verseString": "They will be served from vessels of silver and crystal-clear cups."
        },
        {
            "verseNumber": 16,
            "verseString": "Cups of silver, they measure them precisely."
        },
        {
            "verseNumber": 17,
            "verseString": "They will be given to drink a drink mixed with ginger."
        },
        {
            "verseNumber": 18,
            "verseString": "From a spring therein named Salsabil."
        },
        {
            "verseNumber": 19,
            "verseString": "And there will circulate among them eternalized youths, when you see them, you would think they are scattered pearls."
        },
        {
            "verseNumber": 20,
            "verseString": "When you look around, you will see delight and a vast kingdom."
        },
        {
            "verseNumber": 21,
            "verseString": "Upon them will be garments of fine, green silk and heavy brocade, and they will be adorned with bracelets of silver. Their Lord will give them a pure drink."
        },
        {
            "verseNumber": 22,
            "verseString": "“This is your reward. And your effort has been appreciated.”"
        },
        {
            "verseNumber": 23,
            "verseString": "It is We who revealed the Quran to you, gradually."
        },
        {
            "verseNumber": 24,
            "verseString": "So be patient for your Lord’s judgment, and obey neither the sinner nor the ungrateful among them."
        },
        {
            "verseNumber": 25,
            "verseString": "And remember the name of your Lord morning and evening."
        },
        {
            "verseNumber": 26,
            "verseString": "And during part of the night, prostrate yourself to Him, and glorify Him long into the night."
        },
        {
            "verseNumber": 27,
            "verseString": "These people love the fleeting life, and they leave behind a heavy day."
        },
        {
            "verseNumber": 28,
            "verseString": "We created them and strengthened their frames, and when We will, We will replace them with others like them."
        },
        {
            "verseNumber": 29,
            "verseString": "This is a reminder. So, whoever wills, let him take a way towards his Lord."
        },
        {
            "verseNumber": 30,
            "verseString": "But you cannot will, unless God wills. God is ever Knowing and Wise.",
            "verseStringReplacedWithAllah": "But you cannot will, unless Allah wills. Allah is ever Knowing and Wise."
        },
        {
            "verseNumber": 31,
            "verseString": "He admits into His mercy whom He wills. But for the wrongdoers, He prepared a severe punishment."
        }
    ],
    "chapterNumber": 76,
    "nameInEnglish": "Man",
    "nameInTransliteration": "Al Insan",
    "nameInArabic": "الإنسان",
    "numberOfVerses": 31
}