{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Ha. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "By the clear and enlightening Scripture."
        },
        {
            "verseNumber": 3,
            "verseString": "We’ve made it an Arabic Quran, so you may understand."
        },
        {
            "verseNumber": 4,
            "verseString": "In fact, it is in the Source of the Book with Us, exalted and full of wisdom."
        },
        {
            "verseNumber": 5,
            "verseString": "Should We withdraw the Message from you, since you are a people who transgress?"
        },
        {
            "verseNumber": 6,
            "verseString": "How many a Prophet did We send among the ancients?"
        },
        {
            "verseNumber": 7,
            "verseString": "Yet, no Prophet came to them but they mocked him."
        },
        {
            "verseNumber": 8,
            "verseString": "We destroyed those far more powerful than them, and the example of the ancients has gone past."
        },
        {
            "verseNumber": 9,
            "verseString": "If you were to ask them, “Who created the heavens and the earth?” They would surely state, “The Almighty, the All-Knowing created them.”"
        },
        {
            "verseNumber": 10,
            "verseString": "He who made the earth a cradle for you, and traced routes upon it for you, so you may find your way."
        },
        {
            "verseNumber": 11,
            "verseString": "He who sends down rain from the sky in measured quantities, and with it, We revive a lifeless land. Similarly, you will be resurrected."
        },
        {
            "verseNumber": 12,
            "verseString": "He who created all paired things, and granted for you ships and animals that you may ride."
        },
        {
            "verseNumber": 13,
            "verseString": "So that you may be mounted on their backs, remember your Lord’s favor when seated on them, and say, “Exalted be He who has put this under our control; we couldn’t have done it by ourselves."
        },
        {
            "verseNumber": 14,
            "verseString": "And indeed, to our Lord, we will return.”"
        },
        {
            "verseNumber": 15,
            "verseString": "They made some of His servants a part of Him. The human being is openly ungrateful."
        },
        {
            "verseNumber": 16,
            "verseString": "Did He choose daughters for Himself from what He created, and favored you with sons?"
        },
        {
            "verseNumber": 17,
            "verseString": "When one of them is informed of what he attributes to the Most Merciful, his face darkens, and he is repressed with grief."
        },
        {
            "verseNumber": 18,
            "verseString": "“An entity nurtured amidst ornaments?” And he suppresses inner conflicts."
        },
        {
            "verseNumber": 19,
            "verseString": "They attribute the angels, who are servants of the Gracious, as females. Did they witness their creation? Their testimony will be recorded, and they will be questioned."
        },
        {
            "verseNumber": 20,
            "verseString": "They assert, “If the Merciful had willed, we wouldn’t have worshiped them.” They don’t know this; they are only speculating."
        },
        {
            "verseNumber": 21,
            "verseString": "Or did We give them a scripture before this one to which they are adhering?"
        },
        {
            "verseNumber": 22,
            "verseString": "But they say, “We found our ancestors upon a course, and we are guided by their footsteps.”"
        },
        {
            "verseNumber": 23,
            "verseString": "Likewise, whenever We sent a warner before you to any city, its affluent inhabitants said, “We found our forefathers following a path, and we are following in their footsteps.”"
        },
        {
            "verseNumber": 24,
            "verseString": "He would say, “Even if I bring you better guidance than what you found your forefathers following?” They would reply, “We reject what you’ve been sent with.”"
        },
        {
            "verseNumber": 25,
            "verseString": "So We wreaked vengeance on them. Consider the end of the deniers."
        },
        {
            "verseNumber": 26,
            "verseString": "Abraham told his father and his people, “I am free from what you worship."
        },
        {
            "verseNumber": 27,
            "verseString": "Only He who created me will guide me.”"
        },
        {
            "verseNumber": 28,
            "verseString": "He left this a lasting word among his descendants, so they might return."
        },
        {
            "verseNumber": 29,
            "verseString": "I allowed these and their ancestors some enjoyment, until the truth arrived with a transparent messenger."
        },
        {
            "verseNumber": 30,
            "verseString": "However, when the truth came to them, they said, “This is sorcery, and we disbelieve it.”"
        },
        {
            "verseNumber": 31,
            "verseString": "They ask, “Why wasn’t this Quran revealed to a notable man from one of the two cities?”"
        },
        {
            "verseNumber": 32,
            "verseString": "Is it they who dispense your Lord’s mercy? It is We who distribute their sustenance in this life, elevating some in ranks above others, so that they may take one another in service. Your Lord’s mercy is far better than whatever they amass."
        },
        {
            "verseNumber": 33,
            "verseString": "Were it not that all mankind might become one community, We would have granted the Merciful-deniers houses with ceilings of silver and stairways upon which they could ascend."
        },
        {
            "verseNumber": 34,
            "verseString": "And for their homes, doors, and beds on which they recline."
        },
        {
            "verseNumber": 35,
            "verseString": "And all kinds of ornaments. However, all these are merely transient pleasures of this worldly life. The Hereafter, with your Lord, is for the righteous."
        },
        {
            "verseNumber": 36,
            "verseString": "For those who shun the remembrance of the Most Merciful, We assign for them a devil to be their constant companion."
        },
        {
            "verseNumber": 37,
            "verseString": "They lead them astray from the path, while they think they are guided."
        },
        {
            "verseNumber": 38,
            "verseString": "Until, when he comes before Us, he will say, “I wish you and I were as distant as the two horizons—what a terrible companionship!”"
        },
        {
            "verseNumber": 39,
            "verseString": "It won’t benefit you on that Day if you did wrong; you will be sharing in the punishment."
        },
        {
            "verseNumber": 40,
            "verseString": "Can you make the deaf hear; or guide the blind, or those who are in evident error."
        },
        {
            "verseNumber": 41,
            "verseString": "Even if We were to take you away, We will inflict punishment upon them."
        },
        {
            "verseNumber": 42,
            "verseString": "Or We may show you what We promised them, for We have absolute control over them."
        },
        {
            "verseNumber": 43,
            "verseString": "So, adhere to what was revealed to you; you are on a straight path."
        },
        {
            "verseNumber": 44,
            "verseString": "It is a reminder for you and your people, and you’ll be questioned."
        },
        {
            "verseNumber": 45,
            "verseString": "Ask the messengers We sent before you: “Did We ever appoint gods to be worshiped other than the Most Merciful?”"
        },
        {
            "verseNumber": 46,
            "verseString": "With Our signs, we sent Moses to Pharaoh and his assembly, proclaiming, “I am the messenger of the Lord of the worlds.”"
        },
        {
            "verseNumber": 47,
            "verseString": "But when he presented Our verses to them, they laughed at them."
        },
        {
            "verseNumber": 48,
            "verseString": "Every miracle We showed them was more significant than the one preceding it. And We afflicted them with plagues, so they might return."
        },
        {
            "verseNumber": 49,
            "verseString": "They pleaded, “O magician, pray to your Lord for us, according to the covenant He made with you, and we will be guided.”"
        },
        {
            "verseNumber": 50,
            "verseString": "But when We relieved their affliction, they immediately broke their promise."
        },
        {
            "verseNumber": 51,
            "verseString": "Pharaoh proclaimed among his people, “O my people, do I not rule Egypt, with these rivers flowing beneath me? Can’t you see?"
        },
        {
            "verseNumber": 52,
            "verseString": "Am I not superior to this pitiful wretch who can barely express himself?"
        },
        {
            "verseNumber": 53,
            "verseString": "Why were no gold bracelets dropped on him, or angels accompanying him in procession?”"
        },
        {
            "verseNumber": 54,
            "verseString": "He fooled his people, and they obeyed him. They were a people prone to wrongdoing."
        },
        {
            "verseNumber": 55,
            "verseString": "When they provoked Our wrath, We retaliated by drowning them all."
        },
        {
            "verseNumber": 56,
            "verseString": "And We made them a precedent and an example for future generations."
        },
        {
            "verseNumber": 57,
            "verseString": "When the instance of Jesus, son of Mary, was cited, your people immediately jeered."
        },
        {
            "verseNumber": 58,
            "verseString": "They argued, “Are our gods better, or is he?” They posed this question only to argue. They are a quarrelsome lot."
        },
        {
            "verseNumber": 59,
            "verseString": "He was but a servant whom We blessed, and We set him an example for the Children of Israel."
        },
        {
            "verseNumber": 60,
            "verseString": "Had We willed, We could’ve made from you angels to be successors on earth."
        },
        {
            "verseNumber": 61,
            "verseString": "He is knowledge for the Hour. Have no doubt about it, and follow me. This is a straight path."
        },
        {
            "verseNumber": 62,
            "verseString": "And don’t let Satan divert you; he is your clear enemy."
        },
        {
            "verseNumber": 63,
            "verseString": "When Jesus came with the evident miracles, he said, “I’ve come to you with wisdom, and to clarify some of your disagreements. So fear God, and obey me.",
            "verseStringReplacedWithAllah": "When Jesus came with the evident miracles, he said, “I’ve come to you with wisdom, and to clarify some of your disagreements. So fear Allah, and obey me."
        },
        {
            "verseNumber": 64,
            "verseString": "God is my Lord and your Lord, so worship Him. This is a straight path.”",
            "verseStringReplacedWithAllah": "Allah is my Lord and your Lord, so worship Him. This is a straight path.”"
        },
        {
            "verseNumber": 65,
            "verseString": "But the sects differed among themselves. Woe to those who commit wrong, for they will face severe punishment on a dreadful day."
        },
        {
            "verseNumber": 66,
            "verseString": "Are they merely waiting for the Hour to come upon them suddenly while they are unaware?"
        },
        {
            "verseNumber": 67,
            "verseString": "On that Day, close friends will be enemies to each other, except for the righteous."
        },
        {
            "verseNumber": 68,
            "verseString": "O My servants, there will be no fear or sorrow upon you that Day."
        },
        {
            "verseNumber": 69,
            "verseString": "Those who believed in Our verses and submitted themselves."
        },
        {
            "verseNumber": 70,
            "verseString": "Enter Paradise, you and your spouses, in happiness and delight."
        },
        {
            "verseNumber": 71,
            "verseString": "Circulated among them are dishes and goblets of gold, and all that the soul could desire, and the eyes could delight in will be yours. You will reside there forever."
        },
        {
            "verseNumber": 72,
            "verseString": "This is the Paradise which you’ve inherited because of what you used to do."
        },
        {
            "verseNumber": 73,
            "verseString": "Therein for you are plentiful fruits, from which you eat."
        },
        {
            "verseNumber": 74,
            "verseString": "Surely, for the wrongdoers, they will suffer the unending torment of Hell."
        },
        {
            "verseNumber": 75,
            "verseString": "It won’t be lightened for them, and they will despair therein."
        },
        {
            "verseNumber": 76,
            "verseString": "We didn’t wrong them, but they were the wrongdoers."
        },
        {
            "verseNumber": 77,
            "verseString": "They will cry out: “O Malik, let your Lord end us!” He will say, “You are staying.”"
        },
        {
            "verseNumber": 78,
            "verseString": "Surely, We brought you the truth, but most of you hate the truth."
        },
        {
            "verseNumber": 79,
            "verseString": "Did they devise a plan? We, too, are planning."
        },
        {
            "verseNumber": 80,
            "verseString": "Or do they think that We don’t hear their secrets and their private conversations? Indeed, Our messengers, with them, are recording."
        },
        {
            "verseNumber": 81,
            "verseString": "Say, “If the Merciful had a child, I would be the first to worship.”"
        },
        {
            "verseNumber": 82,
            "verseString": "Glory be to the Lord of the heavens and the earth, the Lord of the Throne, far beyond what they attribute to Him."
        },
        {
            "verseNumber": 83,
            "verseString": "Let them chatter and play until they meet their promised Day."
        },
        {
            "verseNumber": 84,
            "verseString": "He is God in the heavens and God on earth. He is the All-Wise, the All-Knowing.",
            "verseStringReplacedWithAllah": "He is Allah in the heavens and Allah on earth. He is the All-Wise, the All-Knowing."
        },
        {
            "verseNumber": 85,
            "verseString": "Blessed is He who holds dominion over the heavens, the earth, and all that is between them. With Him is the knowledge of the Hour, and you will be returned to Him."
        },
        {
            "verseNumber": 86,
            "verseString": "None of those they call upon besides Him has any power of intercession, except those who testify to the truth knowingly."
        },
        {
            "verseNumber": 87,
            "verseString": "If you were to ask them, “Who created them?” they would reply, “God.” How, then, are they deluded?",
            "verseStringReplacedWithAllah": "If you were to ask them, “Who created them?” they would reply, “Allah.” How, then, are they deluded?"
        },
        {
            "verseNumber": 88,
            "verseString": "Regarding his statement, “O my Lord, these are people who don’t believe.”"
        },
        {
            "verseNumber": 89,
            "verseString": "Pardon them, and say, “Peace.” Soon they will find out."
        }
    ],
    "chapterNumber": 43,
    "nameInEnglish": "Ornaments",
    "nameInTransliteration": "Az Zukhruf",
    "nameInArabic": "الزخرف",
    "numberOfVerses": 89
}