{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Everything in the heavens and on earth glorifies God, the Almighty, the All-Wise.",
            "verseStringReplacedWithAllah": "Everything in the heavens and on earth glorifies Allah, the Almighty, the All-Wise."
        },
        {
            "verseNumber": 2,
            "verseString": "O you who believe, why do you say what you don’t do?"
        },
        {
            "verseNumber": 3,
            "verseString": "It is greatly displeasing to God that you say what you don’t do.",
            "verseStringReplacedWithAllah": "It is greatly displeasing to Allah that you say what you don’t do."
        },
        {
            "verseNumber": 4,
            "verseString": "God loves those who fight in His cause, in formation, as if they were a solid structure.",
            "verseStringReplacedWithAllah": "Allah loves those who fight in His cause, in formation, as if they were a solid structure."
        },
        {
            "verseNumber": 5,
            "verseString": "When Moses said to his people, “O my people, why do you harm me, when you know that I am God’s Messenger to you?” When they swerved, God swerved their hearts. God does not guide the immoral people.",
            "verseStringReplacedWithAllah": "When Moses said to his people, “O my people, why do you harm me, when you know that I am Allah’s Messenger to you?” When they swerved, Allah swerved their hearts. Allah does not guide the immoral people."
        },
        {
            "verseNumber": 6,
            "verseString": "When Jesus, the son of Mary, said, “O Children of Israel, I am God’s Messenger to you, confirming the Torah that preceded me, and announcing a Messenger to come after me, his name will be Ahmad.” However, when he brought them the evident miracles, they said, “This is obvious magic.”",
            "verseStringReplacedWithAllah": "When Jesus, the son of Mary, said, “O Children of Israel, I am Allah’s Messenger to you, confirming the Torah that preceded me, and announcing a Messenger to come after me, his name will be Ahmad.” However, when he brought them the evident miracles, they said, “This is obvious magic.”"
        },
        {
            "verseNumber": 7,
            "verseString": "Who is more unjust than someone who fabricates lies about God while being invited to Submission? God doesn’t guide the wrongdoing people.",
            "verseStringReplacedWithAllah": "Who is more unjust than someone who fabricates lies about Allah while being invited to Submission? Allah doesn’t guide the wrongdoing people."
        },
        {
            "verseNumber": 8,
            "verseString": "They wish to extinguish God’s light with their words, but God insists on completing His light, despite the hatred of the unbelievers.",
            "verseStringReplacedWithAllah": "They wish to extinguish Allah’s light with their words, but Allah insists on completing His light, despite the hatred of the unbelievers."
        },
        {
            "verseNumber": 9,
            "verseString": "It is He who sent His Messenger with the guidance and the religion of truth, to make it prevail over all other religions, despite the associators’ hatred."
        },
        {
            "verseNumber": 10,
            "verseString": "O you who believe, shall I introduce you to a trade that will save you from much suffering?"
        },
        {
            "verseNumber": 11,
            "verseString": "Believe in God and His Messenger, and strive in God’s way with your wealth and your lives. That is better for you, if you only knew.",
            "verseStringReplacedWithAllah": "Believe in Allah and His Messenger, and strive in Allah’s way with your wealth and your lives. That is better for you, if you only knew."
        },
        {
            "verseNumber": 12,
            "verseString": "He will forgive your sins and admit you into Gardens beneath which rivers flow, and into fine dwellings in the Gardens of Eternity. That’s the ultimate success."
        },
        {
            "verseNumber": 13,
            "verseString": "And another thing you love: victory from God and an imminent conquest. So, give the believers good news.",
            "verseStringReplacedWithAllah": "And another thing you love: victory from Allah and an imminent conquest. So, give the believers good news."
        },
        {
            "verseNumber": 14,
            "verseString": "O you who believe, be supporters of God, as Jesus, son of Mary, said to the disciples, “Who are my supporters towards God?” The disciples replied, “We are the supporters of God.” Then a faction among the Children of Israel believed, while another faction disbelieved. So, We supported those who believed against their enemy, and they became dominant.",
            "verseStringReplacedWithAllah": "O you who believe, be supporters of Allah, as Jesus, son of Mary, said to the disciples, “Who are my supporters towards Allah?” The disciples replied, “We are the supporters of Allah.” Then a faction among the Children of Israel believed, while another faction disbelieved. So, We supported those who believed against their enemy, and they became dominant."
        }
    ],
    "chapterNumber": 61,
    "nameInEnglish": "Column",
    "nameInTransliteration": "As Saff",
    "nameInArabic": "الـصـف",
    "numberOfVerses": 14
}