{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif. Lam. Ra. These are the verses of the Scripture—a Quran that explains with clarity."
        },
        {
            "verseNumber": 2,
            "verseString": "Perhaps those who disbelieve would wish that they had been Submitters."
        },
        {
            "verseNumber": 3,
            "verseString": "Let them eat, enjoy, and let false hope distract them. Soon they will know."
        },
        {
            "verseNumber": 4,
            "verseString": "We’ve never destroyed a community that didn’t have a known term."
        },
        {
            "verseNumber": 5,
            "verseString": "No community can accelerate or postpone its appointed time."
        },
        {
            "verseNumber": 6,
            "verseString": "They said, “O you to whom the reminder was revealed, you are surely deranged.”"
        },
        {
            "verseNumber": 7,
            "verseString": "“Why don’t you bring us the angels, if you are truthful?”"
        },
        {
            "verseNumber": 8,
            "verseString": "We only send down angels in truth, and they wouldn’t be restrained."
        },
        {
            "verseNumber": 9,
            "verseString": "Surely, it is We who revealed the Message, and it is We who will preserve it."
        },
        {
            "verseNumber": 10,
            "verseString": "We sent messengers before you to the ancient communities."
        },
        {
            "verseNumber": 11,
            "verseString": "Yet every messenger that came to them was ridiculed."
        },
        {
            "verseNumber": 12,
            "verseString": "Thus, We subtly instill it into the hearts of the criminals."
        },
        {
            "verseNumber": 13,
            "verseString": "They will not have faith in it, though the ways of the ancients have passed away."
        },
        {
            "verseNumber": 14,
            "verseString": "Even if we were to open up a gate into heaven for them, and they kept ascending through it."
        },
        {
            "verseNumber": 15,
            "verseString": "They would still say, “Our eyes are tricked; we are under a spell.”"
        },
        {
            "verseNumber": 16,
            "verseString": "We positioned constellations in the sky, and We beautified it for the observers."
        },
        {
            "verseNumber": 17,
            "verseString": "And We protected it from every accursed devil."
        },
        {
            "verseNumber": 18,
            "verseString": "Except those who stealthily eavesdrop; a piercing flame pursues them."
        },
        {
            "verseNumber": 19,
            "verseString": "And We spread the earth, and placed stabilizers upon it, and fostered balanced growth within it."
        },
        {
            "verseNumber": 20,
            "verseString": "We made it a habitat for you and for those you don’t sustain."
        },
        {
            "verseNumber": 21,
            "verseString": "There is not a thing but that with Us are its storehouses, and We dispense it in known measure."
        },
        {
            "verseNumber": 22,
            "verseString": "We send winds as pollinators, and We bring down water from the sky, providing you with it to drink. You don’t possess its reserves."
        },
        {
            "verseNumber": 23,
            "verseString": "It is We who give life and cause death, and We are the Inheritors."
        },
        {
            "verseNumber": 24,
            "verseString": "We know those among you who advance, and we know those who lag behind."
        },
        {
            "verseNumber": 25,
            "verseString": "Your Lord will gather them all; He is All-Wise, All-Knowing."
        },
        {
            "verseNumber": 26,
            "verseString": "We created man from clay, from molded mud."
        },
        {
            "verseNumber": 27,
            "verseString": "Beforehand, We created the jinn from scorching fire."
        },
        {
            "verseNumber": 28,
            "verseString": "Your Lord told the angels, “I am creating a human being from clay, from molded mud.”"
        },
        {
            "verseNumber": 29,
            "verseString": "“Once I have shaped him and breathed into him of My Spirit, fall in prostration before him.”"
        },
        {
            "verseNumber": 30,
            "verseString": "So, all the angels prostrated themselves collectively."
        },
        {
            "verseNumber": 31,
            "verseString": "Except for Iblis, he refused to be among those who prostrated."
        },
        {
            "verseNumber": 32,
            "verseString": "He asked, “O Iblis, what prevented you from prostrating with those who prostrated?”"
        },
        {
            "verseNumber": 33,
            "verseString": "He replied, “I will not prostrate to a human You created from clay, from molded mud.”"
        },
        {
            "verseNumber": 34,
            "verseString": "He said, “Depart from here, for you are a banished outcast."
        },
        {
            "verseNumber": 35,
            "verseString": "And the curse will be upon you until Judgment Day.”"
        },
        {
            "verseNumber": 36,
            "verseString": "He pleaded, “My Lord, delay me until the Day they’re resurrected.”"
        },
        {
            "verseNumber": 37,
            "verseString": "He responded, “You are granted delay."
        },
        {
            "verseNumber": 38,
            "verseString": "Until the appointed day and time.”"
        },
        {
            "verseNumber": 39,
            "verseString": "“Lord,” he declared, “since you have lured me away, I will glamorize for them on earth, and I will lure them all away.”"
        },
        {
            "verseNumber": 40,
            "verseString": "Except for Your chosen servants among them.”"
        },
        {
            "verseNumber": 41,
            "verseString": "He replied, “This is a straight path to Me."
        },
        {
            "verseNumber": 42,
            "verseString": "You have no sway over My devotees, except those who follow you of the deviators."
        },
        {
            "verseNumber": 43,
            "verseString": "And hell is promised to them all."
        },
        {
            "verseNumber": 44,
            "verseString": "It has seven gates. For every gate, there is a designated portion of them."
        },
        {
            "verseNumber": 45,
            "verseString": "The righteous will be in gardens and springs.”"
        },
        {
            "verseNumber": 46,
            "verseString": "“Enter it in peace, securely.”"
        },
        {
            "verseNumber": 47,
            "verseString": "We will remove from their hearts all ill feelings; they will be brethren, lounging on couches, facing one another."
        },
        {
            "verseNumber": 48,
            "verseString": "No fatigue will touch them there, nor will they ever be asked to leave."
        },
        {
            "verseNumber": 49,
            "verseString": "Inform My beings that I am the Forgiving, the Merciful."
        },
        {
            "verseNumber": 50,
            "verseString": "And that My punishment is the painful punishment."
        },
        {
            "verseNumber": 51,
            "verseString": "Relate to them the story of Abraham’s guests."
        },
        {
            "verseNumber": 52,
            "verseString": "When they entered his presence, they greeted him with “Peace.” He responded, “We are uneasy about you.”"
        },
        {
            "verseNumber": 53,
            "verseString": "They reassured him, “Fear not; we bring you good news of a wise son.”"
        },
        {
            "verseNumber": 54,
            "verseString": "He asked, “How can you bring such news, given my advanced age? So what gives you this good news?”"
        },
        {
            "verseNumber": 55,
            "verseString": "They replied, “Indeed, we bring you truthful news, so don’t lose hope.”"
        },
        {
            "verseNumber": 56,
            "verseString": "He said, “None despairs of his Lord’s mercy except those who have strayed.”"
        },
        {
            "verseNumber": 57,
            "verseString": "He then inquired, “What’s your mission, O messengers?”"
        },
        {
            "verseNumber": 58,
            "verseString": "They replied, “We’ve been sent to a people steeped in sin.”"
        },
        {
            "verseNumber": 59,
            "verseString": "“Except for Lot’s family—we will rescue them all.”"
        },
        {
            "verseNumber": 60,
            "verseString": "“Except for his wife.” We had decreed that she would be among those left behind."
        },
        {
            "verseNumber": 61,
            "verseString": "When the messengers came to Lot’s family."
        },
        {
            "verseNumber": 62,
            "verseString": "He said, “You are a people unknown to me.”"
        },
        {
            "verseNumber": 63,
            "verseString": "They replied, “We brought you what they’ve been doubting.”"
        },
        {
            "verseNumber": 64,
            "verseString": "“We’ve brought you the truth, and indeed, we are truthful.”"
        },
        {
            "verseNumber": 65,
            "verseString": "“Leave with your family during the cover of night, and follow their footsteps. Let none of you look back, and proceed as instructed.”"
        },
        {
            "verseNumber": 66,
            "verseString": "We informed him of this mandate: “The last remnants of these people will be cut off by morning.”"
        },
        {
            "verseNumber": 67,
            "verseString": "And the people of the city came rejoicing."
        },
        {
            "verseNumber": 68,
            "verseString": "He pleaded, “These are my guests, so don’t dishonor me.”"
        },
        {
            "verseNumber": 69,
            "verseString": "“And fear God, and don’t embarrass me.”",
            "verseStringReplacedWithAllah": "“And fear Allah, and don’t embarrass me.”"
        },
        {
            "verseNumber": 70,
            "verseString": "They replied, “Didn’t we forbid you from strangers?”"
        },
        {
            "verseNumber": 71,
            "verseString": "He responded, “These are my daughters, if you must act.”"
        },
        {
            "verseNumber": 72,
            "verseString": "By your life, they were in their intoxication, blundering."
        },
        {
            "verseNumber": 73,
            "verseString": "Then, the blast seized them at sunrise."
        },
        {
            "verseNumber": 74,
            "verseString": "We turned it upside down, and We rained upon them stones of baked clay."
        },
        {
            "verseNumber": 75,
            "verseString": "In this, there are signs for those who discern."
        },
        {
            "verseNumber": 76,
            "verseString": "It was located on an established road."
        },
        {
            "verseNumber": 77,
            "verseString": "In that is a sign for the believers."
        },
        {
            "verseNumber": 78,
            "verseString": "The inhabitants of the wooded valley were also wrongdoers."
        },
        {
            "verseNumber": 79,
            "verseString": "So, We exacted retribution from them. Both were visible from the main road."
        },
        {
            "verseNumber": 80,
            "verseString": "Similarly, the inhabitants of the Rocky Tract rejected the messengers."
        },
        {
            "verseNumber": 81,
            "verseString": "We presented them with Our signs, but they turned away from them."
        },
        {
            "verseNumber": 82,
            "verseString": "They used to carve secure homes into the mountains."
        },
        {
            "verseNumber": 83,
            "verseString": "Yet, the sudden blast seized them at dawn."
        },
        {
            "verseNumber": 84,
            "verseString": "All that they had acquired availed them not."
        },
        {
            "verseNumber": 85,
            "verseString": "We created the heavens and the earth, and what lies between them, with truth. The Hour is certainly coming, so overlook with beautiful forgiveness."
        },
        {
            "verseNumber": 86,
            "verseString": "Surely your Lord, He is the Creator, the All-Knowing."
        },
        {
            "verseNumber": 87,
            "verseString": "We’ve given you seven pairs, and the Grand Quran."
        },
        {
            "verseNumber": 88,
            "verseString": "Don’t extend your eyes towards what We gave certain classes of them to enjoy, and don’t grieve over them. Instead, show kindness to the believers."
        },
        {
            "verseNumber": 89,
            "verseString": "Say, “I am the clear warner.”"
        },
        {
            "verseNumber": 90,
            "verseString": "Just as We had revealed to the separatists."
        },
        {
            "verseNumber": 91,
            "verseString": "Those who made the Quran into shreds."
        },
        {
            "verseNumber": 92,
            "verseString": "By your Lord, We will surely interrogate them all."
        },
        {
            "verseNumber": 93,
            "verseString": "About what they used to do."
        },
        {
            "verseNumber": 94,
            "verseString": "So proclaim what you’re commanded, and turn away from the idolaters."
        },
        {
            "verseNumber": 95,
            "verseString": "We are sufficient for you against the mockers."
        },
        {
            "verseNumber": 96,
            "verseString": "Those who set up another deity with God—they will find out.",
            "verseStringReplacedWithAllah": "Those who set up another deity with Allah—they will find out."
        },
        {
            "verseNumber": 97,
            "verseString": "We know that what they say causes you distress."
        },
        {
            "verseNumber": 98,
            "verseString": "So, glorify your Lord with praise, and be of the ones who bow down."
        },
        {
            "verseNumber": 99,
            "verseString": "And worship your Lord until certainty comes to you."
        }
    ],
    "chapterNumber": 15,
    "nameInEnglish": "The Rock",
    "nameInTransliteration": "Al Hijr",
    "nameInArabic": "الحجر",
    "numberOfVerses": 99
}