{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Ta-Ha."
        },
        {
            "verseNumber": 2,
            "verseString": "We didn’t reveal the Quran upon you to cause you distress."
        },
        {
            "verseNumber": 3,
            "verseString": "Rather, it’s a reminder for those who hold reverence."
        },
        {
            "verseNumber": 4,
            "verseString": "A revelation from He who created the earth and the high heavens."
        },
        {
            "verseNumber": 5,
            "verseString": "The Most Merciful, who is established on the Throne."
        },
        {
            "verseNumber": 6,
            "verseString": "To Him belongs everything in the heavens, everything on earth, everything between them, and everything beneath the soil."
        },
        {
            "verseNumber": 7,
            "verseString": "Whether you speak aloud—He knows the secret and what’s more hidden."
        },
        {
            "verseNumber": 8,
            "verseString": "God—there is no god except Him. His are the best names.",
            "verseStringReplacedWithAllah": "Allah—there is no god except Him. His are the best names."
        },
        {
            "verseNumber": 9,
            "verseString": "Did you hear the story of Moses?"
        },
        {
            "verseNumber": 10,
            "verseString": "When he saw a fire, he told his family, “Stay here, I have noticed a fire. Perhaps I can bring you a torch from it, or find guidance at the fire.”"
        },
        {
            "verseNumber": 11,
            "verseString": "As he approached it, he was called, “O Moses!"
        },
        {
            "verseNumber": 12,
            "verseString": "I. I am your Lord. Remove your shoes; you are in the sacred valley of Tuwa."
        },
        {
            "verseNumber": 13,
            "verseString": "I have chosen you, so listen to what’s being revealed."
        },
        {
            "verseNumber": 14,
            "verseString": "Surely, it is I. I am God. There is no deity except Me. So, worship Me and establish prayer for My remembrance.",
            "verseStringReplacedWithAllah": "Surely, it is I. I am Allah. There is no deity except Me. So, worship Me and establish prayer for My remembrance."
        },
        {
            "verseNumber": 15,
            "verseString": "The Hour is coming; I keep it almost hidden, so that every soul may be recompensed for its endeavors."
        },
        {
            "verseNumber": 16,
            "verseString": "Therefore, let not those who don’t believe in it and follow their lusts hinder you from it, else you be ruined."
        },
        {
            "verseNumber": 17,
            "verseString": "And what’s that in your right hand, O Moses?”"
        },
        {
            "verseNumber": 18,
            "verseString": "He replied, “It is my staff. I lean on it, herd my sheep with it, and I have other uses for it.”"
        },
        {
            "verseNumber": 19,
            "verseString": "He instructed, “Throw it down, O Moses.”"
        },
        {
            "verseNumber": 20,
            "verseString": "When he threw it down, it instantly became a moving serpent."
        },
        {
            "verseNumber": 21,
            "verseString": "He said, “Pick it up, and fear not; We will restore it to its original state."
        },
        {
            "verseNumber": 22,
            "verseString": "Now, put your hand under your arm; it will come out white, without any harm—another sign."
        },
        {
            "verseNumber": 23,
            "verseString": "That We may show you some of Our greater signs."
        },
        {
            "verseNumber": 24,
            "verseString": "Go to Pharaoh, for he became tyrannical.”"
        },
        {
            "verseNumber": 25,
            "verseString": "He said, “My Lord, calm my heart for me."
        },
        {
            "verseNumber": 26,
            "verseString": "And ease my task for me."
        },
        {
            "verseNumber": 27,
            "verseString": "And remove the knot from my tongue."
        },
        {
            "verseNumber": 28,
            "verseString": "So they may understand my speech."
        },
        {
            "verseNumber": 29,
            "verseString": "Grant me a helper from my family."
        },
        {
            "verseNumber": 30,
            "verseString": "Aaron, my brother."
        },
        {
            "verseNumber": 31,
            "verseString": "Strengthen me through him."
        },
        {
            "verseNumber": 32,
            "verseString": "And let him share in my mission."
        },
        {
            "verseNumber": 33,
            "verseString": "In order to frequently glorify Your praises."
        },
        {
            "verseNumber": 34,
            "verseString": "And remember You frequently."
        },
        {
            "verseNumber": 35,
            "verseString": "You are always watchful over us.”"
        },
        {
            "verseNumber": 36,
            "verseString": "He replied, “You have been granted your request, O Moses!"
        },
        {
            "verseNumber": 37,
            "verseString": "We’ve favored you before."
        },
        {
            "verseNumber": 38,
            "verseString": "When We inspired your mother with Our message:"
        },
        {
            "verseNumber": 39,
            "verseString": "“Put him in a chest and cast it into the river. The river will wash him ashore, where an enemy of Mine and his will take him.” I bestowed upon you love from Me, so that you would be nurtured under My watchful eye."
        },
        {
            "verseNumber": 40,
            "verseString": "Then your sister stepped forward, suggesting, ‘May I direct you to someone who could assist in his upbringing?’ Thus, We returned you to your mother to soothe her heart and relieve her grief. After you had killed a man, We saved you from anxiety and tested you thoroughly. You resided among the people of Midian for several years, until you reached your predestined term, O Moses."
        },
        {
            "verseNumber": 41,
            "verseString": "I prepared you for Myself."
        },
        {
            "verseNumber": 42,
            "verseString": "Go, you and your brother, with My signs, And don’t slacken in My Remembrance."
        },
        {
            "verseNumber": 43,
            "verseString": "Approach Pharaoh, for he transgressed."
        },
        {
            "verseNumber": 44,
            "verseString": "But speak to him mildly; perhaps he may remember or fear.”"
        },
        {
            "verseNumber": 45,
            "verseString": "They responded, “Our Lord, we fear that he might lash out against us or become even more tyrannical.”"
        },
        {
            "verseNumber": 46,
            "verseString": "He reassured, “Fear not, for I am with you both. I hear, and I see."
        },
        {
            "verseNumber": 47,
            "verseString": "Go to him and say, ‘We are the messengers of your Lord, so send with us the Children of Israel and don’t torment them. We’ve come to you with a sign from your Lord, and peace is upon those who follow the guidance."
        },
        {
            "verseNumber": 48,
            "verseString": "It has been revealed to us that the punishment is upon whoever denies and turns away.’”"
        },
        {
            "verseNumber": 49,
            "verseString": "He asked, “Who is your Lord, O Moses?”"
        },
        {
            "verseNumber": 50,
            "verseString": "He answered, “Our Lord is the One who gave everything its creation, then guided.”"
        },
        {
            "verseNumber": 51,
            "verseString": "He asked, “What was the condition of the earlier generations?”"
        },
        {
            "verseNumber": 52,
            "verseString": "He answered, “knowledge about them is with my Lord, documented in a record. My Lord neither errs nor forgets.”"
        },
        {
            "verseNumber": 53,
            "verseString": "He who made the earth a habitat for you, and He traced out routes within it. And He sends down water from the sky, with which We produce diverse pairs of plants."
        },
        {
            "verseNumber": 54,
            "verseString": "Eat and let your livestock graze. In this, there are signs for those with discernment."
        },
        {
            "verseNumber": 55,
            "verseString": "From it, We created you, and into it, We will return you. And from it, We will extract you once again."
        },
        {
            "verseNumber": 56,
            "verseString": "We showed him all Our signs, but he denied and refused."
        },
        {
            "verseNumber": 57,
            "verseString": "He said, “Did you come to evict us from our land with your magic, O Moses?"
        },
        {
            "verseNumber": 58,
            "verseString": "We will bring you magic like it. So, set a date between us and you, in a neutral place, which neither we nor you will fail to attend.”"
        },
        {
            "verseNumber": 59,
            "verseString": "He replied, “Your appointment is on Festival Day, and let the people gather in the morning.”"
        },
        {
            "verseNumber": 60,
            "verseString": "Pharaoh turned his back, formulated his plan, and then came back."
        },
        {
            "verseNumber": 61,
            "verseString": "Moses cautioned them, “Woe to you! Don’t forge lies against God, lest He destroys you with a punishment; and whoever fabricates lies is bound to fail.”",
            "verseStringReplacedWithAllah": "Moses cautioned them, “Woe to you! Don’t forge lies against Allah, lest He destroys you with a punishment; and whoever fabricates lies is bound to fail.”"
        },
        {
            "verseNumber": 62,
            "verseString": "They discussed their matter amongst themselves and kept their counsel secret."
        },
        {
            "verseNumber": 63,
            "verseString": "They declared, “These two are magicians who intend to expel you from your land with their magic and abolish your exemplary tradition."
        },
        {
            "verseNumber": 64,
            "verseString": "So, formulate your strategy and come forward as a united front. And indeed, he will succeed this day who is superior.”"
        },
        {
            "verseNumber": 65,
            "verseString": "They challenged, “O Moses, either you throw, or we will be the first to throw.”"
        },
        {
            "verseNumber": 66,
            "verseString": "He replied, “Rather, you throw.” And suddenly, their ropes and staffs seemed to him from their magic that they were moving."
        },
        {
            "verseNumber": 67,
            "verseString": "And Moses felt fear within himself."
        },
        {
            "verseNumber": 68,
            "verseString": "We said, “Don’t be scared; you have the upper hand."
        },
        {
            "verseNumber": 69,
            "verseString": "Throw that which is in your right hand; it will swallow what they’ve crafted, mere illusions of a magician’s trickery. A magician won’t succeed, wherever he may turn.”"
        },
        {
            "verseNumber": 70,
            "verseString": "So the magicians fell down prostrating. They said, “We have believed in the Lord of Aaron and Moses.”"
        },
        {
            "verseNumber": 71,
            "verseString": "He threatened, “You dare to believe in Him without my permission? He must be your superior who taught you magic. I will sever your hands and feet on opposite sides, and I will crucify you on the trunks of palm trees. Then you’ll know whose punishment is harsher and more lasting.”"
        },
        {
            "verseNumber": 72,
            "verseString": "They responded, “We will never prefer you over the clear proofs that have come to us, nor over Him who created us. So issue whatever decree you wish; your jurisdiction extends only to the life of this world."
        },
        {
            "verseNumber": 73,
            "verseString": "We have put our trust in our Lord, hoping He may forgive our sins and the magic you compelled us to practice. God is far superior and everlasting.”",
            "verseStringReplacedWithAllah": "We have put our trust in our Lord, hoping He may forgive our sins and the magic you compelled us to practice. Allah is far superior and everlasting.”"
        },
        {
            "verseNumber": 74,
            "verseString": "Whoever comes before his Lord as guilty, for him is hell, where he neither dies nor lives."
        },
        {
            "verseNumber": 75,
            "verseString": "But whoever comes before Him as a believer, having performed righteous deeds—those will attain the highest stages."
        },
        {
            "verseNumber": 76,
            "verseString": "The eternal Gardens of Eternity, through which rivers flow, where they will reside forever—this is the reward for those who purify themselves."
        },
        {
            "verseNumber": 77,
            "verseString": "We revealed to Moses: “Set out at night with My servants, and strike a dry path for them through the sea, without fear of being overtaken or dread.”"
        },
        {
            "verseNumber": 78,
            "verseString": "Pharaoh pursued them with his forces, but the sea overwhelmed them, completely submerging them."
        },
        {
            "verseNumber": 79,
            "verseString": "Pharaoh misled his people; he didn’t guide them."
        },
        {
            "verseNumber": 80,
            "verseString": "O Children of Israel, We saved you from your enemy, covenanted with you on the right side of the Mount, and We sent down to you Manna and Quail."
        },
        {
            "verseNumber": 81,
            "verseString": "Eat from the good provisions We provided you, but don’t be excessive in it, lest My wrath descends upon you. Whoever upon whom My wrath descends has fallen."
        },
        {
            "verseNumber": 82,
            "verseString": "I am forgiving to whoever repents, believes, acts righteously, then becomes guided."
        },
        {
            "verseNumber": 83,
            "verseString": "“Why did you rush ahead of your people, O Moses?”"
        },
        {
            "verseNumber": 84,
            "verseString": "He replied, “They are on my tracks. I rushed to You, my Lord, so that You might be pleased.”"
        },
        {
            "verseNumber": 85,
            "verseString": "He said, “We’ve tested your people in your absence, and the Samarian led them astray.”"
        },
        {
            "verseNumber": 86,
            "verseString": "Moses returned to his people, angry and grieved. He said, “O my people, didn’t your Lord make a good promise to you? Did the promise appear too distant to you, or did you wish that wrath from your Lord descends upon you, that you broke your promise to me?”"
        },
        {
            "verseNumber": 87,
            "verseString": "They replied, “We didn’t break our promise to you intentionally, but we were made to carry burdens of the people’s ornaments, and we cast them in, as the Samarian suggested.”"
        },
        {
            "verseNumber": 88,
            "verseString": "Then he produced for them a statue of a calf which made a mooing sound. They said, “This is your god and the god of Moses, but he forgot.”"
        },
        {
            "verseNumber": 89,
            "verseString": "Didn’t they see that it could neither respond to them nor bring them harm or benefit?"
        },
        {
            "verseNumber": 90,
            "verseString": "Aaron had already pleaded with them, “O my people, you are being tested by this. Your Lord is the Most Gracious, so follow me and obey my order.”"
        },
        {
            "verseNumber": 91,
            "verseString": "They replied, “We won’t cease our devotion to it until Moses returns to us.”"
        },
        {
            "verseNumber": 92,
            "verseString": "He said, “O Aaron, what prevented you when you saw them straying?"
        },
        {
            "verseNumber": 93,
            "verseString": "From following me? Did you disobey my command?”"
        },
        {
            "verseNumber": 94,
            "verseString": "He replied, “O son of my mother, don’t seize me by my beard or head. I feared you would accuse me of causing division among the Children of Israel and not adhering to your words.”"
        },
        {
            "verseNumber": 95,
            "verseString": "He then asked, “What’s your explanation, O Samarian?”"
        },
        {
            "verseNumber": 96,
            "verseString": "He answered, “I saw what they didn’t see, so I grabbed a handful of the messenger’s trace, and I threw it. That’s what my inner self prompted me to do.”"
        },
        {
            "verseNumber": 97,
            "verseString": "Moses declared, “Go away! In this life, you must say, ‘No contact!’ And you have an appointment you can’t evade. Now, look at your god to which you remained devoted. We will burn it and then scatter it into the sea as dust.”"
        },
        {
            "verseNumber": 98,
            "verseString": "Your God is the only God, besides whom there is no other god. He encompasses everything in knowledge."
        },
        {
            "verseNumber": 99,
            "verseString": "Thus, We narrate to you some of the stories of what happened before, and We’ve given you from us a Reminder."
        },
        {
            "verseNumber": 100,
            "verseString": "Whoever turns away from it will carry a burden on Resurrection Day."
        },
        {
            "verseNumber": 101,
            "verseString": "They will remain under it forever, an evil for them to bear on Resurrection Day."
        },
        {
            "verseNumber": 102,
            "verseString": "On that Day, the Trumpet is blown, and We will gather the criminals on that Day, blue."
        },
        {
            "verseNumber": 103,
            "verseString": "Whispering among themselves, “You didn’t remain except for ten.”"
        },
        {
            "verseNumber": 104,
            "verseString": "We know well what they will say, when the most exemplary among them will say, “You stayed no more than a day.”"
        },
        {
            "verseNumber": 105,
            "verseString": "They ask you about the mountains, so say, “My Lord will crumble them into dust."
        },
        {
            "verseNumber": 106,
            "verseString": "He will leave them as a level plain."
        },
        {
            "verseNumber": 107,
            "verseString": "You will see neither elevation or depression in them.”"
        },
        {
            "verseNumber": 108,
            "verseString": "On that Day, they will follow the caller without deviation. Voices will be lowered for the Most Merciful, so you will not hear but a whisper."
        },
        {
            "verseNumber": 109,
            "verseString": "On that Day, intercession won’t benefit at all, except for those to whom the Most Merciful has granted permission and whose words He has approved."
        },
        {
            "verseNumber": 110,
            "verseString": "He knows their past and their future, and they can’t comprehend His knowledge."
        },
        {
            "verseNumber": 111,
            "verseString": "All faces will humbly submit to the Ever-Living, the Sustainer. Whoever carries injustice will despair."
        },
        {
            "verseNumber": 112,
            "verseString": "However, those who performed righteous deeds and are believers won’t fear injustice or deprivation."
        },
        {
            "verseNumber": 113,
            "verseString": "We revealed this Quran in Arabic, and We diversified the warnings in it, to foster righteousness or serve as a reminder for them."
        },
        {
            "verseNumber": 114,
            "verseString": "Exalted is God, the True King. Don’t hasten with the Quran before its revelation is completed to you, and say, “My Lord, increase me in knowledge.”",
            "verseStringReplacedWithAllah": "Exalted is Allah, the True King. Don’t hasten with the Quran before its revelation is completed to you, and say, “My Lord, increase me in knowledge.”"
        },
        {
            "verseNumber": 115,
            "verseString": "We had previously covenanted with Adam, but he forgot, and We found no resolve in him."
        },
        {
            "verseNumber": 116,
            "verseString": "When We commanded the angels, “Prostrate yourselves before Adam,” they all complied, except for Iblis, who refused."
        },
        {
            "verseNumber": 117,
            "verseString": "We said, “O Adam, this is an enemy to you and your wife. Don’t let him drive you out of Paradise, or you will be miserable."
        },
        {
            "verseNumber": 118,
            "verseString": "In it, you will never experience hunger or nakedness."
        },
        {
            "verseNumber": 119,
            "verseString": "And you won’t be thirsty or suffer from the sun’s heat.”"
        },
        {
            "verseNumber": 120,
            "verseString": "Then Satan whispered to him, saying, “O Adam, Shall I lead you to the tree of eternity and a kingdom that never decays?”"
        },
        {
            "verseNumber": 121,
            "verseString": "So they ate from it, and their nakedness was revealed to them. Consequently, they started covering themselves with leaves from the Garden. Adam disobeyed his Lord and strayed."
        },
        {
            "verseNumber": 122,
            "verseString": "But then, his Lord selected him, accepted his repentance, and provided guidance."
        },
        {
            "verseNumber": 123,
            "verseString": "He commanded, “Descend from it, all of you, some of you enemies to others. However, when guidance from Me comes to you, those who follow My guidance will neither go astray nor be miserable."
        },
        {
            "verseNumber": 124,
            "verseString": "However, those who disregard My reminder will have a life of hardship, and on the Day of Resurrection, We will resurrect them blind.”"
        },
        {
            "verseNumber": 125,
            "verseString": "He will protest, “My Lord, why did You resurrect me blind, though I was sighted?”"
        },
        {
            "verseNumber": 126,
            "verseString": "He will reply, “Just as Our revelations came to you, and you dismissed them, so today, you are dismissed.”"
        },
        {
            "verseNumber": 127,
            "verseString": "This is how We recompense those who transgress and deny their Lord’s revelations. The punishment of the Hereafter is harsher and more lasting."
        },
        {
            "verseNumber": 128,
            "verseString": "Didn’t they consider how many generations We annihilated before them, in whose dwellings they now roam? There are signs in this for those who possess insight."
        },
        {
            "verseNumber": 129,
            "verseString": "Without a predetermined decree from your Lord and a set term, their doom would’ve been inevitable."
        },
        {
            "verseNumber": 130,
            "verseString": "Therefore, patiently endure their words, and glorify and praise your Lord before sunrise and sunset. And praise Him during the night, and at the day’s extremities, so you may be content."
        },
        {
            "verseNumber": 131,
            "verseString": "Don’t extend your eyes toward what We granted categories among them to enjoy—the splendor of the life of this world—through which We test them. The provision of your Lord is better and more lasting."
        },
        {
            "verseNumber": 132,
            "verseString": "Command your family to establish prayer, and steadfastly maintain it. We don’t ask you for provision; We provide for you. The outcome is for righteousness."
        },
        {
            "verseNumber": 133,
            "verseString": "They say, “Why doesn’t he bring us a sign from his Lord?” Didn’t they receive sufficient evidence in the previous Scriptures?"
        },
        {
            "verseNumber": 134,
            "verseString": "If We had annihilated them with a punishment before this, they would have said, “Our Lord, why didn’t You send us a messenger, so we could follow Your verses before we were humiliated and disgraced.”"
        },
        {
            "verseNumber": 135,
            "verseString": "Say, “Everyone is waiting; so wait. You will soon know who are the followers of the straight path, and who is guided.”"
        }
    ],
    "chapterNumber": 20,
    "nameInEnglish": "Ta Ha",
    "nameInTransliteration": "Ta Ha",
    "nameInArabic": "طه",
    "numberOfVerses": 135
}