{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Ha. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "Ayn. Seen. Qaaf."
        },
        {
            "verseNumber": 3,
            "verseString": "Thus does God, the Mighty, the Wise, inspire you and those before you.",
            "verseStringReplacedWithAllah": "Thus does Allah, the Mighty, the Wise, inspire you and those before you."
        },
        {
            "verseNumber": 4,
            "verseString": "Everything in the heavens and on earth belongs to Him. He is the Most High, the Supreme."
        },
        {
            "verseNumber": 5,
            "verseString": "The heavens almost rupture from above them, while the angels praise the glory of their Lord and seek forgiveness for those on earth. God is the Forgiving, the Merciful.",
            "verseStringReplacedWithAllah": "The heavens almost rupture from above them, while the angels praise the glory of their Lord and seek forgiveness for those on earth. Allah is the Forgiving, the Merciful."
        },
        {
            "verseNumber": 6,
            "verseString": "As for those who take protectors other than Him, God is watchful over them, and you aren’t a trustee over them.",
            "verseStringReplacedWithAllah": "As for those who take protectors other than Him, Allah is watchful over them, and you aren’t a trustee over them."
        },
        {
            "verseNumber": 7,
            "verseString": "Thus, We revealed to you an Arabic Quran, to warn the Mother of Cities and those around it, and to warn of the Day of Gathering, about which there is no doubt. A group will be in paradise, and a group in the Blaze."
        },
        {
            "verseNumber": 8,
            "verseString": "Had God willed, He could’ve made them one community, but He admits into His mercy whom He wills. The wrongdoers have no protector or helper.",
            "verseStringReplacedWithAllah": "Had Allah willed, He could’ve made them one community, but He admits into His mercy whom He wills. The wrongdoers have no protector or helper."
        },
        {
            "verseNumber": 9,
            "verseString": "Or have they taken protectors other than Him? God alone is the Protector. He gives life to the dead, and He is over all things capable.",
            "verseStringReplacedWithAllah": "Or have they taken protectors other than Him? Allah alone is the Protector. He gives life to the dead, and He is over all things capable."
        },
        {
            "verseNumber": 10,
            "verseString": "In any matter of dispute, the final decision rests with God. “This is God, my Lord. Upon Him I have relied, and to Him I turn.”",
            "verseStringReplacedWithAllah": "In any matter of dispute, the final decision rests with Allah. “This is Allah, my Lord. Upon Him I have relied, and to Him I turn.”"
        },
        {
            "verseNumber": 11,
            "verseString": "The Creator of the heavens and the earth, has made for you mates from your own kind, and pairs of livestock, by which He multiplies you. There is nothing like Him. He is the All-Hearer, the All-Seer."
        },
        {
            "verseNumber": 12,
            "verseString": "To Him belong the controls of the heavens and the earth. He extends provision for whomever He wills, and restricts. He is fully aware of everything."
        },
        {
            "verseNumber": 13,
            "verseString": "He ordained for you the same religion He enjoined upon Noah, and what We revealed to you, and what We enjoined upon Abraham, Moses, and Jesus: “Uphold the religion, and don’t be divided within it.” What you call the polytheists to is difficult for them. God chooses for Himself whom He wills and guides to Himself whoever turns back.",
            "verseStringReplacedWithAllah": "He ordained for you the same religion He enjoined upon Noah, and what We revealed to you, and what We enjoined upon Abraham, Moses, and Jesus: “Uphold the religion, and don’t be divided within it.” What you call the polytheists to is difficult for them. Allah chooses for Himself whom He wills and guides to Himself whoever turns back."
        },
        {
            "verseNumber": 14,
            "verseString": "They didn’t become divided until after knowledge had come to them, out of mutual envy. If not for a prior decree from your Lord, judgment would’ve been issued between them. Those who were made to inherit the Scripture after them are in troubling doubt concerning it."
        },
        {
            "verseNumber": 15,
            "verseString": "So, invite to this, and be upright as you’re commanded, and don’t follow their desires. And say, “I believe in whatever Scripture God revealed. And I am commanded to judge justly among you. God is our Lord and your Lord. We have our deeds, and you have yours. There is no contention between us and you. God will bring us together, and to Him is the final return.”",
            "verseStringReplacedWithAllah": "So, invite to this, and be upright as you’re commanded, and don’t follow their desires. And say, “I believe in whatever Scripture Allah revealed. And I am commanded to judge justly among you. Allah is our Lord and your Lord. We have our deeds, and you have yours. There is no contention between us and you. Allah will bring us together, and to Him is the final return.”"
        },
        {
            "verseNumber": 16,
            "verseString": "As for those who argue about God after his acceptance, their argument is null before their Lord, and upon them is wrath, and for them is severe punishment.",
            "verseStringReplacedWithAllah": "As for those who argue about Allah after his acceptance, their argument is null before their Lord, and upon them is wrath, and for them is severe punishment."
        },
        {
            "verseNumber": 17,
            "verseString": "It is God who revealed the Scripture with truth and balance. What would make you realize? Perhaps the Hour is near.",
            "verseStringReplacedWithAllah": "It is Allah who revealed the Scripture with truth and balance. What would make you realize? Perhaps the Hour is near."
        },
        {
            "verseNumber": 18,
            "verseString": "Those who don’t believe in it seek to hasten it, but those who believe are fearful of it, and they know that it’s the truth. Those who dispute about the Hour are indeed in a far misguidance."
        },
        {
            "verseNumber": 19,
            "verseString": "God is kind to His servants. He provides sustenance for whomever He wills. He is the Strong, the Mighty.",
            "verseStringReplacedWithAllah": "Allah is kind to His servants. He provides sustenance for whomever He wills. He is the Strong, the Mighty."
        },
        {
            "verseNumber": 20,
            "verseString": "Whoever desires the harvest of the Hereafter, we will increase for him his yield. And whoever desires the harvest of this world, We will give him some of it, but in the Hereafter he will have no share."
        },
        {
            "verseNumber": 21,
            "verseString": "Or do they have associates who have legislated for them a religion not authorized by God? If not for a conclusive word, judgment would’ve been passed between them. The wrongdoers will face a grievous punishment.",
            "verseStringReplacedWithAllah": "Or do they have associates who have legislated for them a religion not authorized by Allah? If not for a conclusive word, judgment would’ve been passed between them. The wrongdoers will face a grievous punishment."
        },
        {
            "verseNumber": 22,
            "verseString": "You will see the wrongdoers fearful of what they’ve earned, and it will befall them. Yet those who believe and do righteous deeds will be in the meadows of the gardens, receiving whatever they desire from their Lord. This is the greatest bounty."
        },
        {
            "verseNumber": 23,
            "verseString": "God gives this good news to His servants who believe and perform righteous deeds. Say, “I ask no reward from you for it, except affection to kin.” Whoever earns a good deed, We will increase its goodness for him. God is Forgiving and Appreciative.",
            "verseStringReplacedWithAllah": "Allah gives this good news to His servants who believe and perform righteous deeds. Say, “I ask no reward from you for it, except affection to kin.” Whoever earns a good deed, We will increase its goodness for him. Allah is Forgiving and Appreciative."
        },
        {
            "verseNumber": 24,
            "verseString": "Or do they say, “He invented lies about God”? If God willed, He could seal your heart. But God dispels falsehoods and establishes the truth with His words. He is fully aware of what resides within hearts.",
            "verseStringReplacedWithAllah": "Or do they say, “He invented lies about Allah”? If Allah willed, He could seal your heart. But Allah dispels falsehoods and establishes the truth with His words. He is fully aware of what resides within hearts."
        },
        {
            "verseNumber": 25,
            "verseString": "It is He who accepts repentance from His beings, forgives sins and knows what you do."
        },
        {
            "verseNumber": 26,
            "verseString": "He answers those who believe and perform righteous deeds, and increases them from His bounty. But the unbelievers will suffer a harsh punishment."
        },
        {
            "verseNumber": 27,
            "verseString": "If God were to expand the provision for His servants, they would commit excess on earth. But He sends down what He wills in measured amounts. He is All-Seeing and All-Aware of His beings.",
            "verseStringReplacedWithAllah": "If Allah were to expand the provision for His servants, they would commit excess on earth. But He sends down what He wills in measured amounts. He is All-Seeing and All-Aware of His beings."
        },
        {
            "verseNumber": 28,
            "verseString": "It is He who sends down rain after they have lost hope and spreads His mercy. He is the Protector, the Praiseworthy."
        },
        {
            "verseNumber": 29,
            "verseString": "Among His signs are the creation of the heavens and the earth, and the living creatures He has spread within them. And He is capable of gathering them at will."
        },
        {
            "verseNumber": 30,
            "verseString": "Whatever misfortune befalls you is due to your deeds. Yet, He pardons much."
        },
        {
            "verseNumber": 31,
            "verseString": "You can’t escape on earth, and you have no protector or helper besides God.",
            "verseStringReplacedWithAllah": "You can’t escape on earth, and you have no protector or helper besides Allah."
        },
        {
            "verseNumber": 32,
            "verseString": "Among His signs are ships sailing like mountains in the sea."
        },
        {
            "verseNumber": 33,
            "verseString": "If He willed, He could still the wind, leaving them motionless on its surface. In this, there are signs for every patient, grateful person."
        },
        {
            "verseNumber": 34,
            "verseString": "Or He could destroy them because of what they’ve earned, yet He pardons much."
        },
        {
            "verseNumber": 35,
            "verseString": "Those who dispute God’s revelations won’t find any refuge.",
            "verseStringReplacedWithAllah": "Those who dispute Allah’s revelations won’t find any refuge."
        },
        {
            "verseNumber": 36,
            "verseString": "What you’ve been given is merely the enjoyment of the temporal worldly life, but what God possesses is better and more enduring for those who believe and rely on their Lord.",
            "verseStringReplacedWithAllah": "What you’ve been given is merely the enjoyment of the temporal worldly life, but what Allah possesses is better and more enduring for those who believe and rely on their Lord."
        },
        {
            "verseNumber": 37,
            "verseString": "Those who avoid grave sins and indecencies; and when they are angered, they forgive."
        },
        {
            "verseNumber": 38,
            "verseString": "Those who respond to their Lord, perform their prayers, conduct their affairs by mutual consultation, and give from what We provide for them."
        },
        {
            "verseNumber": 39,
            "verseString": "Those who, when tyranny afflicts them, defend themselves."
        },
        {
            "verseNumber": 40,
            "verseString": "The retribution for an evil deed is an equivalent evil. Yet, whoever pardons and reconciles, his reward is with God. He doesn’t love the wrongdoers.",
            "verseStringReplacedWithAllah": "The retribution for an evil deed is an equivalent evil. Yet, whoever pardons and reconciles, his reward is with Allah. He doesn’t love the wrongdoers."
        },
        {
            "verseNumber": 41,
            "verseString": "Those who retaliate after being wronged bear no guilt."
        },
        {
            "verseNumber": 42,
            "verseString": "The guilt lies with those who oppress others and instigate aggression on earth without justice. For them, there is a severe punishment."
        },
        {
            "verseNumber": 43,
            "verseString": "Those who patiently endure and forgive demonstrate fortitude."
        },
        {
            "verseNumber": 44,
            "verseString": "Whomever God misguides will have no protector besides Him. When they face the punishment, you will witness the wrongdoers pleading, “Is there any way to go back?”",
            "verseStringReplacedWithAllah": "Whomever Allah misguides will have no protector besides Him. When they face the punishment, you will witness the wrongdoers pleading, “Is there any way to go back?”"
        },
        {
            "verseNumber": 45,
            "verseString": "You will see them exposed to it, humbled by disgrace, looking with a furtive glance. The believers will say, “The losers are those who lost themselves and their families on Resurrection Day.” Surely, the wrongdoers are in lasting punishment."
        },
        {
            "verseNumber": 46,
            "verseString": "They will have no protectors to aid them other than God. And for whomever God leaves astray, there is no way.",
            "verseStringReplacedWithAllah": "They will have no protectors to aid them other than Allah. And for whomever Allah leaves astray, there is no way."
        },
        {
            "verseNumber": 47,
            "verseString": "Respond to your Lord before a Day from God arrives that can’t be repelled. On that Day, you will have no shelter, and no possibility of denial.",
            "verseStringReplacedWithAllah": "Respond to your Lord before a Day from Allah arrives that can’t be repelled. On that Day, you will have no shelter, and no possibility of denial."
        },
        {
            "verseNumber": 48,
            "verseString": "If they turn away, We didn’t send you as their keeper. Your responsibility is only to deliver the message. When We bestow Our grace on a person, he rejoices in it. And when adversity touches him due to his deeds, man becomes ungrateful."
        },
        {
            "verseNumber": 49,
            "verseString": "To God belongs the sovereignty of the heavens and the earth. He creates whatever He wills. He grants to whom He wills females, and males to whom He wills.",
            "verseStringReplacedWithAllah": "To Allah belongs the sovereignty of the heavens and the earth. He creates whatever He wills. He grants to whom He wills females, and males to whom He wills."
        },
        {
            "verseNumber": 50,
            "verseString": "Or He combines them in pairs, male and female, and He renders whom He wills infertile. He is All-Knowing, Most Capable."
        },
        {
            "verseNumber": 51,
            "verseString": "It is not for any human that God should speak to him, except through revelation, or from behind a veil, or by sending a messenger to reveal, by His permission, what He wills. He is Exalted, Wise.",
            "verseStringReplacedWithAllah": "It is not for any human that Allah should speak to him, except through revelation, or from behind a veil, or by sending a messenger to reveal, by His permission, what He wills. He is Exalted, Wise."
        },
        {
            "verseNumber": 52,
            "verseString": "And thus, We’ve revealed to you an inspiration of Our command. You didn’t know what the Scripture was, nor the faith. But We made it a light, guiding with it whomever We will of Our servants. You are guiding them to a straight path."
        },
        {
            "verseNumber": 53,
            "verseString": "The path of God, to Whom belongs whatever is in the heavens and whatever is on earth. Unquestionably, to God do all matters evolve.",
            "verseStringReplacedWithAllah": "The path of Allah, to Whom belongs whatever is in the heavens and whatever is on earth. Unquestionably, to Allah do all matters evolve."
        }
    ],
    "chapterNumber": 42,
    "nameInEnglish": "Consultation",
    "nameInTransliteration": "Al Shura",
    "nameInArabic": "الشورى",
    "numberOfVerses": 53
}