{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "God heard the plea of the woman who argued with you concerning her husband and brought her complaint to God. God listened to your conversation. God is All-Hearing, All-Seeing.",
            "verseStringReplacedWithAllah": "Allah heard the plea of the woman who argued with you concerning her husband and brought her complaint to Allah. Allah listened to your conversation. Allah is All-Hearing, All-Seeing."
        },
        {
            "verseNumber": 2,
            "verseString": "Among you, those who estrange their wives by equating them with their mothers—they aren’t their mothers. Their mothers are only those who gave birth to them. What they say is unacceptable and false. Nonetheless, God is Pardoning, Forgiving.",
            "verseStringReplacedWithAllah": "Among you, those who estrange their wives by equating them with their mothers—they aren’t their mothers. Their mothers are only those who gave birth to them. What they say is unacceptable and false. Nonetheless, Allah is Pardoning, Forgiving."
        },
        {
            "verseNumber": 3,
            "verseString": "Those who estrange their wives by equating them with their mothers, then retract their statement, must free a captive before they may touch each other. This is what you are admonished by; and God is aware of your actions.",
            "verseStringReplacedWithAllah": "Those who estrange their wives by equating them with their mothers, then retract their statement, must free a captive before they may touch each other. This is what you are admonished by; and Allah is aware of your actions."
        },
        {
            "verseNumber": 4,
            "verseString": "Whoever doesn’t find the means, he must fast for two consecutive months before they may touch each other. If he is unable, then he must feed sixty needy people. This is to affirm your faith in God and His Messenger. These are the limits God sets, and there is a severe punishment for the unbelievers.",
            "verseStringReplacedWithAllah": "Whoever doesn’t find the means, he must fast for two consecutive months before they may touch each other. If he is unable, then he must feed sixty needy people. This is to affirm your faith in Allah and His Messenger. These are the limits Allah sets, and there is a severe punishment for the unbelievers."
        },
        {
            "verseNumber": 5,
            "verseString": "Those who defy God and His Messenger will be subdued, just as those before them were subdued. We revealed clear verses, and for the unbelievers, there is a disgraceful punishment.",
            "verseStringReplacedWithAllah": "Those who defy Allah and His Messenger will be subdued, just as those before them were subdued. We revealed clear verses, and for the unbelievers, there is a disgraceful punishment."
        },
        {
            "verseNumber": 6,
            "verseString": "On the Day God resurrects them all, He will inform them of their deeds. God kept a record of it, even though they forgot it. God is a witness to all things.",
            "verseStringReplacedWithAllah": "On the Day Allah resurrects them all, He will inform them of their deeds. Allah kept a record of it, even though they forgot it. Allah is a witness to all things."
        },
        {
            "verseNumber": 7,
            "verseString": "Are you not aware that God knows everything in the heavens and on earth? No three people converse in secret, but He is their fourth, nor among five, but He is their sixth. Regardless of their number, He is with them wherever they may be. Then, on Resurrection Day, He will inform them of what they did. God is fully aware of everything.",
            "verseStringReplacedWithAllah": "Are you not aware that Allah knows everything in the heavens and on earth? No three people converse in secret, but He is their fourth, nor among five, but He is their sixth. Regardless of their number, He is with them wherever they may be. Then, on Resurrection Day, He will inform them of what they did. Allah is fully aware of everything."
        },
        {
            "verseNumber": 8,
            "verseString": "Didn’t you see those who were forbidden from secret gatherings, yet they persist in what they were prohibited from, and they conspire in sin, aggression, and disobedience to the Messenger? When they come to you, they greet you in a way God didn’t greet you, and they say within themselves, “Why doesn’t God punish us for what we say?” Enough for them is Hell; they will roast in it. What a terrible destination!",
            "verseStringReplacedWithAllah": "Didn’t you see those who were forbidden from secret gatherings, yet they persist in what they were prohibited from, and they conspire in sin, aggression, and disobedience to the Messenger? When they come to you, they greet you in a way Allah didn’t greet you, and they say within themselves, “Why doesn’t Allah punish us for what we say?” Enough for them is Hell; they will roast in it. What a terrible destination!"
        },
        {
            "verseNumber": 9,
            "verseString": "O you who believe, when you converse privately, don’t converse in sin, hostility, and disobedience to the Messenger. Instead, converse in righteousness and piety, and fear God, to whom you will be gathered.",
            "verseStringReplacedWithAllah": "O you who believe, when you converse privately, don’t converse in sin, hostility, and disobedience to the Messenger. Instead, converse in righteousness and piety, and fear Allah, to whom you will be gathered."
        },
        {
            "verseNumber": 10,
            "verseString": "Secret counsels are of Satan, to sadden the believers. Yet, he can’t harm them at all except with God’s permission. So, let the believers put their trust in God.",
            "verseStringReplacedWithAllah": "Secret counsels are of Satan, to sadden the believers. Yet, he can’t harm them at all except with Allah’s permission. So, let the believers put their trust in Allah."
        },
        {
            "verseNumber": 11,
            "verseString": "O you who believe, when it is said to you, “Make room in assemblies”, then do so. God will make room for you. And when asked to disperse, then do so. God elevates in rank those of you who believe and those who are given knowledge. God is fully aware of what you do.",
            "verseStringReplacedWithAllah": "O you who believe, when it is said to you, “Make room in assemblies”, then do so. Allah will make room for you. And when asked to disperse, then do so. Allah elevates in rank those of you who believe and those who are given knowledge. Allah is fully aware of what you do."
        },
        {
            "verseNumber": 12,
            "verseString": "O you who believe, when you wish to have a private conversation with the Messenger, precede your private consultation with a charity. This is better and purer for you. However, if you lack the means, God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "O you who believe, when you wish to have a private conversation with the Messenger, precede your private consultation with a charity. This is better and purer for you. However, if you lack the means, Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 13,
            "verseString": "Are you reluctant to offer charity before your consultation? Since you could not, God has forgiven you. So, establish prayer, give the purifying charity, and obey God and His Messenger. God is fully aware of what you do.",
            "verseStringReplacedWithAllah": "Are you reluctant to offer charity before your consultation? Since you could not, Allah has forgiven you. So, establish prayer, give the purifying charity, and obey Allah and His Messenger. Allah is fully aware of what you do."
        },
        {
            "verseNumber": 14,
            "verseString": "Did you consider those who befriended a people with whom God is angered? They are neither from you nor from them, and they swear falsely while they know.",
            "verseStringReplacedWithAllah": "Did you consider those who befriended a people with whom Allah is angered? They are neither from you nor from them, and they swear falsely while they know."
        },
        {
            "verseNumber": 15,
            "verseString": "God prepared for them a severe punishment. How evil is what they used to do!",
            "verseStringReplacedWithAllah": "Allah prepared for them a severe punishment. How evil is what they used to do!"
        },
        {
            "verseNumber": 16,
            "verseString": "They’ve made their oaths a disguise, and they obstruct others from God’s way. A humiliating punishment awaits them.",
            "verseStringReplacedWithAllah": "They’ve made their oaths a disguise, and they obstruct others from Allah’s way. A humiliating punishment awaits them."
        },
        {
            "verseNumber": 17,
            "verseString": "Their wealth and children won’t avail them against God. They are the inhabitants of the Fire, dwelling there for eternity.",
            "verseStringReplacedWithAllah": "Their wealth and children won’t avail them against Allah. They are the inhabitants of the Fire, dwelling there for eternity."
        },
        {
            "verseNumber": 18,
            "verseString": "On the Day when God will resurrect them all, they will swear to Him as they swear to you, and they think they are upon something. Indeed, they are the liars.",
            "verseStringReplacedWithAllah": "On the Day when Allah will resurrect them all, they will swear to Him as they swear to you, and they think they are upon something. Indeed, they are the liars."
        },
        {
            "verseNumber": 19,
            "verseString": "Satan has gained mastery over them and made them forget the remembrance of God. These are the partisans of Satan. Indeed, the partisans of Satan are the losers.",
            "verseStringReplacedWithAllah": "Satan has gained mastery over them and made them forget the remembrance of Allah. These are the partisans of Satan. Indeed, the partisans of Satan are the losers."
        },
        {
            "verseNumber": 20,
            "verseString": "Those who oppose God and His Messenger will be among the most humiliated.",
            "verseStringReplacedWithAllah": "Those who oppose Allah and His Messenger will be among the most humiliated."
        },
        {
            "verseNumber": 21,
            "verseString": "God has decreed, “I will surely overcome, I and My messengers.” Indeed, God is Strong, Mighty.",
            "verseStringReplacedWithAllah": "Allah has decreed, “I will surely overcome, I and My messengers.” Indeed, Allah is Strong, Mighty."
        },
        {
            "verseNumber": 22,
            "verseString": "You won’t find people who believe in God and the Last Day befriending those who oppose God and His Messenger, even if they are their parents, children, siblings, or kin. In their hearts God has imprinted faith and strengthened them with a spirit from Him. He will admit them into Gardens beneath which rivers flow, where they will dwell forever. God is pleased with them, and they are pleased with Him. These are the Party of God. Surely, the Party of God will be the victors.",
            "verseStringReplacedWithAllah": "You won’t find people who believe in Allah and the Last Day befriending those who oppose Allah and His Messenger, even if they are their parents, children, siblings, or kin. In their hearts Allah has imprinted faith and strengthened them with a spirit from Him. He will admit them into Gardens beneath which rivers flow, where they will dwell forever. Allah is pleased with them, and they are pleased with Him. These are the Party of Allah. Surely, the Party of Allah will be the victors."
        }
    ],
    "chapterNumber": 58,
    "nameInEnglish": "The Argument",
    "nameInTransliteration": "Al Mujadalah",
    "nameInArabic": "الـمجادلـة",
    "numberOfVerses": 22
}