{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Ha. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "This Book is a revelation from God, the Almighty, the All-Wise.",
            "verseStringReplacedWithAllah": "This Book is a revelation from Allah, the Almighty, the All-Wise."
        },
        {
            "verseNumber": 3,
            "verseString": "We didn’t create the heavens, the earth, and all that lies between them except in truth and for a specified term. Yet, those who disbelieve turn away from the warnings they receive."
        },
        {
            "verseNumber": 4,
            "verseString": "Say, “Did you consider those you call upon besides God? Show me what they’ve created on earth, or do they possess a share in the heavens? Bring me a book from before this one, or any vestige of knowledge, if you are truthful.”",
            "verseStringReplacedWithAllah": "Say, “Did you consider those you call upon besides Allah? Show me what they’ve created on earth, or do they possess a share in the heavens? Bring me a book from before this one, or any vestige of knowledge, if you are truthful.”"
        },
        {
            "verseNumber": 5,
            "verseString": "Who is more misguided than one who prays to others besides God—those who won’t respond to them until the Day of Resurrection, and they are oblivious of their prayers?",
            "verseStringReplacedWithAllah": "Who is more misguided than one who prays to others besides Allah—those who won’t respond to them until the Day of Resurrection, and they are oblivious of their prayers?"
        },
        {
            "verseNumber": 6,
            "verseString": "When humanity is gathered, they will become their enemies and deny their worship of them."
        },
        {
            "verseNumber": 7,
            "verseString": "When Our clear verses are presented to them, those who disbelieve say of the truth when it reaches them, “This is obvious sorcery.”"
        },
        {
            "verseNumber": 8,
            "verseString": "Or do they say, “He invented it”? Say, “If I invented it, you have no power to protect me from God. He is fully aware of what you engage in. He is sufficient as a witness between me and you. He is the Forgiving, the Merciful.”",
            "verseStringReplacedWithAllah": "Or do they say, “He invented it”? Say, “If I invented it, you have no power to protect me from Allah. He is fully aware of what you engage in. He is sufficient as a witness between me and you. He is the Forgiving, the Merciful.”"
        },
        {
            "verseNumber": 9,
            "verseString": "Say, “I am not a novelty among the messengers, and I don’t know what will happen to me or to you. I only follow what’s revealed to me and am simply a clear warner.”"
        },
        {
            "verseNumber": 10,
            "verseString": "Say, “Consider, if it’s from God and you reject it, and a witness from the Children of Israel bore witness to the like of it and believed in it; yet you are arrogant. God doesn’t guide the wrongdoing people.”",
            "verseStringReplacedWithAllah": "Say, “Consider, if it’s from Allah and you reject it, and a witness from the Children of Israel bore witness to the like of it and believed in it; yet you are arrogant. Allah doesn’t guide the wrongdoing people.”"
        },
        {
            "verseNumber": 11,
            "verseString": "The unbelievers say of the believers, “If it held any merit, they wouldn’t have preceded us to it.” And since they don’t receive guidance from it, they say, “This is an ancient fabrication.”"
        },
        {
            "verseNumber": 12,
            "verseString": "Before it, the Scripture of Moses, as a guide and a mercy. And this is a confirming Scripture, in the Arabic language, to warn those who do wrong, and as good news to the doers of good."
        },
        {
            "verseNumber": 13,
            "verseString": "Those who say, “Our Lord is God,” and then go straight, will have no fear, nor will they grieve.",
            "verseStringReplacedWithAllah": "Those who say, “Our Lord is Allah,” and then go straight, will have no fear, nor will they grieve."
        },
        {
            "verseNumber": 14,
            "verseString": "These are the inhabitants of Paradise, dwelling therein eternally, as a reward for their deeds."
        },
        {
            "verseNumber": 15,
            "verseString": "We commanded the human being to care for his parents. His mother bore him with hardship and gave birth to him with hardship. His pregnancy and nursing total thirty months. When he reaches his prime at forty, he prays, “My Lord, grant me the ability to be grateful for the blessings You’ve bestowed upon me and upon my parents, and to perform righteous deeds that please You. And make my offspring virtuous. I turn to You in repentance, and I am among those who submit.”"
        },
        {
            "verseNumber": 16,
            "verseString": "These are the ones from whom We accept the best of what they did, and whose misdeeds We overlook—among the inhabitants of Paradise. The true promise which they had been promised."
        },
        {
            "verseNumber": 17,
            "verseString": "However, the one who says to his parents, “Enough of you! Are you threatening me with resurrection, even though generations have passed before me?” And they both appeal to God for help, “Woe to you! Believe! The promise of God is true!” Yet, he replies, “This is nothing but tales of the ancients.”",
            "verseStringReplacedWithAllah": "However, the one who says to his parents, “Enough of you! Are you threatening me with resurrection, even though generations have passed before me?” And they both appeal to Allah for help, “Woe to you! Believe! The promise of Allah is true!” Yet, he replies, “This is nothing but tales of the ancients.”"
        },
        {
            "verseNumber": 18,
            "verseString": "Such individuals are on par with the previous generations of jinn and humans; they are the losers."
        },
        {
            "verseNumber": 19,
            "verseString": "Everyone will be ranked according to their deeds, so that He may fully compensate them for their deeds, and they won’t be wronged."
        },
        {
            "verseNumber": 20,
            "verseString": "On the Day when those who disbelieved are presented before the Fire: “You used up your good things during your worldly life and enjoyed them. So today, you will receive a shameful punishment for your unwarranted arrogance on earth and due to your sinful deeds.”"
        },
        {
            "verseNumber": 21,
            "verseString": "Mention the brother of Aad, when he warned his people amidst the dunes. Numerous warners had come before and after him, saying, “worship only God; I fear for you the punishment of a momentous day.”"
        },
        {
            "verseNumber": 22,
            "verseString": "They responded, “Did you come to steer us away from our gods? So bring us what you promise us, if you are truthful."
        },
        {
            "verseNumber": 23,
            "verseString": "He replied, “The knowledge of that is with God alone, and I only convey to you what I was sent with. But I see that you are a people behaving ignorantly.”",
            "verseStringReplacedWithAllah": "He replied, “The knowledge of that is with Allah alone, and I only convey to you what I was sent with. But I see that you are a people behaving ignorantly.”"
        },
        {
            "verseNumber": 24,
            "verseString": "When they saw a cloud approaching their valleys, they exclaimed, “This cloud will bring us rain!” But it was what they had requested: a storm wind in which is painful punishment."
        },
        {
            "verseNumber": 25,
            "verseString": "It destroyed everything by the command of its Lord. By morning, nothing could be seen, except their dwellings. Thus We recompense the guilty people."
        },
        {
            "verseNumber": 26,
            "verseString": "We had empowered them, just as We empowered you, giving them hearing, sight, and intellect. However, their hearing, sight, and intellect availed them not when they rejected God’s signs. And they were surrounded by what they used to mock.",
            "verseStringReplacedWithAllah": "We had empowered them, just as We empowered you, giving them hearing, sight, and intellect. However, their hearing, sight, and intellect availed them not when they rejected Allah’s signs. And they were surrounded by what they used to mock."
        },
        {
            "verseNumber": 27,
            "verseString": "We’ve destroyed communities around you, and We displayed various signs, so they may return."
        },
        {
            "verseNumber": 28,
            "verseString": "Why then didn’t those whom they took to draw them closer to God come to their aid? They abandoned them, for they were merely their own fabrication.",
            "verseStringReplacedWithAllah": "Why then didn’t those whom they took to draw them closer to Allah come to their aid? They abandoned them, for they were merely their own fabrication."
        },
        {
            "verseNumber": 29,
            "verseString": "When We sent a group of jinn towards you, listened to the Quran. Upon their arrival, they said to each other, “Pay attention!” When the recitation was completed, they went back to their own people as warners."
        },
        {
            "verseNumber": 30,
            "verseString": "They declared, “O our people, we’ve heard a scripture revealed after Moses; it confirms what preceded it; it guides to the truth and to a straight path."
        },
        {
            "verseNumber": 31,
            "verseString": "O our people, Respond to God’s caller, and have faith in Him. He will absolve you of your sins and shield you from a painful punishment.”",
            "verseStringReplacedWithAllah": "O our people, Respond to Allah’s caller, and have faith in Him. He will absolve you of your sins and shield you from a painful punishment.”"
        },
        {
            "verseNumber": 32,
            "verseString": "Those who don’t respond to God’s call can’t escape on earth, nor will they have any protectors besides Him. Such are clearly in misguidance.",
            "verseStringReplacedWithAllah": "Those who don’t respond to Allah’s call can’t escape on earth, nor will they have any protectors besides Him. Such are clearly in misguidance."
        },
        {
            "verseNumber": 33,
            "verseString": "Don’t they realize that God, who created the heavens and the earth, and was not tired by their creation, is able to give life to the dead? Indeed, He has power over everything.",
            "verseStringReplacedWithAllah": "Don’t they realize that Allah, who created the heavens and the earth, and was not tired by their creation, is able to give life to the dead? Indeed, He has power over everything."
        },
        {
            "verseNumber": 34,
            "verseString": "On the Day when those who disbelieved are presented before the Fire: “Isn’t this real?” They will answer, “Yes, by our Lord.” He will then say, “So taste the punishment because you disbelieved.”"
        },
        {
            "verseNumber": 35,
            "verseString": "Therefore, endure with patience, as did the messengers of strong will, and don’t be hasty regarding them. On the Day they witness what they were warned about, it will appear to them as if they had stayed only for an hour of a day. This is a message to be delivered: will any be destroyed except the defiantly disobedient people?"
        }
    ],
    "chapterNumber": 46,
    "nameInEnglish": "The Dunes",
    "nameInTransliteration": "Al Ahqaf",
    "nameInArabic": "الأحقاف",
    "numberOfVerses": 35
}