{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "This Book is a divine revelation from God, the Almighty, the Wise.",
            "verseStringReplacedWithAllah": "This Book is a divine revelation from Allah, the Almighty, the Wise."
        },
        {
            "verseNumber": 2,
            "verseString": "We revealed to you the Book of Truth. Therefore, worship God, dedicating your religion to Him alone.",
            "verseStringReplacedWithAllah": "We revealed to you the Book of Truth. Therefore, worship Allah, dedicating your religion to Him alone."
        },
        {
            "verseNumber": 3,
            "verseString": "Isn’t exclusive devotion due to God? Those who take protectors besides Him say, “We worship them only to bring us closer to God.” God will judge their differences. God doesn’t guide the lying disbeliever.",
            "verseStringReplacedWithAllah": "Isn’t exclusive devotion due to Allah? Those who take protectors besides Him say, “We worship them only to bring us closer to Allah.” Allah will judge their differences. Allah doesn’t guide the lying disbeliever."
        },
        {
            "verseNumber": 4,
            "verseString": "If God had intended to take a child, He could’ve chosen what He willed from His creation. Glory be to Him! He is God, the One, the Overpowering.",
            "verseStringReplacedWithAllah": "If Allah had intended to take a child, He could’ve chosen what He willed from His creation. Glory be to Him! He is Allah, the One, the Overpowering."
        },
        {
            "verseNumber": 5,
            "verseString": "He created the heavens and the earth with purpose. He wraps the night over the day, and He wraps the day over the night. He subjected the sun and the moon, each running for a predetermined period. He is the Almighty, the Forgiving."
        },
        {
            "verseNumber": 6,
            "verseString": "He created you from a single soul. Then, from it, He formed its mate. He sent down eight pairs of livestock for you. He formed you within your mothers’ wombs in successive stages, within a triple darkness. Such is God, your Lord; His is the sovereignty. There is no god but Him, so why do you deviate?",
            "verseStringReplacedWithAllah": "He created you from a single soul. Then, from it, He formed its mate. He sent down eight pairs of livestock for you. He formed you within your mothers’ wombs in successive stages, within a triple darkness. Such is Allah, your Lord; His is the sovereignty. There is no god but Him, so why do you deviate?"
        },
        {
            "verseNumber": 7,
            "verseString": "If you are ungrateful, God doesn’t need you. Yet, He doesn’t approve of ingratitude from His beings. If you are grateful, He is pleased with you. No bearer of burdens can bear the burdens of another. Ultimately, your return is to your Lord, who will inform you of everything you did. He knows the secrets within the hearts.",
            "verseStringReplacedWithAllah": "If you are ungrateful, Allah doesn’t need you. Yet, He doesn’t approve of ingratitude from His beings. If you are grateful, He is pleased with you. No bearer of burdens can bear the burdens of another. Ultimately, your return is to your Lord, who will inform you of everything you did. He knows the secrets within the hearts."
        },
        {
            "verseNumber": 8,
            "verseString": "When adversity befalls a person, he earnestly prays to his Lord. Yet, when He bestows a favor upon him from Himself, he forgets his previous appeal, attributing rivals to God, leading others astray from His path. Say, “Enjoy your denial for a little while; you are among the inmates of the Fire.”",
            "verseStringReplacedWithAllah": "When adversity befalls a person, he earnestly prays to his Lord. Yet, when He bestows a favor upon him from Himself, he forgets his previous appeal, attributing rivals to Allah, leading others astray from His path. Say, “Enjoy your denial for a little while; you are among the inmates of the Fire.”"
        },
        {
            "verseNumber": 9,
            "verseString": "Can he who worships devoutly in the watches of the night, prostrating himself and standing in prayer, fearing the Hereafter and hoping for the mercy of his Lord, be like the one who does not? Say, “Could those who know be equal to those who don’t know?” Only those endowed with understanding will take heed."
        },
        {
            "verseNumber": 10,
            "verseString": "Tell My faithful servants always to be mindful of their Lord. For those who do good in this world, there is goodness. God’s earth is vast, and the patient will be given their rewards without account.",
            "verseStringReplacedWithAllah": "Tell My faithful servants always to be mindful of their Lord. For those who do good in this world, there is goodness. Allah’s earth is vast, and the patient will be given their rewards without account."
        },
        {
            "verseNumber": 11,
            "verseString": "Say, “I am commanded to worship God, dedicating my faith entirely to Him.",
            "verseStringReplacedWithAllah": "Say, “I am commanded to worship Allah, dedicating my faith entirely to Him."
        },
        {
            "verseNumber": 12,
            "verseString": "And I am also commanded to be the first of the Submitters.”"
        },
        {
            "verseNumber": 13,
            "verseString": "Say, “I fear the punishment of a formidable Day should I disobey my Lord.”"
        },
        {
            "verseNumber": 14,
            "verseString": "Say, “I worship God, dedicating my religion purely to Him.”",
            "verseStringReplacedWithAllah": "Say, “I worship Allah, dedicating my religion purely to Him.”"
        },
        {
            "verseNumber": 15,
            "verseString": "“So, worship whatever you want besides Him.” Say, “The losers are those who lose themselves and their families on Resurrection Day.” Most certainly, that’s the most significant loss."
        },
        {
            "verseNumber": 16,
            "verseString": "Upon them are layers of fire, and beneath them are layers. This is how God instills fear into His beings. “O My beings, be mindful of Me.”",
            "verseStringReplacedWithAllah": "Upon them are layers of fire, and beneath them are layers. This is how Allah instills fear into His beings. “O My beings, be mindful of Me.”"
        },
        {
            "verseNumber": 17,
            "verseString": "As for those who shun false worship and turn in repentance to God, for them are glad tidings. So, give good news to My servants.",
            "verseStringReplacedWithAllah": "As for those who shun false worship and turn in repentance to Allah, for them are glad tidings. So, give good news to My servants."
        },
        {
            "verseNumber": 18,
            "verseString": "Those who listen to the word and follow the best of it are the ones whom God has guided, and they are the ones blessed with discernment.",
            "verseStringReplacedWithAllah": "Those who listen to the word and follow the best of it are the ones whom Allah has guided, and they are the ones blessed with discernment."
        },
        {
            "verseNumber": 19,
            "verseString": "As for those who deserve the punishment—can you save those who are in the Fire?"
        },
        {
            "verseNumber": 20,
            "verseString": "Yet, those who revere their Lord will have lofts, constructed one above another, beneath which rivers flow. This is the promise of God, God does not fail in His promise.",
            "verseStringReplacedWithAllah": "Yet, those who revere their Lord will have lofts, constructed one above another, beneath which rivers flow. This is the promise of Allah, Allah does not fail in His promise."
        },
        {
            "verseNumber": 21,
            "verseString": "Don’t you see how God sends down water from the sky, seeping into the earth to form springs? Through them, He produces crops of different colors. Then they wither, and you see them turn yellow, before He reduces them to chaff. In that is a reminder for those who have understanding.",
            "verseStringReplacedWithAllah": "Don’t you see how Allah sends down water from the sky, seeping into the earth to form springs? Through them, He produces crops of different colors. Then they wither, and you see them turn yellow, before He reduces them to chaff. In that is a reminder for those who have understanding."
        },
        {
            "verseNumber": 22,
            "verseString": "Consider the one whose heart God has opened to Submission, thus receiving enlightenment from his Lord. Woe to those whose hearts have hardened against God’s remembrance—those are in obvious error.",
            "verseStringReplacedWithAllah": "Consider the one whose heart Allah has opened to Submission, thus receiving enlightenment from his Lord. Woe to those whose hearts have hardened against Allah’s remembrance—those are in obvious error."
        },
        {
            "verseNumber": 23,
            "verseString": "God revealed the most excellent message: a book consistent in its teachings, offering repeated reinforcement and serving as a reminder. The skins of those who revere their Lord shiver due to it. Then, their skins and hearts soften to God’s remembrance. This is God’s guidance, through which He guides whom He wills. But he whom God leaves to stray has no guide.",
            "verseStringReplacedWithAllah": "Allah revealed the most excellent message: a book consistent in its teachings, offering repeated reinforcement and serving as a reminder. The skins of those who revere their Lord shiver due to it. Then, their skins and hearts soften to Allah’s remembrance. This is Allah’s guidance, through which He guides whom He wills. But he whom Allah leaves to stray has no guide."
        },
        {
            "verseNumber": 24,
            "verseString": "What about the person who shields his face from the terrible suffering on Resurrection Day? To the evildoers, it will be said, “Taste what you’ve earned.”"
        },
        {
            "verseNumber": 25,
            "verseString": "Those before them also denied, so the punishment befell them from where they were unaware."
        },
        {
            "verseNumber": 26,
            "verseString": "Thus, God made them taste disgrace in this worldly life, but the punishment of the Hereafter is indeed greater—if only they knew.",
            "verseStringReplacedWithAllah": "Thus, Allah made them taste disgrace in this worldly life, but the punishment of the Hereafter is indeed greater—if only they knew."
        },
        {
            "verseNumber": 27,
            "verseString": "In this Quran, We present various parables for people to ponder."
        },
        {
            "verseNumber": 28,
            "verseString": "A Quran in Arabic, without any discrepancy, so they may become cautious."
        },
        {
            "verseNumber": 29,
            "verseString": "God presents an example of a man having quarreling partners and another man entirely belonging to one man. Can they be considered equal? Praise be to God! Yet, most of them don’t understand.",
            "verseStringReplacedWithAllah": "Allah presents an example of a man having quarreling partners and another man entirely belonging to one man. Can they be considered equal? Praise be to Allah! Yet, most of them don’t understand."
        },
        {
            "verseNumber": 30,
            "verseString": "You will surely die, and they, too, will die."
        },
        {
            "verseNumber": 31,
            "verseString": "Then, on Resurrection Day, you will dispute in the presence of your Lord."
        },
        {
            "verseNumber": 32,
            "verseString": "Who could be more unjust than the one who fabricates lies about God and denies the truth when it reaches him? Isn’t there a dwelling in Hell for the unbelievers?",
            "verseStringReplacedWithAllah": "Who could be more unjust than the one who fabricates lies about Allah and denies the truth when it reaches him? Isn’t there a dwelling in Hell for the unbelievers?"
        },
        {
            "verseNumber": 33,
            "verseString": "Yet, those who brought the truth and believed in it—these are the righteous ones."
        },
        {
            "verseNumber": 34,
            "verseString": "They will have all that they desire with their Lord. That’s the reward of the good-doers."
        },
        {
            "verseNumber": 35,
            "verseString": "God will absolve them of their worst deeds, and He will reward them according to their best deeds.",
            "verseStringReplacedWithAllah": "Allah will absolve them of their worst deeds, and He will reward them according to their best deeds."
        },
        {
            "verseNumber": 36,
            "verseString": "Isn’t God sufficient for His servant? They threaten you with those other than Him. Whomever God allows to stray has no guide.",
            "verseStringReplacedWithAllah": "Isn’t Allah sufficient for His servant? They threaten you with those other than Him. Whomever Allah allows to stray has no guide."
        },
        {
            "verseNumber": 37,
            "verseString": "And whomever God guides—there is none to lead him astray. Isn’t God the Almighty, the Avenger?",
            "verseStringReplacedWithAllah": "And whomever Allah guides—there is none to lead him astray. Isn’t Allah the Almighty, the Avenger?"
        },
        {
            "verseNumber": 38,
            "verseString": "If you were to ask them, “Who created the heavens and the earth?” They would surely answer, “God.” Then, ask, “Did you consider those you call upon besides God? If God intends harm for me, would they lift His harm from me? Or if He intends mercy for me, would they withhold His mercy?” Say, “God suffices me; in Him trust those who put their trust.”",
            "verseStringReplacedWithAllah": "If you were to ask them, “Who created the heavens and the earth?” They would surely answer, “Allah.” Then, ask, “Did you consider those you call upon besides Allah? If Allah intends harm for me, would they lift His harm from me? Or if He intends mercy for me, would they withhold His mercy?” Say, “Allah suffices me; in Him trust those who put their trust.”"
        },
        {
            "verseNumber": 39,
            "verseString": "Say, “O my people, continue doing whatever you are doing, just as I am. You will soon come to know."
        },
        {
            "verseNumber": 40,
            "verseString": "To whom a punishment comes that disgraces him, on whom an enduring torment descends.”"
        },
        {
            "verseNumber": 41,
            "verseString": "We revealed to you the Book for mankind in truth. Whoever follows guidance does so for his good, and whoever goes astray does so to his own loss. You are not responsible for them."
        },
        {
            "verseNumber": 42,
            "verseString": "God takes the souls at the time of their death and those that haven’t died in their sleep. He retains those for whom death was decreed, and He sends the others back until their appointed time. In this are signs for those who reflect.",
            "verseStringReplacedWithAllah": "Allah takes the souls at the time of their death and those that haven’t died in their sleep. He retains those for whom death was decreed, and He sends the others back until their appointed time. In this are signs for those who reflect."
        },
        {
            "verseNumber": 43,
            "verseString": "Or have they taken besides God intercessors? Say, “Even though they don’t possess anything, nor do they reason?”",
            "verseStringReplacedWithAllah": "Or have they taken besides Allah intercessors? Say, “Even though they don’t possess anything, nor do they reason?”"
        },
        {
            "verseNumber": 44,
            "verseString": "Say, “All intercession belongs exclusively to God. His is the dominion over the heavens and the earth. To Him, you will be returned.”",
            "verseStringReplacedWithAllah": "Say, “All intercession belongs exclusively to Allah. His is the dominion over the heavens and the earth. To Him, you will be returned.”"
        },
        {
            "verseNumber": 45,
            "verseString": "And when God is mentioned alone, the hearts of those who don’t believe in the Hereafter shrink with aversion, but when those other than Him are mentioned, immediately they rejoice.",
            "verseStringReplacedWithAllah": "And when Allah is mentioned alone, the hearts of those who don’t believe in the Hereafter shrink with aversion, but when those other than Him are mentioned, immediately they rejoice."
        },
        {
            "verseNumber": 46,
            "verseString": "Say: “O God, Originator of the heavens and the earth, Knower of the unseen and the witnessed, You will arbitrate among Your servants regarding their disputes.”",
            "verseStringReplacedWithAllah": "Say: “O Allah, Originator of the heavens and the earth, Knower of the unseen and the witnessed, You will arbitrate among Your servants regarding their disputes.”"
        },
        {
            "verseNumber": 47,
            "verseString": "If the wrongdoers possessed everything on earth, and twice as much, they would surely offer it to ransom themselves from the horrific punishment on Resurrection Day. And there will come to them, from God, what they had not been counting on.",
            "verseStringReplacedWithAllah": "If the wrongdoers possessed everything on earth, and twice as much, they would surely offer it to ransom themselves from the horrific punishment on Resurrection Day. And there will come to them, from Allah, what they had not been counting on."
        },
        {
            "verseNumber": 48,
            "verseString": "They will be confronted with the bad outcomes of their actions, and what they used to ridicule will come back to haunt them."
        },
        {
            "verseNumber": 49,
            "verseString": "When adversity touches a person, he implores Us. But when We bestow a favor upon him, he says, “I acquired this through my knowledge and skill.” Indeed, it is just a trial, but most of them don’t realize."
        },
        {
            "verseNumber": 50,
            "verseString": "Those who preceded them said the same, but their ill-gotten gains availed them not."
        },
        {
            "verseNumber": 51,
            "verseString": "The repercussions of their evil deeds overwhelmed them, and the wrongdoers of this era will also face the consequences of their actions, from which they can’t escape."
        },
        {
            "verseNumber": 52,
            "verseString": "Don’t they realize that God expands the provision for whom He wills and restricts it as well? In this are signs for people of faith.",
            "verseStringReplacedWithAllah": "Don’t they realize that Allah expands the provision for whom He wills and restricts it as well? In this are signs for people of faith."
        },
        {
            "verseNumber": 53,
            "verseString": "Say, “O my servants who have transgressed against yourselves: Don’t despair of God’s mercy, God forgives all sins. It is He who is the Merciful, the Forgiving.”",
            "verseStringReplacedWithAllah": "Say, “O my servants who have transgressed against yourselves: Don’t despair of Allah’s mercy, Allah forgives all sins. It is He who is the Merciful, the Forgiving.”"
        },
        {
            "verseNumber": 54,
            "verseString": "Return with wholehearted repentance to your Lord, and submit yourselves completely to Him, before the suffering befalls you, after which you won’t be helped."
        },
        {
            "verseNumber": 55,
            "verseString": "Adhere to the best of what was revealed to you from your Lord, before the punishment engulfs you unexpectedly."
        },
        {
            "verseNumber": 56,
            "verseString": "Lest a soul should lament, “Alas, I have neglected my duty towards God and was among the mockers.”",
            "verseStringReplacedWithAllah": "Lest a soul should lament, “Alas, I have neglected my duty towards Allah and was among the mockers.”"
        },
        {
            "verseNumber": 57,
            "verseString": "Or it may say, “Had God guided me, I would’ve been among the righteous.”",
            "verseStringReplacedWithAllah": "Or it may say, “Had Allah guided me, I would’ve been among the righteous.”"
        },
        {
            "verseNumber": 58,
            "verseString": "Or, it may say when it sees the penalty: “If only I had another chance, I would be among those who do good.”"
        },
        {
            "verseNumber": 59,
            "verseString": "But, indeed, My signs came to you, but you denied them, were arrogant, and became a disbeliever."
        },
        {
            "verseNumber": 60,
            "verseString": "On the Day of Resurrection, you will see those who told lies about God, their faces blackened. Is not in Hell a residence for the arrogant?",
            "verseStringReplacedWithAllah": "On the Day of Resurrection, you will see those who told lies about Allah, their faces blackened. Is not in Hell a residence for the arrogant?"
        },
        {
            "verseNumber": 61,
            "verseString": "God will deliver the righteous to their destined haven—no harm will touch them, nor will they grieve.",
            "verseStringReplacedWithAllah": "Allah will deliver the righteous to their destined haven—no harm will touch them, nor will they grieve."
        },
        {
            "verseNumber": 62,
            "verseString": "God is the Creator of all things, and He is, over all things, Disposer of affairs.",
            "verseStringReplacedWithAllah": "Allah is the Creator of all things, and He is, over all things, Disposer of affairs."
        },
        {
            "verseNumber": 63,
            "verseString": "To Him belong the keys of the heavens and the earth. Those who deny God’s verses are the losers.",
            "verseStringReplacedWithAllah": "To Him belong the keys of the heavens and the earth. Those who deny Allah’s verses are the losers."
        },
        {
            "verseNumber": 64,
            "verseString": "Say, “Do you instruct me to worship someone other than God, O ignorant people?”",
            "verseStringReplacedWithAllah": "Say, “Do you instruct me to worship someone other than Allah, O ignorant people?”"
        },
        {
            "verseNumber": 65,
            "verseString": "It was revealed to you and those before you that if you associate, your deeds will be nullified, and you will be among the losers."
        },
        {
            "verseNumber": 66,
            "verseString": "Rather, worship God alone, and be among the thankful.",
            "verseStringReplacedWithAllah": "Rather, worship Allah alone, and be among the thankful."
        },
        {
            "verseNumber": 67,
            "verseString": "They can’t grasp the full extent of God’s greatness. The entire earth will be His handful on the Day of Resurrection, and the heaven will be folded in His right hand. Glorified is He, and High above what they associate with Him.",
            "verseStringReplacedWithAllah": "They can’t grasp the full extent of Allah’s greatness. The entire earth will be His handful on the Day of Resurrection, and the heaven will be folded in His right hand. Glorified is He, and High above what they associate with Him."
        },
        {
            "verseNumber": 68,
            "verseString": "The Trumpet will be blown, and whoever is in the heavens and in the earth will be struck with terror, except whom God wills. Then it will be sounded again, and at once they will be standing, looking on.",
            "verseStringReplacedWithAllah": "The Trumpet will be blown, and whoever is in the heavens and in the earth will be struck with terror, except whom Allah wills. Then it will be sounded again, and at once they will be standing, looking on."
        },
        {
            "verseNumber": 69,
            "verseString": "And the earth will shine with the light of its Lord, and the Record will be placed. The prophets and witnesses will be brought forward, judgment will be passed among them in truth, and they won’t be wronged."
        },
        {
            "verseNumber": 70,
            "verseString": "And every soul will be fully compensated for what it has done. He is well aware of what they do."
        },
        {
            "verseNumber": 71,
            "verseString": "The unbelievers will be driven to Hell in groups, until, when they reach it, its gates are opened, and its keepers will say to them, “Did not messengers come to you from yourselves, reciting to you the verses of your Lord and warning you of the meeting of this Day of yours?” They will say, “Yes, but the decree of punishment has been justified against the unbelievers.”"
        },
        {
            "verseNumber": 72,
            "verseString": "It will be said, “Enter the gates of Hell, to dwell therein forever.” Wretched is the dwelling of the arrogant!"
        },
        {
            "verseNumber": 73,
            "verseString": "Those who revered their Lord will be led in groups towards Paradise. When they near it, its gates will be opened, and its keepers will greet them: “Peace be upon you, you’ve been good; so enter here, to dwell forever.”"
        },
        {
            "verseNumber": 74,
            "verseString": "They will say, “Praise be to God, who fulfilled His promise to us and made us inherit this land, allowing us to settle in Paradise wherever we wish. How splendid is the reward of the workers.”",
            "verseStringReplacedWithAllah": "They will say, “Praise be to Allah, who fulfilled His promise to us and made us inherit this land, allowing us to settle in Paradise wherever we wish. How splendid is the reward of the workers.”"
        },
        {
            "verseNumber": 75,
            "verseString": "You will see the angels surrounding the Throne, glorifying their Lord with praises. And it was judged between them in truth, and it will be said, “Praise be to God, the Lord of the universes.”",
            "verseStringReplacedWithAllah": "You will see the angels surrounding the Throne, glorifying their Lord with praises. And it was judged between them in truth, and it will be said, “Praise be to Allah, the Lord of the universes.”"
        }
    ],
    "chapterNumber": 39,
    "nameInEnglish": "The Crowds",
    "nameInTransliteration": "Az Zumar",
    "nameInArabic": "الزمر",
    "numberOfVerses": 75
}