{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Those who disbelieve and hinder others from God’s path—He leads their deeds astray.",
            "verseStringReplacedWithAllah": "Those who disbelieve and hinder others from Allah’s path—He leads their deeds astray."
        },
        {
            "verseNumber": 2,
            "verseString": "Those who believe, perform good deeds, and have faith in what has been revealed to Muhammad—which is the truth from their Lord—He removes their sins and heals their minds."
        },
        {
            "verseNumber": 3,
            "verseString": "This is because those who disbelieve pursue falsehood, while the believers adhere to the truth from their Lord. Thus, God presents to people their respective examples.",
            "verseStringReplacedWithAllah": "This is because those who disbelieve pursue falsehood, while the believers adhere to the truth from their Lord. Thus, Allah presents to people their respective examples."
        },
        {
            "verseNumber": 4,
            "verseString": "When you confront the unbelievers, strike the necks. Once you’ve thoroughly subdued them, tighten their bonds. Then, release them graciously or after obtaining a ransom—until the war lays down its burdens. If God had willed, He could’ve taken vengeance on them Himself, but He tests some of you through others. Those who are killed in God’s cause, He won’t let their deeds be wasted.",
            "verseStringReplacedWithAllah": "When you confront the unbelievers, strike the necks. Once you’ve thoroughly subdued them, tighten their bonds. Then, release them graciously or after obtaining a ransom—until the war lays down its burdens. If Allah had willed, He could’ve taken vengeance on them Himself, but He tests some of you through others. Those who are killed in Allah’s cause, He won’t let their deeds be wasted."
        },
        {
            "verseNumber": 5,
            "verseString": "He will guide them and heal their minds."
        },
        {
            "verseNumber": 6,
            "verseString": "And He will admit them into Paradise, which He made known to them."
        },
        {
            "verseNumber": 7,
            "verseString": "O you who believe, if you support God, He will help you and solidify your foothold.",
            "verseStringReplacedWithAllah": "O you who believe, if you support Allah, He will help you and solidify your foothold."
        },
        {
            "verseNumber": 8,
            "verseString": "But those who disbelieve, for them is ruin, and He will invalidate their actions."
        },
        {
            "verseNumber": 9,
            "verseString": "This is because they detest what God revealed, so He invalidates their deeds.",
            "verseStringReplacedWithAllah": "This is because they detest what Allah revealed, so He invalidates their deeds."
        },
        {
            "verseNumber": 10,
            "verseString": "Didn’t they travel through the earth and observe the fate of those before them? God poured destruction upon them, and for the unbelievers is a similar fate.",
            "verseStringReplacedWithAllah": "Didn’t they travel through the earth and observe the fate of those before them? Allah poured destruction upon them, and for the unbelievers is a similar fate."
        },
        {
            "verseNumber": 11,
            "verseString": "This is because God is the Protector of those who believe, while the unbelievers have no protector.",
            "verseStringReplacedWithAllah": "This is because Allah is the Protector of those who believe, while the unbelievers have no protector."
        },
        {
            "verseNumber": 12,
            "verseString": "God will admit those who believe and do righteous deeds into Gardens through which rivers flow. But those who disbelieve, they enjoy themselves and eat as animals eat. Their final dwelling is the Fire.",
            "verseStringReplacedWithAllah": "Allah will admit those who believe and do righteous deeds into Gardens through which rivers flow. But those who disbelieve, they enjoy themselves and eat as animals eat. Their final dwelling is the Fire."
        },
        {
            "verseNumber": 13,
            "verseString": "How many a city, stronger than your city which expelled you, did We demolish? And there was no helper for them."
        },
        {
            "verseNumber": 14,
            "verseString": "Is he who stands on clear proof from his Lord, like those whose evil deeds are made attractive to them, and they follow their desires?"
        },
        {
            "verseNumber": 15,
            "verseString": "The portrayal of Paradise promised to the righteous is where rivers of water never alter, and rivers of milk that never change its taste, and rivers of wine pleasurable to those who drink, and rivers of purified honey. They will have all kinds of fruits, as well as forgiveness from their Lord. Can this be compared to one who will dwell eternally in the Fire, forced to drink scalding water that tears their intestines apart?"
        },
        {
            "verseNumber": 16,
            "verseString": "Some of them listen to you. But when they leave your presence, they ask those endowed with knowledge, “What did he just say?” These are the ones God has set a seal on their hearts, and they follow their own desires.",
            "verseStringReplacedWithAllah": "Some of them listen to you. But when they leave your presence, they ask those endowed with knowledge, “What did he just say?” These are the ones Allah has set a seal on their hearts, and they follow their own desires."
        },
        {
            "verseNumber": 17,
            "verseString": "As for those who are guided, He increases their guidance and grants them their righteousness."
        },
        {
            "verseNumber": 18,
            "verseString": "Are they waiting for the Hour to come upon them suddenly? Its signs have already appeared. Once it is upon them, what good will their reminder be?"
        },
        {
            "verseNumber": 19,
            "verseString": "Seek forgiveness for your sins and the believing men and women. God knows your movements and your resting places.",
            "verseStringReplacedWithAllah": "Seek forgiveness for your sins and the believing men and women. Allah knows your movements and your resting places."
        },
        {
            "verseNumber": 20,
            "verseString": "Those who believe say, “If only a chapter were revealed.” Yet, when a decisive chapter is revealed, and fighting is mentioned in it, you see those with a sickness in their hearts staring at you, as though they are on the verge of death. It would’ve been better for them."
        },
        {
            "verseNumber": 21,
            "verseString": "Obedience and truthful speech. Once the matter has been finalized—if they were sincere to God, it would’ve been better for them.",
            "verseStringReplacedWithAllah": "Obedience and truthful speech. Once the matter has been finalized—if they were sincere to Allah, it would’ve been better for them."
        },
        {
            "verseNumber": 22,
            "verseString": "However, if you turn away, you risk causing corruption on earth and severing your familial ties."
        },
        {
            "verseNumber": 23,
            "verseString": "These are the ones God has cursed, so He deafened them and blinded their sight.",
            "verseStringReplacedWithAllah": "These are the ones Allah has cursed, so He deafened them and blinded their sight."
        },
        {
            "verseNumber": 24,
            "verseString": "Don’t they ponder over the Quran? Or are there locks upon the hearts?"
        },
        {
            "verseNumber": 25,
            "verseString": "Those who revert after guidance has become clear to them—Satan has enticed and given them latitude."
        },
        {
            "verseNumber": 26,
            "verseString": "That is because they said to those who hated what God revealed, “We will obey you in some matters.” And God knows their secrets.",
            "verseStringReplacedWithAllah": "That is because they said to those who hated what Allah revealed, “We will obey you in some matters.” And Allah knows their secrets."
        },
        {
            "verseNumber": 27,
            "verseString": "How will it be, when the angels take them in death, beating their faces and their backs."
        },
        {
            "verseNumber": 28,
            "verseString": "This is because they pursued what angers God, and they hated His approval, so He nullified their deeds.",
            "verseStringReplacedWithAllah": "This is because they pursued what angers Allah, and they hated His approval, so He nullified their deeds."
        },
        {
            "verseNumber": 29,
            "verseString": "Or do those who have a disease in their hearts think that God won’t expose their malice?",
            "verseStringReplacedWithAllah": "Or do those who have a disease in their hearts think that Allah won’t expose their malice?"
        },
        {
            "verseNumber": 30,
            "verseString": "If We had willed, We would’ve shown them to you, and then you would’ve identified them by their marks. But you will recognize them by the tone of their speech. And God knows your deeds.",
            "verseStringReplacedWithAllah": "If We had willed, We would’ve shown them to you, and then you would’ve identified them by their marks. But you will recognize them by the tone of their speech. And Allah knows your deeds."
        },
        {
            "verseNumber": 31,
            "verseString": "We will surely test you, until We ascertain those among you who strive their best, and the patient ones, and We will test your reports."
        },
        {
            "verseNumber": 32,
            "verseString": "Those who disbelieve, deter others from God’s path, and oppose the Messenger after guidance has become clear to them, won’t harm God in the slightest. He will nullify their deeds.",
            "verseStringReplacedWithAllah": "Those who disbelieve, deter others from Allah’s path, and oppose the Messenger after guidance has become clear to them, won’t harm Allah in the slightest. He will nullify their deeds."
        },
        {
            "verseNumber": 33,
            "verseString": "O you who believe, obey God and the Messenger, and don’t invalidate your deeds.",
            "verseStringReplacedWithAllah": "O you who believe, obey Allah and the Messenger, and don’t invalidate your deeds."
        },
        {
            "verseNumber": 34,
            "verseString": "Those who disbelieve, hinder others from God’s path, and die as unbelievers: God won’t forgive them.",
            "verseStringReplacedWithAllah": "Those who disbelieve, hinder others from Allah’s path, and die as unbelievers: Allah won’t forgive them."
        },
        {
            "verseNumber": 35,
            "verseString": "So don’t slacken and call for peace while you have the upper hand. God is with you, and He will not undermine your deeds.",
            "verseStringReplacedWithAllah": "So don’t slacken and call for peace while you have the upper hand. Allah is with you, and He will not undermine your deeds."
        },
        {
            "verseNumber": 36,
            "verseString": "The life of this world is but a game and distraction. However, if you believe and act righteously, He will give you your rewards, and He won’t ask you for your possessions."
        },
        {
            "verseNumber": 37,
            "verseString": "If He were to demand it from you, and press upon you, you would become stingy, and He will bring out your ill-wills."
        },
        {
            "verseNumber": 38,
            "verseString": "Here you are, being called upon to spend in the way of God, and some among you are being stingy. Whoever holds back, it’s to his loss. God is the Rich, and you are the needy. If you turn away, He will replace you with other people, and they will not be like you.",
            "verseStringReplacedWithAllah": "Here you are, being called upon to spend in the way of Allah, and some among you are being stingy. Whoever holds back, it’s to his loss. Allah is the Rich, and you are the needy. If you turn away, He will replace you with other people, and they will not be like you."
        }
    ],
    "chapterNumber": 47,
    "nameInEnglish": "Muhammad",
    "nameInTransliteration": "Muhammad",
    "nameInArabic": "محمـد",
    "numberOfVerses": 38
}