{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "We paved the way for you towards a clear victory."
        },
        {
            "verseNumber": 2,
            "verseString": "So that God may forgive your past and future sins, complete His blessings upon you, and guide you along a straight path.",
            "verseStringReplacedWithAllah": "So that Allah may forgive your past and future sins, complete His blessings upon you, and guide you along a straight path."
        },
        {
            "verseNumber": 3,
            "verseString": "And that God may aid you with strong support.",
            "verseStringReplacedWithAllah": "And that Allah may aid you with strong support."
        },
        {
            "verseNumber": 4,
            "verseString": "It is He who sends tranquility into the hearts of the believers, to strengthen their faith. To God belong the forces of the heavens and the earth. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "It is He who sends tranquility into the hearts of the believers, to strengthen their faith. To Allah belong the forces of the heavens and the earth. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 5,
            "verseString": "He will admit the believing men and women into Gardens beneath which rivers flow, to dwell therein forever, and He will absolve their sins. This, in the sight of God, is the ultimate triumph.",
            "verseStringReplacedWithAllah": "He will admit the believing men and women into Gardens beneath which rivers flow, to dwell therein forever, and He will absolve their sins. This, in the sight of Allah, is the ultimate triumph."
        },
        {
            "verseNumber": 6,
            "verseString": "And He will punish the hypocritical men and women, and the polytheistic men and women, who harbor ill thoughts about God. They are wrapped in wickedness, and God is angry with them, has cursed them, and prepared Hell for them—a terrible fate.",
            "verseStringReplacedWithAllah": "And He will punish the hypocritical men and women, and the polytheistic men and women, who harbor ill thoughts about Allah. They are wrapped in wickedness, and Allah is angry with them, has cursed them, and prepared Hell for them—a terrible fate."
        },
        {
            "verseNumber": 7,
            "verseString": "To God belong the forces of the heavens and the earth. God is All-Powerful, All-Wise.",
            "verseStringReplacedWithAllah": "To Allah belong the forces of the heavens and the earth. Allah is All-Powerful, All-Wise."
        },
        {
            "verseNumber": 8,
            "verseString": "We sent you as a witness, a herald of good news, and a warner."
        },
        {
            "verseNumber": 9,
            "verseString": "So that you may believe in God and His Messenger, endorse him, respect him, and glorify Him morning and evening.",
            "verseStringReplacedWithAllah": "So that you may believe in Allah and His Messenger, endorse him, respect him, and glorify Him morning and evening."
        },
        {
            "verseNumber": 10,
            "verseString": "Those who pledge allegiance to you are, in essence, pledging allegiance to God. The hand of God is above their hands. Whoever breaks his pledge, breaks it to his own harm. And whoever fulfills his covenant with God, He will grant him a magnificent reward.",
            "verseStringReplacedWithAllah": "Those who pledge allegiance to you are, in essence, pledging allegiance to Allah. The hand of Allah is above their hands. Whoever breaks his pledge, breaks it to his own harm. And whoever fulfills his covenant with Allah, He will grant him a magnificent reward."
        },
        {
            "verseNumber": 11,
            "verseString": "The Desert Arabs who remained behind will say to you, “Our properties and our families occupied us, so seek forgiveness for us.” They say with their tongues what is not in their hearts. Say, “Who can protect you from God if He intends harm or benefit for you?” God is fully informed of what you do.",
            "verseStringReplacedWithAllah": "The Desert Arabs who remained behind will say to you, “Our properties and our families occupied us, so seek forgiveness for us.” They say with their tongues what is not in their hearts. Say, “Who can protect you from Allah if He intends harm or benefit for you?” Allah is fully informed of what you do."
        },
        {
            "verseNumber": 12,
            "verseString": "You assumed that the Messenger and the believers would not return to their families, which delighted your hearts. You harbored malicious thoughts, and thus, became doomed people."
        },
        {
            "verseNumber": 13,
            "verseString": "Those who reject God and His Messenger—We’ve prepared a blazing fire for the unbelievers.",
            "verseStringReplacedWithAllah": "Those who reject Allah and His Messenger—We’ve prepared a blazing fire for the unbelievers."
        },
        {
            "verseNumber": 14,
            "verseString": "To God belongs the sovereignty of the heavens and the earth. He forgives whom He wills, and He punishes whom He wills. God is All-Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "To Allah belongs the sovereignty of the heavens and the earth. He forgives whom He wills, and He punishes whom He wills. Allah is All-Forgiving and Merciful."
        },
        {
            "verseNumber": 15,
            "verseString": "When you set out to collect the gains, those who had lagged said, “Allow us to accompany you.” They wish to change God’s words. Say, “You won’t accompany us; God has already decreed this.” Then they will say, “You are jealous of us.” But in reality, they understand very little.",
            "verseStringReplacedWithAllah": "When you set out to collect the gains, those who had lagged said, “Allow us to accompany you.” They wish to change Allah’s words. Say, “You won’t accompany us; Allah has already decreed this.” Then they will say, “You are jealous of us.” But in reality, they understand very little."
        },
        {
            "verseNumber": 16,
            "verseString": "Tell the Desert Arabs who stayed behind, “You will be called to a people of great warfare; you will fight them, unless they surrender. If you obey, God will grant you generous compensation. But if you turn away, as you did previously, He will inflict a severe punishment upon you.”",
            "verseStringReplacedWithAllah": "Tell the Desert Arabs who stayed behind, “You will be called to a people of great warfare; you will fight them, unless they surrender. If you obey, Allah will grant you generous compensation. But if you turn away, as you did previously, He will inflict a severe punishment upon you.”"
        },
        {
            "verseNumber": 17,
            "verseString": "There is no blame for the blind, nor any blame for the lame, nor any blame for the sick. Whoever obeys God and His Messenger: He will admit him into Gardens through which rivers flow. But whoever turns away, He will inflict upon him a painful punishment.",
            "verseStringReplacedWithAllah": "There is no blame for the blind, nor any blame for the lame, nor any blame for the sick. Whoever obeys Allah and His Messenger: He will admit him into Gardens through which rivers flow. But whoever turns away, He will inflict upon him a painful punishment."
        },
        {
            "verseNumber": 18,
            "verseString": "God was pleased with the believers when they pledged their allegiance to you beneath the tree. He knew what was in their hearts, so He sent tranquility down upon them, and He rewarded them with a near victory.",
            "verseStringReplacedWithAllah": "Allah was pleased with the believers when they pledged their allegiance to you beneath the tree. He knew what was in their hearts, so He sent tranquility down upon them, and He rewarded them with a near victory."
        },
        {
            "verseNumber": 19,
            "verseString": "Furthermore, they were destined to seize abundant gains. God is Mighty and Wise.",
            "verseStringReplacedWithAllah": "Furthermore, they were destined to seize abundant gains. Allah is Mighty and Wise."
        },
        {
            "verseNumber": 20,
            "verseString": "God has promised you numerous spoils that you will acquire, and He expedited this for you, restraining people’s hands from you, serving as a sign for the believers, and to guide you along a straight path.",
            "verseStringReplacedWithAllah": "Allah has promised you numerous spoils that you will acquire, and He expedited this for you, restraining people’s hands from you, serving as a sign for the believers, and to guide you along a straight path."
        },
        {
            "verseNumber": 21,
            "verseString": "There are others that you couldn’t reach, but God encompassed them. God has power over everything.",
            "verseStringReplacedWithAllah": "There are others that you couldn’t reach, but Allah encompassed them. Allah has power over everything."
        },
        {
            "verseNumber": 22,
            "verseString": "If the unbelievers had fought you, they would’ve turned their backs, then they wouldn’t find a protector or helper."
        },
        {
            "verseNumber": 23,
            "verseString": "This is the consistent way of God, unchanging throughout history. You will never find a change in God’s way.",
            "verseStringReplacedWithAllah": "This is the consistent way of Allah, unchanging throughout history. You will never find a change in Allah’s way."
        },
        {
            "verseNumber": 24,
            "verseString": "It is He who withheld their hands from you, and your hands from them, in the heart of Mecca, after He had made you victorious over them. God is ever watchful of your actions.",
            "verseStringReplacedWithAllah": "It is He who withheld their hands from you, and your hands from them, in the heart of Mecca, after He had made you victorious over them. Allah is ever watchful of your actions."
        },
        {
            "verseNumber": 25,
            "verseString": "They are the ones who disbelieved, barred you from the Sacred Mosque, and prevented the offering from reaching its destination. If not for certain believing men and women, unknown to you, whom you might have inadvertently harmed, God would have allowed harm to befall them. But God brings into His mercy whom He wills. Had they been separated, We would’ve punished those among them who disbelieved with a great punishment.",
            "verseStringReplacedWithAllah": "They are the ones who disbelieved, barred you from the Sacred Mosque, and prevented the offering from reaching its destination. If not for certain believing men and women, unknown to you, whom you might have inadvertently harmed, Allah would have allowed harm to befall them. But Allah brings into His mercy whom He wills. Had they been separated, We would’ve punished those among them who disbelieved with a great punishment."
        },
        {
            "verseNumber": 26,
            "verseString": "The unbelievers harbor deep-seated prejudice—the zealotry of the Age of Ignorance. Yet, God sent down His tranquility upon His Messenger and the believers, and He committed them to the word of righteousness, which they were most worthy and deserving of. God is fully aware of everything.",
            "verseStringReplacedWithAllah": "The unbelievers harbor deep-seated prejudice—the zealotry of the Age of Ignorance. Yet, Allah sent down His tranquility upon His Messenger and the believers, and He committed them to the word of righteousness, which they were most worthy and deserving of. Allah is fully aware of everything."
        },
        {
            "verseNumber": 27,
            "verseString": "God has fulfilled His Messenger’s vision in truth: “You will enter the Sacred Mosque, if God wills, in security, with your heads shaven or hair shortened, without fear.” He knew what you knew not, and besides that, He has prepared a close victory.",
            "verseStringReplacedWithAllah": "Allah has fulfilled His Messenger’s vision in truth: “You will enter the Sacred Mosque, if Allah wills, in security, with your heads shaven or hair shortened, without fear.” He knew what you knew not, and besides that, He has prepared a close victory."
        },
        {
            "verseNumber": 28,
            "verseString": "It is He who sent His Messenger with guidance and the religion of truth, to make it prevail over all religions. God is sufficient as a Witness.",
            "verseStringReplacedWithAllah": "It is He who sent His Messenger with guidance and the religion of truth, to make it prevail over all religions. Allah is sufficient as a Witness."
        },
        {
            "verseNumber": 29,
            "verseString": "Muhammad is the Messenger of God. Those with him are stern with the unbelievers, compassionate among themselves. You see them bowing and prostrating, seeking grace and approval from God. Their marks are on their faces from the effects of prostration. This is their description in the Torah and the Gospel: like a seed that sprouts, grows, strengthens, thickens, and then stands firm on its stem, delighting the sowers. He enrages the unbelievers with them. God has promised those among them who believe and do righteous deeds, forgiveness and a great reward.",
            "verseStringReplacedWithAllah": "Muhammad is the Messenger of Allah. Those with him are stern with the unbelievers, compassionate among themselves. You see them bowing and prostrating, seeking grace and approval from Allah. Their marks are on their faces from the effects of prostration. This is their description in the Torah and the Gospel: like a seed that sprouts, grows, strengthens, thickens, and then stands firm on its stem, delighting the sowers. He enrages the unbelievers with them. Allah has promised those among them who believe and do righteous deeds, forgiveness and a great reward."
        }
    ],
    "chapterNumber": 48,
    "nameInEnglish": "Victory",
    "nameInTransliteration": "Al Fath",
    "nameInArabic": "الفتح",
    "numberOfVerses": 29
}