{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif. Lam. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "Do people think they will be left alone, just stating, “We believe,” without being tested?"
        },
        {
            "verseNumber": 3,
            "verseString": "We tested those before them. And God will certainly know those who are true from those who are false.",
            "verseStringReplacedWithAllah": "We tested those before them. And Allah will certainly know those who are true from those who are false."
        },
        {
            "verseNumber": 4,
            "verseString": "Do those who commit evil think they can outmaneuver Us? How delusional they are!"
        },
        {
            "verseNumber": 5,
            "verseString": "Whoever hopes to meet God, the appointed time of God is surely coming. He is the All-Hearing, the All-Knowing.",
            "verseStringReplacedWithAllah": "Whoever hopes to meet Allah, the appointed time of Allah is surely coming. He is the All-Hearing, the All-Knowing."
        },
        {
            "verseNumber": 6,
            "verseString": "Whoever strives, strives for his own soul. God is free of all needs from all creation.",
            "verseStringReplacedWithAllah": "Whoever strives, strives for his own soul. Allah is free of all needs from all creation."
        },
        {
            "verseNumber": 7,
            "verseString": "As for those who believe and lead righteous lives, We will erase their sins and reward them according to the best of their actions."
        },
        {
            "verseNumber": 8,
            "verseString": "We’ve instructed man to honor his parents. However, if they pressure you to associate something with Me, about which you have no knowledge, don’t obey them. To Me is your return, and I will inform you of everything you did."
        },
        {
            "verseNumber": 9,
            "verseString": "Those who believe and do righteous deeds will be among the righteous."
        },
        {
            "verseNumber": 10,
            "verseString": "Some people profess, “We believe in God.” But when they suffer for God’s sake, they equate human persecution with God’s punishment. Yet, when help comes to them from your Lord, they say, “We were always with you.” Doesn’t God know what resides in the hearts of all beings?",
            "verseStringReplacedWithAllah": "Some people profess, “We believe in Allah.” But when they suffer for Allah’s sake, they equate human persecution with Allah’s punishment. Yet, when help comes to them from your Lord, they say, “We were always with you.” Doesn’t Allah know what resides in the hearts of all beings?"
        },
        {
            "verseNumber": 11,
            "verseString": "God will certainly ascertain those who believe, and He will surely expose the hypocrites.",
            "verseStringReplacedWithAllah": "Allah will certainly ascertain those who believe, and He will surely expose the hypocrites."
        },
        {
            "verseNumber": 12,
            "verseString": "Those who disbelieve say to the believers, “Follow our path, and we will carry your sins.” Yet they can’t carry any of their sins. They are liars."
        },
        {
            "verseNumber": 13,
            "verseString": "They will carry their own burdens, and other burdens along with their own. And on Resurrection Day, they will be questioned about their false assertions."
        },
        {
            "verseNumber": 14,
            "verseString": "We sent Noah to his people, and he dwelt among them for a millennium, less fifty years. Then the flood overtook them while they were wrongdoers."
        },
        {
            "verseNumber": 15,
            "verseString": "But We rescued him and those with him in the Ark, and We made it a symbol for all people."
        },
        {
            "verseNumber": 16,
            "verseString": "Consider Abraham, who said to his people, “Worship God and revere Him; this is better for you, if only you understood.",
            "verseStringReplacedWithAllah": "Consider Abraham, who said to his people, “Worship Allah and revere Him; this is better for you, if only you understood."
        },
        {
            "verseNumber": 17,
            "verseString": "You worship idols besides God and invent lies. The idols you worship apart from God don’t possess provision for you. Therefore, seek sustenance from God, worship Him, and give thanks to Him. To Him, you will be returned.”",
            "verseStringReplacedWithAllah": "You worship idols besides Allah and invent lies. The idols you worship apart from Allah don’t possess provision for you. Therefore, seek sustenance from Allah, worship Him, and give thanks to Him. To Him, you will be returned.”"
        },
        {
            "verseNumber": 18,
            "verseString": "If you deny the truth, nations before you have also denied. The Messenger’s only duty is to deliver the message clearly."
        },
        {
            "verseNumber": 19,
            "verseString": "Didn’t they see how God originates creation and then repeats it? This is easy for God.",
            "verseStringReplacedWithAllah": "Didn’t they see how Allah originates creation and then repeats it? This is easy for Allah."
        },
        {
            "verseNumber": 20,
            "verseString": "Say, “Travel through the earth and observe how He initiated creation.” Then, God will produce the next existence. God has power over everything.",
            "verseStringReplacedWithAllah": "Say, “Travel through the earth and observe how He initiated creation.” Then, Allah will produce the next existence. Allah has power over everything."
        },
        {
            "verseNumber": 21,
            "verseString": "He punishes whom He wills, and He shows mercy to whom He wills. And to Him, you will be restored."
        },
        {
            "verseNumber": 22,
            "verseString": "You can’t escape from Him on Earth or in the heavens, and you have neither protector nor helper besides God.",
            "verseStringReplacedWithAllah": "You can’t escape from Him on Earth or in the heavens, and you have neither protector nor helper besides Allah."
        },
        {
            "verseNumber": 23,
            "verseString": "Those who reject God’s revelations and the meeting with Him have despaired of My mercy and will face severe punishment.",
            "verseStringReplacedWithAllah": "Those who reject Allah’s revelations and the meeting with Him have despaired of My mercy and will face severe punishment."
        },
        {
            "verseNumber": 24,
            "verseString": "The only response of his people was that they said, “Kill him or burn him!” Yet, God saved him from the Fire. In this are signs for people who believe.",
            "verseStringReplacedWithAllah": "The only response of his people was that they said, “Kill him or burn him!” Yet, Allah saved him from the Fire. In this are signs for people who believe."
        },
        {
            "verseNumber": 25,
            "verseString": "He said, “Instead of God, you’ve taken to worshiping idols; your mutual love will last only in the life of this world; then on the Day of Resurrection, you will deny each other and curse each other; and your refuge shall be the fire, and you will have no helpers.”",
            "verseStringReplacedWithAllah": "He said, “Instead of Allah, you’ve taken to worshiping idols; your mutual love will last only in the life of this world; then on the Day of Resurrection, you will deny each other and curse each other; and your refuge shall be the fire, and you will have no helpers.”"
        },
        {
            "verseNumber": 26,
            "verseString": "Lot believed in him. He said, “I am migrating to my Lord. He is the Almighty, the Wise.”"
        },
        {
            "verseNumber": 27,
            "verseString": "And We gave him Isaac and Jacob, and in his lineage, We established prophethood and the Scripture. We gave him his reward in this life, and in the Hereafter, he will be among the righteous."
        },
        {
            "verseNumber": 28,
            "verseString": "Lot told his people, “You commit such indecency as no other community has ever committed."
        },
        {
            "verseNumber": 29,
            "verseString": "You approach men with desire, cut off roads, and commit indecency in your gatherings.” But his people only responded, “Bring upon us God’s punishment, if you are truthful.”",
            "verseStringReplacedWithAllah": "You approach men with desire, cut off roads, and commit indecency in your gatherings.” But his people only responded, “Bring upon us Allah’s punishment, if you are truthful.”"
        },
        {
            "verseNumber": 30,
            "verseString": "He prayed, “My Lord, give me victory against these corrupt people.”"
        },
        {
            "verseNumber": 31,
            "verseString": "When Our messengers brought the good news to Abraham, they also announced, “We are about to destroy the inhabitants of this town, for they are immersed in sin.”"
        },
        {
            "verseNumber": 32,
            "verseString": "He protested, “But Lot resides there!” They replied, “We are well aware of who resides there. We will rescue him and his family, except for his wife, destined to be among those left behind.”"
        },
        {
            "verseNumber": 33,
            "verseString": "When Our messengers arrived at Lot’s home, they were mistreated, and he was distressed on their account. They reassured him, saying, “Fear not, nor grieve, We will save you and your family, except for your wife, destined to be among the doomed.”"
        },
        {
            "verseNumber": 34,
            "verseString": "“We are going to bring down on the people of this town a punishment from the sky due to their transgressions.”"
        },
        {
            "verseNumber": 35,
            "verseString": "We left of it an evident sign, for people endowed with intelligence."
        },
        {
            "verseNumber": 36,
            "verseString": "And to Midian, their brother Shuaib. He implored, “O my people, worship God, have hope in the Last Day and don’t create disorder in the land.”",
            "verseStringReplacedWithAllah": "And to Midian, their brother Shuaib. He implored, “O my people, worship Allah, have hope in the Last Day and don’t create disorder in the land.”"
        },
        {
            "verseNumber": 37,
            "verseString": "But they rejected him, and the tremor seized them, leaving them lifeless in their homes."
        },
        {
            "verseNumber": 38,
            "verseString": "And Aad, and Thamud—it became clear to you from their dwellings. Satan made their deeds appear pleasing to them, leading them astray from the path, even though they could see."
        },
        {
            "verseNumber": 39,
            "verseString": "And Korah, Pharaoh, and Haman—Moses came to them with clear signs, but they behaved arrogantly in the land. Yet, they weren’t out of reach."
        },
        {
            "verseNumber": 40,
            "verseString": "We seized each of them for their wrongdoings. Some We swept away in a sandstorm; a blast struck others; some We caused the earth to swallow; and others We drowned. It was not God who wronged them, but they wronged themselves.",
            "verseStringReplacedWithAllah": "We seized each of them for their wrongdoings. Some We swept away in a sandstorm; a blast struck others; some We caused the earth to swallow; and others We drowned. It was not Allah who wronged them, but they wronged themselves."
        },
        {
            "verseNumber": 41,
            "verseString": "The example of those who take allies other than God is like that of the spider who builds a house. Yet, the weakest of houses is the house of the spider—if they only knew.",
            "verseStringReplacedWithAllah": "The example of those who take allies other than Allah is like that of the spider who builds a house. Yet, the weakest of houses is the house of the spider—if they only knew."
        },
        {
            "verseNumber": 42,
            "verseString": "God knows whatever they invoke besides Him. He is the Mighty, the Wise.",
            "verseStringReplacedWithAllah": "Allah knows whatever they invoke besides Him. He is the Mighty, the Wise."
        },
        {
            "verseNumber": 43,
            "verseString": "We present such parables to people, but only those with knowledge can comprehend them."
        },
        {
            "verseNumber": 44,
            "verseString": "God created the heavens and the earth with truth. In this, there is a sign for believers.",
            "verseStringReplacedWithAllah": "Allah created the heavens and the earth with truth. In this, there is a sign for believers."
        },
        {
            "verseNumber": 45,
            "verseString": "Communicate what has been revealed to you from the Scripture, and establish prayer. Prayer repels immorality and wrongdoing, and the remembrance of God is greater. God is fully aware of what you do.",
            "verseStringReplacedWithAllah": "Communicate what has been revealed to you from the Scripture, and establish prayer. Prayer repels immorality and wrongdoing, and the remembrance of Allah is greater. Allah is fully aware of what you do."
        },
        {
            "verseNumber": 46,
            "verseString": "Debate with the People of the Scripture only in the kindest manner, except with those who do wrong among them. And say, “We believe in what was revealed to us, and in what was revealed to you. Our God and your God is One, and to Him we submit.”"
        },
        {
            "verseNumber": 47,
            "verseString": "Thus, We revealed the Scripture to you. Those to whom We gave the Scripture, as well as some of these, believe in it. None renounce our verses except the unbelievers."
        },
        {
            "verseNumber": 48,
            "verseString": "You didn’t recite any scripture before this or write one with your right hand. If you had, the fabricators of falsehood would have doubted."
        },
        {
            "verseNumber": 49,
            "verseString": "Rather, these are clear signs in the hearts of those endowed with knowledge. None reject Our verses except the unjust."
        },
        {
            "verseNumber": 50,
            "verseString": "They question, “Why are no miracles sent down to him from his Lord?” Respond, “The miracles are solely with God, and I am simply a plain warner.”",
            "verseStringReplacedWithAllah": "They question, “Why are no miracles sent down to him from his Lord?” Respond, “The miracles are solely with Allah, and I am simply a plain warner.”"
        },
        {
            "verseNumber": 51,
            "verseString": "Isn’t it sufficient for them that We revealed to you the Scripture, which is conveyed to them? In this are mercy and reminders for people who believe."
        },
        {
            "verseNumber": 52,
            "verseString": "Say, “God is sufficient as a witness between me and you. He knows everything in the heavens and on earth. Those who believe in falsehood and reject God—they are the ones who will be the losers.”",
            "verseStringReplacedWithAllah": "Say, “Allah is sufficient as a witness between me and you. He knows everything in the heavens and on earth. Those who believe in falsehood and reject Allah—they are the ones who will be the losers.”"
        },
        {
            "verseNumber": 53,
            "verseString": "They urge you to hasten the punishment. If not for a set term, the punishment would’ve already come upon them. Yet, it will come upon them suddenly while they are unaware."
        },
        {
            "verseNumber": 54,
            "verseString": "They urge you to hasten the punishment. Hell will undoubtedly envelop the unbelievers."
        },
        {
            "verseNumber": 55,
            "verseString": "On the Day when the punishment will envelop them from above them and from below their feet, He will say, “Taste what you used to do!”"
        },
        {
            "verseNumber": 56,
            "verseString": "O My servants who have believed, My earth is vast, so worship only Me."
        },
        {
            "verseNumber": 57,
            "verseString": "Every soul will taste death. Then, you will be returned to Us."
        },
        {
            "verseNumber": 58,
            "verseString": "Those who believe and lead righteous lives, We will settle them in Paradise, in dwellings beneath which rivers flow, where they will stay forever. What an excellent reward for the workers."
        },
        {
            "verseNumber": 59,
            "verseString": "Those who exercise patience and put their trust in their Lord."
        },
        {
            "verseNumber": 60,
            "verseString": "How many living creatures don’t carry their provisions? God provides for them and for you. He is the All-Hearing, the All-Knowing.",
            "verseStringReplacedWithAllah": "How many living creatures don’t carry their provisions? Allah provides for them and for you. He is the All-Hearing, the All-Knowing."
        },
        {
            "verseNumber": 61,
            "verseString": "If you were to ask them, “Who created the heavens and the earth? Who governs the sun and the moon?” They would surely answer, “God.” How then are they deluded?",
            "verseStringReplacedWithAllah": "If you were to ask them, “Who created the heavens and the earth? Who governs the sun and the moon?” They would surely answer, “Allah.” How then are they deluded?"
        },
        {
            "verseNumber": 62,
            "verseString": "God extends the provision for whom He wills of His beings and restricts it. God is fully aware of all things.",
            "verseStringReplacedWithAllah": "Allah extends the provision for whom He wills of His beings and restricts it. Allah is fully aware of all things."
        },
        {
            "verseNumber": 63,
            "verseString": "If you were to ask them, “Who sends down rain from the sky, thereby reviving the lifeless earth?” They would surely answer, “God.” Then say, “Praise be to God!” Yet, most of them don’t apply their intellect.",
            "verseStringReplacedWithAllah": "If you were to ask them, “Who sends down rain from the sky, thereby reviving the lifeless earth?” They would surely answer, “Allah.” Then say, “Praise be to Allah!” Yet, most of them don’t apply their intellect."
        },
        {
            "verseNumber": 64,
            "verseString": "This worldly life is nothing more than diversion and entertainment. And indeed, the home of the Hereafter—that’s the life, if only they knew."
        },
        {
            "verseNumber": 65,
            "verseString": "When they board a vessel, they call upon God, devoting their prayer sincerely to Him. However, once He delivers them safely to land, they attribute partners to Him.",
            "verseStringReplacedWithAllah": "When they board a vessel, they call upon Allah, devoting their prayer sincerely to Him. However, once He delivers them safely to land, they attribute partners to Him."
        },
        {
            "verseNumber": 66,
            "verseString": "In doing so, they show ingratitude for what We’ve given them. Let them indulge in it. Soon, they will realize."
        },
        {
            "verseNumber": 67,
            "verseString": "Can’t they see that We’ve established a secure sanctuary, while people are being snatched away all around them? Do they believe in falsehood and deny God’s favors?",
            "verseStringReplacedWithAllah": "Can’t they see that We’ve established a secure sanctuary, while people are being snatched away all around them? Do they believe in falsehood and deny Allah’s favors?"
        },
        {
            "verseNumber": 68,
            "verseString": "Who could be more unjust than the one who invents lies against God or denies the truth when it comes to him? Isn’t there a place in Hell reserved for the unbelievers?",
            "verseStringReplacedWithAllah": "Who could be more unjust than the one who invents lies against Allah or denies the truth when it comes to him? Isn’t there a place in Hell reserved for the unbelievers?"
        },
        {
            "verseNumber": 69,
            "verseString": "Those who strive for Us, We will guide them along Our way. God is with the doers of good.",
            "verseStringReplacedWithAllah": "Those who strive for Us, We will guide them along Our way. Allah is with the doers of good."
        }
    ],
    "chapterNumber": 29,
    "nameInEnglish": "The Spider",
    "nameInTransliteration": "Al Ankabut",
    "nameInArabic": "العنكبوت",
    "numberOfVerses": 69
}