{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Kaf. Ha. Ya. Ayn. Saad."
        },
        {
            "verseNumber": 2,
            "verseString": "This is a mention of your Lord’s mercy towards His servant Zechariah."
        },
        {
            "verseNumber": 3,
            "verseString": "When he silently invoked his Lord in a private prayer."
        },
        {
            "verseNumber": 4,
            "verseString": "He said, “My Lord, my bones have grown frail, and my head is aflame with white hair. Yet, my Lord, I have never been unhappy in my prayer to You."
        },
        {
            "verseNumber": 5,
            "verseString": "And I fear the successors after me, and my wife is barren, so grant me from Yourself an heir."
        },
        {
            "verseNumber": 6,
            "verseString": "Who will inherit from me and the family of Jacob. And make him, my Lord, pleasing.”"
        },
        {
            "verseNumber": 7,
            "verseString": "“O Zechariah, We give you good news of a son, named John, a name We’ve never given before.”"
        },
        {
            "verseNumber": 8,
            "verseString": "He asked, “My Lord, how can I have a son when my wife is barren, and I have reached an advanced age?”"
        },
        {
            "verseNumber": 9,
            "verseString": "He replied, “So it will be; your Lord says, ‘It is easy for Me, just as I created you before, when you were nothing.’”"
        },
        {
            "verseNumber": 10,
            "verseString": "He asked, “My Lord, give me a sign.” He replied, “Your sign is that you won’t speak to people for three consecutive nights.”"
        },
        {
            "verseNumber": 11,
            "verseString": "Exiting the sanctuary, he signaled to his people to praise morning and evening."
        },
        {
            "verseNumber": 12,
            "verseString": "“O John, adhere firmly to the Scripture.” We gave him wisdom while still a boy."
        },
        {
            "verseNumber": 13,
            "verseString": "And affection from Us, and purity, and he was deeply devout."
        },
        {
            "verseNumber": 14,
            "verseString": "And he was benevolent to his parents, and he was neither arrogant nor disobedient."
        },
        {
            "verseNumber": 15,
            "verseString": "And peace be upon him the day he was born, the day he dies, and the day he is raised alive."
        },
        {
            "verseNumber": 16,
            "verseString": "And mention in the Scripture, Mary, when she distanced herself from her family to an eastern place."
        },
        {
            "verseNumber": 17,
            "verseString": "She placed a veil to separate herself from them. Then We sent her Our Spirit, who appeared to her as a perfectly formed human."
        },
        {
            "verseNumber": 18,
            "verseString": "She exclaimed, “I seek refuge in the Most Merciful from you, if you are God-fearing.”",
            "verseStringReplacedWithAllah": "She exclaimed, “I seek refuge in the Most Merciful from you, if you are Allah-fearing.”"
        },
        {
            "verseNumber": 19,
            "verseString": "He replied, “I am the messenger of your Lord, to announce to you the gift of a pure son.”"
        },
        {
            "verseNumber": 20,
            "verseString": "She questioned, “How can I have a son, when no man has touched me, and I have not been immoral?”"
        },
        {
            "verseNumber": 21,
            "verseString": "He responded, “So it will be; your Lord says, ‘It is easy for Me. And We will make him a symbol for humanity, and mercy from Us. It is a matter already decided.’”"
        },
        {
            "verseNumber": 22,
            "verseString": "So she conceived him, and she withdrew with him to a remote place."
        },
        {
            "verseNumber": 23,
            "verseString": "The pains of childbirth drove her to the trunk of a palm tree. She cried, “I wish I had died before this, and was completely forgotten!”"
        },
        {
            "verseNumber": 24,
            "verseString": "Then he called her from beneath her, “Grieve not; your Lord has placed a stream beneath you."
        },
        {
            "verseNumber": 25,
            "verseString": "And shake the trunk of the palm-tree towards you, and it will drop upon you fresh, ripe dates."
        },
        {
            "verseNumber": 26,
            "verseString": "So eat, drink, and find comfort. If you see any human, say, ‘I have vowed a fast to the Most Merciful, so I won’t speak to any person today.’”"
        },
        {
            "verseNumber": 27,
            "verseString": "Upon her return to her people, carrying him, they exclaimed, “O Mary, you’ve done something unthinkable!"
        },
        {
            "verseNumber": 28,
            "verseString": "O sister of Aaron, your father was not a man of disgrace, nor was your mother a woman of dishonor.”"
        },
        {
            "verseNumber": 29,
            "verseString": "So she pointed to him. They asked, “How can we speak to a baby in the cradle?”"
        },
        {
            "verseNumber": 30,
            "verseString": "He said, “I am the servant of God. He has given me the Scripture, and He made me a prophet.",
            "verseStringReplacedWithAllah": "He said, “I am the servant of Allah. He has given me the Scripture, and He made me a prophet."
        },
        {
            "verseNumber": 31,
            "verseString": "He made me a blessing wherever I may be, and He enjoined upon me prayer and charity as long as I remain alive."
        },
        {
            "verseNumber": 32,
            "verseString": "And kind to my mother, and He didn’t make me an arrogant oppressor."
        },
        {
            "verseNumber": 33,
            "verseString": "Peace is upon me the day I was born, the day I will die, and the day I will be resurrected alive.”"
        },
        {
            "verseNumber": 34,
            "verseString": "This is Jesus, the son of Mary, the Word of Truth about which they are in dispute."
        },
        {
            "verseNumber": 35,
            "verseString": "It’s not for God to have a child. Glory be to Him! When He decrees a matter, He only says to it, “Be,” and it becomes.",
            "verseStringReplacedWithAllah": "It’s not for Allah to have a child. Glory be to Him! When He decrees a matter, He only says to it, “Be,” and it becomes."
        },
        {
            "verseNumber": 36,
            "verseString": "“God is my Lord and your Lord, so worship Him. This is a straight path.”",
            "verseStringReplacedWithAllah": "“Allah is my Lord and your Lord, so worship Him. This is a straight path.”"
        },
        {
            "verseNumber": 37,
            "verseString": "However, the factions disagreed among themselves. Woe to those who disbelieve—from the scene of a tremendous Day."
        },
        {
            "verseNumber": 38,
            "verseString": "How keen their hearing, how sharp their sight, the Day they come to Us. But the wrongdoers today are in clear error."
        },
        {
            "verseNumber": 39,
            "verseString": "Warn them of the Day of Regret, when the matter will be finalized, while they remain oblivious and they don’t believe."
        },
        {
            "verseNumber": 40,
            "verseString": "It is We who will inherit the earth and all who are on it, and to Us, they will be returned."
        },
        {
            "verseNumber": 41,
            "verseString": "And mention in the Scripture Abraham, a man of truth, a prophet."
        },
        {
            "verseNumber": 42,
            "verseString": "When he said to his father, “O my father, why do you worship what can neither hear nor see and can’t benefit you in any way?"
        },
        {
            "verseNumber": 43,
            "verseString": "O my father, a specific knowledge that didn’t come to you has come to me. So follow me, and I will guide you to a straight path."
        },
        {
            "verseNumber": 44,
            "verseString": "O my father, don’t worship Satan. Satan has been rebellious against the Most Merciful."
        },
        {
            "verseNumber": 45,
            "verseString": "My dear father, I fear that a punishment from the Compassionate may afflict you, and you become an ally to Satan.”"
        },
        {
            "verseNumber": 46,
            "verseString": "He replied, “Are you renouncing my gods, O Abraham? If you don’t desist, I will surely stone you. Now leave me for a long while.”"
        },
        {
            "verseNumber": 47,
            "verseString": "He responded, “Peace be upon you. I will ask forgiveness for you from my Lord. He is always gracious to me."
        },
        {
            "verseNumber": 48,
            "verseString": "And I will distance myself from you and what you invoke besides God, and I will pray to my Lord. Perhaps I won’t be unhappy in my supplication to my Lord.”",
            "verseStringReplacedWithAllah": "And I will distance myself from you and what you invoke besides Allah, and I will pray to my Lord. Perhaps I won’t be unhappy in my supplication to my Lord.”"
        },
        {
            "verseNumber": 49,
            "verseString": "When he had distanced himself from them and from what they worship besides God, We gave him Isaac and Jacob, and each We made a prophet.",
            "verseStringReplacedWithAllah": "When he had distanced himself from them and from what they worship besides Allah, We gave him Isaac and Jacob, and each We made a prophet."
        },
        {
            "verseNumber": 50,
            "verseString": "And We showered them with Our mercy, and We made for them a lofty reputation of truth."
        },
        {
            "verseNumber": 51,
            "verseString": "And mention in the Scripture, Moses. He was chosen, and he was a messenger, a prophet."
        },
        {
            "verseNumber": 52,
            "verseString": "We called him from the right side of the Mount, drawing him into close communion."
        },
        {
            "verseNumber": 53,
            "verseString": "Out of Our mercy, We gave him his brother Aaron, a prophet."
        },
        {
            "verseNumber": 54,
            "verseString": "Furthermore, mention in the Scripture, Ishmael. He was faithful to his promise, and was a messenger, a prophet."
        },
        {
            "verseNumber": 55,
            "verseString": "He used to command his family to pray and to give charity, and he was pleasing to his Lord."
        },
        {
            "verseNumber": 56,
            "verseString": "And mention in the Scripture, Enoch. He was a man of integrity, a prophet."
        },
        {
            "verseNumber": 57,
            "verseString": "We elevated him to an esteemed status."
        },
        {
            "verseNumber": 58,
            "verseString": "These are some of the prophets whom God blessed; from the progeny of Adam, and those We carried with Noah, and from the offspring of Abraham and Israel, and from those We guided and selected. When the verses of the Most Gracious were recited to them, they collapsed prostrating and weeping.",
            "verseStringReplacedWithAllah": "These are some of the prophets whom Allah blessed; from the progeny of Adam, and those We carried with Noah, and from the offspring of Abraham and Israel, and from those We guided and selected. When the verses of the Most Gracious were recited to them, they collapsed prostrating and weeping."
        },
        {
            "verseNumber": 59,
            "verseString": "Yet there succeeded them successors who neglected the prayers and pursued their desires. They will face devastation."
        },
        {
            "verseNumber": 60,
            "verseString": "Except for those who repent, believe, and act righteously, these will enter Paradise, and they won’t be wronged in the slightest."
        },
        {
            "verseNumber": 61,
            "verseString": "The Gardens of Eden which the Most Merciful has promised His servants unseen. His promises have been coming true."
        },
        {
            "verseNumber": 62,
            "verseString": "No idle talk will they hear therein, only words of peace. They will receive their sustenance therein, morning and evening."
        },
        {
            "verseNumber": 63,
            "verseString": "This is the Paradise that We will grant to Our righteous servants."
        },
        {
            "verseNumber": 64,
            "verseString": "“We descend only by the command of our Lord. To Him belongs what’s ahead of us, what’s behind us, and what lies in between. Your Lord is never forgetful.”"
        },
        {
            "verseNumber": 65,
            "verseString": "Lord of the heavens, the earth, and what’s between them. So worship Him, and remain steadfast in His worship. Do you know of any counterpart for Him?"
        },
        {
            "verseNumber": 66,
            "verseString": "Man asks, “When I am dead, will I then be raised up alive?”"
        },
        {
            "verseNumber": 67,
            "verseString": "Doesn’t man remember that We created him before, when he was nothing?"
        },
        {
            "verseNumber": 68,
            "verseString": "By your Lord, We will gather them and the devils, and bring them on their knees around Hell."
        },
        {
            "verseNumber": 69,
            "verseString": "Then, We will extract from each group those who were most defiant towards the Most Merciful."
        },
        {
            "verseNumber": 70,
            "verseString": "Then, We will ascertain who deserves to be cast into it."
        },
        {
            "verseNumber": 71,
            "verseString": "Every single one of you will traverse it; this is an irrevocable decree from your Lord."
        },
        {
            "verseNumber": 72,
            "verseString": "Then, We will rescue the righteous and leave the wrongdoers within it, on their knees."
        },
        {
            "verseNumber": 73,
            "verseString": "When Our clear verses are presented to them, those who disbelieve say to those who believe, “Which of the two parties is better in position and better in association?”"
        },
        {
            "verseNumber": 74,
            "verseString": "And how many a generation have We destroyed before them who were better in possessions and outward appearance?"
        },
        {
            "verseNumber": 75,
            "verseString": "Say, “The Most Merciful prolongs the life of those who are misguided.” Until they witness what they were warned of—either the punishment or the Hour. Then, they will realize who is in a weaker position and whose forces are fewer."
        },
        {
            "verseNumber": 76,
            "verseString": "God increases the guidance of those who are guided. The lasting acts of kindness are best with your Lord for reward, yielding the best return.",
            "verseStringReplacedWithAllah": "Allah increases the guidance of those who are guided. The lasting acts of kindness are best with your Lord for reward, yielding the best return."
        },
        {
            "verseNumber": 77,
            "verseString": "Did you consider him who denies Our revelations, and says, “I will be given wealth and children?”"
        },
        {
            "verseNumber": 78,
            "verseString": "Did he look into the unseen or receive a guarantee from the Merciful?"
        },
        {
            "verseNumber": 79,
            "verseString": "Absolutely not! We will write what he says, and We will prolong his agony for him."
        },
        {
            "verseNumber": 80,
            "verseString": "And We will inherit from him what he mentions, and he will come to Us alone."
        },
        {
            "verseNumber": 81,
            "verseString": "Did they take gods besides God to strengthen them?",
            "verseStringReplacedWithAllah": "Did they take gods besides Allah to strengthen them?"
        },
        {
            "verseNumber": 82,
            "verseString": "They will deny their worship of them and become opponents to them."
        },
        {
            "verseNumber": 83,
            "verseString": "Don’t you see how We send the devils against the unbelievers, provoking them with incitement?"
        },
        {
            "verseNumber": 84,
            "verseString": "So, don’t rush against them; We are counting for them a countdown."
        },
        {
            "verseNumber": 85,
            "verseString": "The Day when We gather the righteous to the Most Merciful as a delegation."
        },
        {
            "verseNumber": 86,
            "verseString": "And usher the sinners to Hell, driven in dehydration."
        },
        {
            "verseNumber": 87,
            "verseString": "None will have the power of intercession, except those who have received a promise from the Most Merciful."
        },
        {
            "verseNumber": 88,
            "verseString": "And they say, “The Compassionate has begotten a son.”"
        },
        {
            "verseNumber": 89,
            "verseString": "You’ve brought something monstrous."
        },
        {
            "verseNumber": 90,
            "verseString": "The heavens almost rupture therefrom, the earth splits open, and the mountains crumble to dust."
        },
        {
            "verseNumber": 91,
            "verseString": "Because they attribute a son to the Most Merciful."
        },
        {
            "verseNumber": 92,
            "verseString": "It’s not appropriate for the Most Benevolent to have a child."
        },
        {
            "verseNumber": 93,
            "verseString": "Every single one in the heavens and on earth will come to the Most Gracious as a servant."
        },
        {
            "verseNumber": 94,
            "verseString": "He accounted for them and enumerated them exactly."
        },
        {
            "verseNumber": 95,
            "verseString": "And every one of them will come to Him singly on Resurrection Day."
        },
        {
            "verseNumber": 96,
            "verseString": "Those who believe and do good deeds—the Mercy Giver will give them love."
        },
        {
            "verseNumber": 97,
            "verseString": "We’ve made it easy in your language, to give good news to the righteous, and to warn, with it, hostile people."
        },
        {
            "verseNumber": 98,
            "verseString": "How many generations did We destroy before them? Can you sense any of them or hear from them a whisper?"
        }
    ],
    "chapterNumber": 19,
    "nameInEnglish": "Mary",
    "nameInTransliteration": "Maryam",
    "nameInArabic": "مريم",
    "numberOfVerses": 98
}