{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Nuun. By the Pen and all that they inscribe."
        },
        {
            "verseNumber": 2,
            "verseString": "You are not, by the grace of your Lord, insane."
        },
        {
            "verseNumber": 3,
            "verseString": "You will receive an unending reward."
        },
        {
            "verseNumber": 4,
            "verseString": "And you possess a very noble character."
        },
        {
            "verseNumber": 5,
            "verseString": "You will see, and they will see."
        },
        {
            "verseNumber": 6,
            "verseString": "Which of you is the afflicted."
        },
        {
            "verseNumber": 7,
            "verseString": "Your Lord knows best who strays from His path, and He knows best who is guided."
        },
        {
            "verseNumber": 8,
            "verseString": "So, don’t yield to the deniers."
        },
        {
            "verseNumber": 9,
            "verseString": "They wish you would compromise so they, too, could compromise."
        },
        {
            "verseNumber": 10,
            "verseString": "And don’t obey any despicable oath-monger."
        },
        {
            "verseNumber": 11,
            "verseString": "A defamer, a spreader of slander."
        },
        {
            "verseNumber": 12,
            "verseString": "An obstructor of good, a transgressor, a sinner."
        },
        {
            "verseNumber": 13,
            "verseString": "Rude and fake."
        },
        {
            "verseNumber": 14,
            "verseString": "Just because he is wealthy and has children."
        },
        {
            "verseNumber": 15,
            "verseString": "When Our verses are conveyed to him, he says, “Legends of the ancients.”"
        },
        {
            "verseNumber": 16,
            "verseString": "We will mark him on the nose."
        },
        {
            "verseNumber": 17,
            "verseString": "We tested them, just as We tested the garden owners, when they vowed to harvest in the morning."
        },
        {
            "verseNumber": 18,
            "verseString": "And they didn’t make an exception."
        },
        {
            "verseNumber": 19,
            "verseString": "But a visitation from your Lord swept around it while they were asleep."
        },
        {
            "verseNumber": 20,
            "verseString": "And by morning, it was as if harvested."
        },
        {
            "verseNumber": 21,
            "verseString": "At dawn, they called one another."
        },
        {
            "verseNumber": 22,
            "verseString": "“Go early to your crop if you intend to harvest.”"
        },
        {
            "verseNumber": 23,
            "verseString": "And they set off, whispering amongst themselves."
        },
        {
            "verseNumber": 24,
            "verseString": "“Make sure no poor person enters your garden today.”"
        },
        {
            "verseNumber": 25,
            "verseString": "And they left early, firm in their resolve."
        },
        {
            "verseNumber": 26,
            "verseString": "But when they saw it, they said, “We must have strayed!"
        },
        {
            "verseNumber": 27,
            "verseString": "We are deprived!”"
        },
        {
            "verseNumber": 28,
            "verseString": "The most prudent among them said, “Didn’t I tell you to offer praise?”"
        },
        {
            "verseNumber": 29,
            "verseString": "They replied, “Glory be to our Lord! Indeed, we were wrongdoers.”"
        },
        {
            "verseNumber": 30,
            "verseString": "Then they turned to one another, blaming each other."
        },
        {
            "verseNumber": 31,
            "verseString": "They lamented, “Woe to us! We were domineering."
        },
        {
            "verseNumber": 32,
            "verseString": "Our Lord may give us a better substitute. We turn to our Lord in hope.”"
        },
        {
            "verseNumber": 33,
            "verseString": "Such is the suffering, yet the suffering of the Hereafter is greater, if they only knew."
        },
        {
            "verseNumber": 34,
            "verseString": "For the righteous with their Lord are the Gardens of Delight."
        },
        {
            "verseNumber": 35,
            "verseString": "Should We treat the submitters like the criminals?"
        },
        {
            "verseNumber": 36,
            "verseString": "What’s the matter with you? How do you judge?"
        },
        {
            "verseNumber": 37,
            "verseString": "Or do you have a book in which you study?"
        },
        {
            "verseNumber": 38,
            "verseString": "In it, you have whatever you prefer?"
        },
        {
            "verseNumber": 39,
            "verseString": "Or do you have guarantees from Us, reaching until Resurrection Day, that you will get whatever you judge?"
        },
        {
            "verseNumber": 40,
            "verseString": "Ask them, which of them can guarantee that."
        },
        {
            "verseNumber": 41,
            "verseString": "Or do they have partners? Then let them bring their partners, if they are truthful."
        },
        {
            "verseNumber": 42,
            "verseString": "On the Day the reality will be exposed, they will be called upon to prostrate, but they won’t be able to."
        },
        {
            "verseNumber": 43,
            "verseString": "Their eyes will be downcast, covered by disgrace; for they were called upon to prostrate when they were sound."
        },
        {
            "verseNumber": 44,
            "verseString": "So leave Me to those who deny this message. We will progressively lead them from where they don’t perceive."
        },
        {
            "verseNumber": 45,
            "verseString": "And I will give them time. My plan is firm."
        },
        {
            "verseNumber": 46,
            "verseString": "Or are you asking them for a fee, therefore they are burdened with debts?"
        },
        {
            "verseNumber": 47,
            "verseString": "Or do they have knowledge of the unseen, so they write it down?"
        },
        {
            "verseNumber": 48,
            "verseString": "Exercise patience for your Lord’s decree, and don’t be like the Fellow of the Whale, who called out in his affliction."
        },
        {
            "verseNumber": 49,
            "verseString": "Had it not been for a favor from his Lord, he would’ve been thrown onto the barren shore, and he was to blame."
        },
        {
            "verseNumber": 50,
            "verseString": "But his Lord chose him and made him of the righteous."
        },
        {
            "verseNumber": 51,
            "verseString": "Upon hearing the message, the unbelievers nearly pierce you with their glances and say, “He is surely crazy!”"
        },
        {
            "verseNumber": 52,
            "verseString": "But it is nothing but a reminder to the world."
        }
    ],
    "chapterNumber": 68,
    "nameInEnglish": "The Pen",
    "nameInTransliteration": "Al Qalam",
    "nameInArabic": "الـقـلـم",
    "numberOfVerses": 52
}