{
    "verses": [
        {
            "verseNumber": 1,
            "verseString": "A declaration of dissolution from God and His Messenger is hereby issued to the polytheists with whom you had entered into a treaty.",
            "verseStringReplacedWithAllah": "A declaration of dissolution from Allah and His Messenger is hereby issued to the polytheists with whom you had entered into a treaty."
        },
        {
            "verseNumber": 2,
            "verseString": "Travel the land freely for four months, but be aware that you can’t evade God’s grip, and that God will disgrace the disbelievers.",
            "verseStringReplacedWithAllah": "Travel the land freely for four months, but be aware that you can’t evade Allah’s grip, and that Allah will disgrace the disbelievers."
        },
        {
            "verseNumber": 3,
            "verseString": "A proclamation from God and His Messenger to all people on the day of the Great Pilgrimage: God disowns the polytheists, as does His Messenger. If you repent, it will be good for you, but if you turn away, know that you can’t evade God. Inform those who disbelieve of severe punishment.",
            "verseStringReplacedWithAllah": "A proclamation from Allah and His Messenger to all people on the day of the Great Pilgrimage: Allah disowns the polytheists, as does His Messenger. If you repent, it will be good for you, but if you turn away, know that you can’t evade Allah. Inform those who disbelieve of severe punishment."
        },
        {
            "verseNumber": 4,
            "verseString": "However, to those polytheists with whom you’ve made a treaty, and who didn’t violate any of its terms, nor supported anyone against you, complete their treaty until its period. God loves the righteous.",
            "verseStringReplacedWithAllah": "However, to those polytheists with whom you’ve made a treaty, and who didn’t violate any of its terms, nor supported anyone against you, complete their treaty until its period. Allah loves the righteous."
        },
        {
            "verseNumber": 5,
            "verseString": "When the Sacred Months have passed, slay the polytheists wherever you find them. Capture them, besiege them, and ambush them at every possible location. However, if they repent, establish prayer, and give in charity, let them go their way. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "When the Sacred Months have passed, slay the polytheists wherever you find them. Capture them, besiege them, and ambush them at every possible location. However, if they repent, establish prayer, and give in charity, let them go their way. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 6,
            "verseString": "If any of the polytheists seeks your protection, grant it to him, so that he may hear the Word of God. Then escort him to where he can be safe, for they are a people who lack knowledge.",
            "verseStringReplacedWithAllah": "If any of the polytheists seeks your protection, grant it to him, so that he may hear the Word of Allah. Then escort him to where he can be safe, for they are a people who lack knowledge."
        },
        {
            "verseNumber": 7,
            "verseString": "How can a treaty exist between God and His Messenger and the polytheists, except with those with whom you made a treaty at the Sacred Mosque? As long as they remain upright towards you, remain upright towards them. God loves the righteous.",
            "verseStringReplacedWithAllah": "How can a treaty exist between Allah and His Messenger and the polytheists, except with those with whom you made a treaty at the Sacred Mosque? As long as they remain upright towards you, remain upright towards them. Allah loves the righteous."
        },
        {
            "verseNumber": 8,
            "verseString": "How can it be when they gain dominance over you, they respect neither kinship nor treaty with you? They appease you with their mouths, but their hearts refuse, and most of them are sinful."
        },
        {
            "verseNumber": 9,
            "verseString": "They sold God’s verses for a trivial gain and obstructed His path. How awful is what they’ve been doing.",
            "verseStringReplacedWithAllah": "They sold Allah’s verses for a trivial gain and obstructed His path. How awful is what they’ve been doing."
        },
        {
            "verseNumber": 10,
            "verseString": "Towards a believer, they respect neither kinship nor treaty. These are the aggressors."
        },
        {
            "verseNumber": 11,
            "verseString": "If they repent, establish prayer, and give in charity, then they are your brothers in faith. We explain the verses for people who know."
        },
        {
            "verseNumber": 12,
            "verseString": "However, if they violate their oaths after their treaty, and they attack your religion, then fight the leaders of disbelief, for their oaths are nothing to them, so they may cease."
        },
        {
            "verseNumber": 13,
            "verseString": "Will you not fight against those who broke their oaths, sought to expel the Messenger, and initiated hostilities against you? Do you fear them? God is the one you should fear, if you are believers.",
            "verseStringReplacedWithAllah": "Will you not fight against those who broke their oaths, sought to expel the Messenger, and initiated hostilities against you? Do you fear them? Allah is the one you should fear, if you are believers."
        },
        {
            "verseNumber": 14,
            "verseString": "Fight them; God will punish them by your hands, disgrace them, give you victory over them, and heal the hearts of a believing people.",
            "verseStringReplacedWithAllah": "Fight them; Allah will punish them by your hands, disgrace them, give you victory over them, and heal the hearts of a believing people."
        },
        {
            "verseNumber": 15,
            "verseString": "And He makes the anger in their hearts subside. And God forgives whomever He wills; God is Knowing and Wise.",
            "verseStringReplacedWithAllah": "And He makes the anger in their hearts subside. And Allah forgives whomever He wills; Allah is Knowing and Wise."
        },
        {
            "verseNumber": 16,
            "verseString": "Do you think you will be left without God distinguishing those among you who strive and form alliances solely with God, His Messenger, and the believers? God is Acquainted with what you do.",
            "verseStringReplacedWithAllah": "Do you think you will be left without Allah distinguishing those among you who strive and form alliances solely with Allah, His Messenger, and the believers? Allah is Acquainted with what you do."
        },
        {
            "verseNumber": 17,
            "verseString": "The polytheists, steadfast in their disbelief, are not fit to maintain God’s sanctuaries. Their deeds have become worthless, and they will reside eternally in the Fire.",
            "verseStringReplacedWithAllah": "The polytheists, steadfast in their disbelief, are not fit to maintain Allah’s sanctuaries. Their deeds have become worthless, and they will reside eternally in the Fire."
        },
        {
            "verseNumber": 18,
            "verseString": "God’s sanctuaries are only maintained by those who have believed in God and the Last Day, establish prayer, give purifying alms, and fear none but God. These individuals are most likely to be guided.",
            "verseStringReplacedWithAllah": "Allah’s sanctuaries are only maintained by those who have believed in Allah and the Last Day, establish prayer, give purifying alms, and fear none but Allah. These individuals are most likely to be guided."
        },
        {
            "verseNumber": 19,
            "verseString": "Do you equate providing water to pilgrims and maintaining the Sacred Mosque with those who believe in God and the Last Day, and strive in the cause of God? They aren’t equal in God’s sight. God doesn’t guide the unjust people.",
            "verseStringReplacedWithAllah": "Do you equate providing water to pilgrims and maintaining the Sacred Mosque with those who believe in Allah and the Last Day, and strive in the cause of Allah? They aren’t equal in Allah’s sight. Allah doesn’t guide the unjust people."
        },
        {
            "verseNumber": 20,
            "verseString": "Those who believe, emigrate, and strive with their wealth and lives in God’s path hold a higher rank in God’s sight. These are the successful ones.",
            "verseStringReplacedWithAllah": "Those who believe, emigrate, and strive with their wealth and lives in Allah’s path hold a higher rank in Allah’s sight. These are the successful ones."
        },
        {
            "verseNumber": 21,
            "verseString": "Their Lord gives them good news of His mercy and approval and gardens where they will enjoy eternal bliss."
        },
        {
            "verseNumber": 22,
            "verseString": "They will abide there forever. With God is a great reward.",
            "verseStringReplacedWithAllah": "They will abide there forever. With Allah is a great reward."
        },
        {
            "verseNumber": 23,
            "verseString": "O you who believe, don’t take your parents and siblings as allies if they favor disbelief over faith. Whoever of you does so, those are the wrongdoers."
        },
        {
            "verseNumber": 24,
            "verseString": "Say, “If your parents, children, siblings, spouses, relatives, the wealth you’ve acquired, the business you fear may decline, and the homes you cherish are dearer to you than God, His Messenger, and striving in His path, then wait until God brings about His decree.” God doesn’t guide the sinful people.",
            "verseStringReplacedWithAllah": "Say, “If your parents, children, siblings, spouses, relatives, the wealth you’ve acquired, the business you fear may decline, and the homes you cherish are dearer to you than Allah, His Messenger, and striving in His path, then wait until Allah brings about His decree.” Allah doesn’t guide the sinful people."
        },
        {
            "verseNumber": 25,
            "verseString": "God granted you victories in numerous regions, but on the day of Hunain, your vast numbers impressed you, yet they availed you nothing. The earth, vast as it is, seemed to close in on you, and you turned back in retreat.",
            "verseStringReplacedWithAllah": "Allah granted you victories in numerous regions, but on the day of Hunain, your vast numbers impressed you, yet they availed you nothing. The earth, vast as it is, seemed to close in on you, and you turned back in retreat."
        },
        {
            "verseNumber": 26,
            "verseString": "Then, God sent down His tranquility upon His Messenger and the believers. He sent down forces you didn’t see and tormented those disbelieving. This is the compensation for the unbelievers.",
            "verseStringReplacedWithAllah": "Then, Allah sent down His tranquility upon His Messenger and the believers. He sent down forces you didn’t see and tormented those disbelieving. This is the compensation for the unbelievers."
        },
        {
            "verseNumber": 27,
            "verseString": "Afterward, God will relent towards whom He wills. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "Afterward, Allah will relent towards whom He wills. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 28,
            "verseString": "O you who believe, the Idolaters are impure, so they shouldn’t approach the Sacred Mosque after this year. If you fear financial loss, God will enrich you out of His grace, if He wills. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "O you who believe, the Idolaters are impure, so they shouldn’t approach the Sacred Mosque after this year. If you fear financial loss, Allah will enrich you out of His grace, if He wills. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 29,
            "verseString": "Fight those who don’t believe in God or the Last Day from among the People of the Scripture, who don’t forbid what God and His Messenger have forbidden, and who don’t embrace the religion of truth, until they pay the tax willingly and feel subdued.",
            "verseStringReplacedWithAllah": "Fight those who don’t believe in Allah or the Last Day from among the People of the Scripture, who don’t forbid what Allah and His Messenger have forbidden, and who don’t embrace the religion of truth, until they pay the tax willingly and feel subdued."
        },
        {
            "verseNumber": 30,
            "verseString": "The Jews say, “Uzair is the son of God,” and the Christians say, “The Messiah is the son of God.” These are their words; they mimic the utterances of those who disbelieved before. May God destroy them; how misguided they are!",
            "verseStringReplacedWithAllah": "The Jews say, “Uzair is the son of Allah,” and the Christians say, “The Messiah is the son of Allah.” These are their words; they mimic the utterances of those who disbelieved before. May Allah destroy them; how misguided they are!"
        },
        {
            "verseNumber": 31,
            "verseString": "They’ve taken their priests and saints as lords besides God; as well as the Messiah, the son of Mary. Yet, they were commanded to worship only One God. There is no god but He. Glory be to Him above what they associate with Him.",
            "verseStringReplacedWithAllah": "They’ve taken their priests and saints as lords besides Allah; as well as the Messiah, the son of Mary. Yet, they were commanded to worship only One God. There is no god but He. Glory be to Him above what they associate with Him."
        },
        {
            "verseNumber": 32,
            "verseString": "They seek to extinguish God’s light with their words, but God is insistent upon perfecting His light, despite the hatred of the unbelievers.",
            "verseStringReplacedWithAllah": "They seek to extinguish Allah’s light with their words, but Allah is insistent upon perfecting His light, despite the hatred of the unbelievers."
        },
        {
            "verseNumber": 33,
            "verseString": "It is He who sent His Messenger with guidance and the religion of truth, to make it prevail over all religions, despite the hatred of the associators."
        },
        {
            "verseNumber": 34,
            "verseString": "O you who believe, many religious leaders and scholars consume people’s wealth wrongfully and deter from the path of God. To those who hoard gold and silver, and don’t spend it in God’s way, announce to them a painful punishment.",
            "verseStringReplacedWithAllah": "O you who believe, many religious leaders and scholars consume people’s wealth wrongfully and deter from the path of Allah. To those who hoard gold and silver, and don’t spend it in Allah’s way, announce to them a painful punishment."
        },
        {
            "verseNumber": 35,
            "verseString": "On the day when it will be heated in the fire of Hell, and with it their foreheads, sides, and backs will be branded: “This is what you hoarded for yourselves, so taste what you hoarded.”"
        },
        {
            "verseNumber": 36,
            "verseString": "Since the day God created the heavens and the earth, God ordained twelve months in a year, four of which are sanctified. This is the correct order, so make no mistake about them. Fight the polytheists collectively, as they fight you collectively, and know that God is with the righteous.",
            "verseStringReplacedWithAllah": "Since the day Allah created the heavens and the earth, Allah ordained twelve months in a year, four of which are sanctified. This is the correct order, so make no mistake about them. Fight the polytheists collectively, as they fight you collectively, and know that Allah is with the righteous."
        },
        {
            "verseNumber": 37,
            "verseString": "Postponement is an increase in disbelief, leading the unbelievers astray. They permit it one year and forbid it another, to align with the number sanctified by God, thus allowing what God has prohibited. Their evil deeds are made appealing to them. God does not guide the disbelieving people.",
            "verseStringReplacedWithAllah": "Postponement is an increase in disbelief, leading the unbelievers astray. They permit it one year and forbid it another, to align with the number sanctified by Allah, thus allowing what Allah has prohibited. Their evil deeds are made appealing to them. Allah does not guide the disbelieving people."
        },
        {
            "verseNumber": 38,
            "verseString": "O you who believe, when you’re called to mobilize in God’s way, why do you cling heavily to the earth? Do you prefer the worldly life over the Hereafter? The enjoyment of this earthly life, compared to the Hereafter, is insignificant.",
            "verseStringReplacedWithAllah": "O you who believe, when you’re called to mobilize in Allah’s way, why do you cling heavily to the earth? Do you prefer the worldly life over the Hereafter? The enjoyment of this earthly life, compared to the Hereafter, is insignificant."
        },
        {
            "verseNumber": 39,
            "verseString": "If you don’t mobilize, He will inflict a severe punishment upon you and replace you with another people. And you won’t harm Him in the least. God is capable of all things.",
            "verseStringReplacedWithAllah": "If you don’t mobilize, He will inflict a severe punishment upon you and replace you with another people. And you won’t harm Him in the least. Allah is capable of all things."
        },
        {
            "verseNumber": 40,
            "verseString": "If you don’t support him, God has already supported him. When the unbelievers expelled him, he was one of two in the cave; he said to his friend, “Don’t worry, God is with us.” Then, God sent down His tranquility upon him, reinforced him with troops you didn’t see, and made the word of the unbelievers the lowest, while God’s word is the highest. God is Mighty and Wise.",
            "verseStringReplacedWithAllah": "If you don’t support him, Allah has already supported him. When the unbelievers expelled him, he was one of two in the cave; he said to his friend, “Don’t worry, Allah is with us.” Then, Allah sent down His tranquility upon him, reinforced him with troops you didn’t see, and made the word of the unbelievers the lowest, while Allah’s word is the highest. Allah is Mighty and Wise."
        },
        {
            "verseNumber": 41,
            "verseString": "Mobilize, light or heavy, and strive with your wealth and lives in God’s cause. This is better for you, if you only knew.",
            "verseStringReplacedWithAllah": "Mobilize, light or heavy, and strive with your wealth and lives in Allah’s cause. This is better for you, if you only knew."
        },
        {
            "verseNumber": 42,
            "verseString": "They would’ve followed you if there had been immediate gain and a short journey, but the distance seemed too great for them. They will swear by God, “If we could, we would’ve gone out with you.” They destroy themselves, and God knows that they are lying.",
            "verseStringReplacedWithAllah": "They would’ve followed you if there had been immediate gain and a short journey, but the distance seemed too great for them. They will swear by Allah, “If we could, we would’ve gone out with you.” They destroy themselves, and Allah knows that they are lying."
        },
        {
            "verseNumber": 43,
            "verseString": "God would pardon you! Why did you give them leave before it became clear to you those who were truthful and you knew the liars?",
            "verseStringReplacedWithAllah": "Allah would pardon you! Why did you give them leave before it became clear to you those who were truthful and you knew the liars?"
        },
        {
            "verseNumber": 44,
            "verseString": "Those who genuinely believe in God and the Last Day wouldn’t seek exemption from striving with their wealth and their lives. God is fully aware of the righteous.",
            "verseStringReplacedWithAllah": "Those who genuinely believe in Allah and the Last Day wouldn’t seek exemption from striving with their wealth and their lives. Allah is fully aware of the righteous."
        },
        {
            "verseNumber": 45,
            "verseString": "Only those who don’t believe in God and the Last Day seek exemption from you. Their hearts are filled with doubt, and they waver in their indecision.",
            "verseStringReplacedWithAllah": "Only those who don’t believe in Allah and the Last Day seek exemption from you. Their hearts are filled with doubt, and they waver in their indecision."
        },
        {
            "verseNumber": 46,
            "verseString": "Had they intended to mobilize, they would’ve made some preparation for it. However, God disapproved of their departure, so He held them back, and they were told, “Stay with those who remain behind.”",
            "verseStringReplacedWithAllah": "Had they intended to mobilize, they would’ve made some preparation for it. However, Allah disapproved of their departure, so He held them back, and they were told, “Stay with those who remain behind.”"
        },
        {
            "verseNumber": 47,
            "verseString": "Had they mobilized with you, they would’ve only added to your difficulties, spreading rumors and discord among you. Some of you are prone to listen to them. God is fully aware of the wrongdoers.",
            "verseStringReplacedWithAllah": "Had they mobilized with you, they would’ve only added to your difficulties, spreading rumors and discord among you. Some of you are prone to listen to them. Allah is fully aware of the wrongdoers."
        },
        {
            "verseNumber": 48,
            "verseString": "They sought dissension before and turned matters for you, until the truth emerged, and God’s decree prevailed, much to their dismay.",
            "verseStringReplacedWithAllah": "They sought dissension before and turned matters for you, until the truth emerged, and Allah’s decree prevailed, much to their dismay."
        },
        {
            "verseNumber": 49,
            "verseString": "Among them are those who say, “Please excuse me, and don’t tempt me.” They have already fallen into temptation. Hell will engulf the unbelievers."
        },
        {
            "verseNumber": 50,
            "verseString": "If good fortune comes your way, it troubles them, but if a calamity strikes you, they say, “We had taken our precautions in advance,” and they depart rejoicing."
        },
        {
            "verseNumber": 51,
            "verseString": "Say, “Nothing will happen to us except what God has destined for us. He is our Protector. In God should the believers place their trust.”",
            "verseStringReplacedWithAllah": "Say, “Nothing will happen to us except what Allah has destined for us. He is our Protector. In Allah should the believers place their trust.”"
        },
        {
            "verseNumber": 52,
            "verseString": "Say, “You can anticipate for us one of two favorable outcomes, while we await for you either God’s punishment or defeat at our hands. So wait; we, too, are waiting.”",
            "verseStringReplacedWithAllah": "Say, “You can anticipate for us one of two favorable outcomes, while we await for you either Allah’s punishment or defeat at our hands. So wait; we, too, are waiting.”"
        },
        {
            "verseNumber": 53,
            "verseString": "Say, “Spend willingly or unwillingly, it won’t be accepted from you, for you are a wicked people.”"
        },
        {
            "verseNumber": 54,
            "verseString": "Their contributions aren’t accepted because they reject God and His Messenger. Furthermore, they only attend prayer lazily, and they spend only grudgingly.",
            "verseStringReplacedWithAllah": "Their contributions aren’t accepted because they reject Allah and His Messenger. Furthermore, they only attend prayer lazily, and they spend only grudgingly."
        },
        {
            "verseNumber": 55,
            "verseString": "Let not their wealth or their children impress you. God intends to torment them with them in this life, and their souls depart while they are unbelievers.",
            "verseStringReplacedWithAllah": "Let not their wealth or their children impress you. Allah intends to torment them with them in this life, and their souls depart while they are unbelievers."
        },
        {
            "verseNumber": 56,
            "verseString": "They swear by God that they are of you, but they are not of you. They are people who cause discord.",
            "verseStringReplacedWithAllah": "They swear by Allah that they are of you, but they are not of you. They are people who cause discord."
        },
        {
            "verseNumber": 57,
            "verseString": "If they could find a refuge, a cave, or any place to retreat, they would rush headlong to it."
        },
        {
            "verseNumber": 58,
            "verseString": "Among them are those who criticize you regarding the distribution of alms. If they are given a portion, they are pleased, but if they are not given, they become angry."
        },
        {
            "verseNumber": 59,
            "verseString": "They should be satisfied with what God and His Messenger have given them, saying, “God is sufficient for us. God will grant us from His bounty, and so will His Messenger. We are toward God desirous.”",
            "verseStringReplacedWithAllah": "They should be satisfied with what Allah and His Messenger have given them, saying, “Allah is sufficient for us. Allah will grant us from His bounty, and so will His Messenger. We are toward Allah desirous.”"
        },
        {
            "verseNumber": 60,
            "verseString": "The charities are for the poor, the needy, its administrators, for reconciling hearts, for the freeing of slaves, for those in debt, for God’s cause, and for the homeless. This is a decree from God, and God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "The charities are for the poor, the needy, its administrators, for reconciling hearts, for the freeing of slaves, for those in debt, for Allah’s cause, and for the homeless. This is a decree from Allah, and Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 61,
            "verseString": "Among them are those who slander the Prophet, saying, “He is all ears.” Say, “He listens for your good. He believes in God, trusts the believers, and is a mercy to those who believe among you.” Those who slander God’s Messenger, for them is a painful punishment.",
            "verseStringReplacedWithAllah": "Among them are those who slander the Prophet, saying, “He is all ears.” Say, “He listens for your good. He believes in Allah, trusts the believers, and is a mercy to those who believe among you.” Those who slander Allah’s Messenger, for them is a painful punishment."
        },
        {
            "verseNumber": 62,
            "verseString": "They swear by God to appease you. However, it is God and His Messenger they should seek to please, if they are believers.",
            "verseStringReplacedWithAllah": "They swear by Allah to appease you. However, it is Allah and His Messenger they should seek to please, if they are believers."
        },
        {
            "verseNumber": 63,
            "verseString": "Don’t they know that whoever opposes God and His Messenger, for him is the Fire of Hell, to remain in it eternally? That is the great humiliation.",
            "verseStringReplacedWithAllah": "Don’t they know that whoever opposes Allah and His Messenger, for him is the Fire of Hell, to remain in it eternally? That is the great humiliation."
        },
        {
            "verseNumber": 64,
            "verseString": "The hypocrites are apprehensive that a Chapter may be revealed that will inform them of what’s in their hearts. Say, “Mock on, but God will expose what you fear.”",
            "verseStringReplacedWithAllah": "The hypocrites are apprehensive that a Chapter may be revealed that will inform them of what’s in their hearts. Say, “Mock on, but Allah will expose what you fear.”"
        },
        {
            "verseNumber": 65,
            "verseString": "If you question them, they will say, “We were only conversing and playing.” Say, “Do you make a mockery of God, His revelations, and His Messenger?”",
            "verseStringReplacedWithAllah": "If you question them, they will say, “We were only conversing and playing.” Say, “Do you make a mockery of Allah, His revelations, and His Messenger?”"
        },
        {
            "verseNumber": 66,
            "verseString": "Make no excuses. You have disbelieved after your belief. Should we forgive some of you, we will punish others: they have been guilty sinners."
        },
        {
            "verseNumber": 67,
            "verseString": "The hypocritical men and women are akin to one another. They order what is wrong, forbid what is right, and they close their hands. They forgot God, so He disregards them. The hypocrites are the sinners.",
            "verseStringReplacedWithAllah": "The hypocritical men and women are akin to one another. They order what is wrong, forbid what is right, and they close their hands. They forgot Allah, so He disregards them. The hypocrites are the sinners."
        },
        {
            "verseNumber": 68,
            "verseString": "God has promised the hypocrites, men and women, and the unbelievers the Fire of Hell, where they will dwell forever. It is their just compensation. God has cursed them, and they will endure perpetual torment.",
            "verseStringReplacedWithAllah": "Allah has promised the hypocrites, men and women, and the unbelievers the Fire of Hell, where they will dwell forever. It is their just compensation. Allah has cursed them, and they will endure perpetual torment."
        },
        {
            "verseNumber": 69,
            "verseString": "They are like those before you who were stronger, wealthier, and had more offspring. They enjoyed their own benefit, and you’ve enjoyed your own benefit, and you indulged the same as they indulged. Their deeds have become worthless in this world and the Hereafter. They are the losers."
        },
        {
            "verseNumber": 70,
            "verseString": "Didn’t they hear the stories of their predecessors—the people of Noah, Aad, Thamud, the people of Abraham, the inhabitants of Midian, and the Overturned Cities? Their messengers came to them with clear signs. God didn’t wrong them, it was themselves they wronged.",
            "verseStringReplacedWithAllah": "Didn’t they hear the stories of their predecessors—the people of Noah, Aad, Thamud, the people of Abraham, the inhabitants of Midian, and the Overturned Cities? Their messengers came to them with clear signs. Allah didn’t wrong them, it was themselves they wronged."
        },
        {
            "verseNumber": 71,
            "verseString": "The believing men and women are allies of one another. They advocate righteousness, forbid evil, establish prayer, give in charity, and obey God and His Messenger. Those—God will have mercy on them. God is Mighty and Wise.",
            "verseStringReplacedWithAllah": "The believing men and women are allies of one another. They advocate righteousness, forbid evil, establish prayer, give in charity, and obey Allah and His Messenger. Those—Allah will have mercy on them. Allah is Mighty and Wise."
        },
        {
            "verseNumber": 72,
            "verseString": "God promised the believing men and women gardens through which rivers flow, where they will abide forever, and beautiful mansions in the Gardens of Eternity. But the greatest of all is God’s approval. This is the ultimate triumph.",
            "verseStringReplacedWithAllah": "Allah promised the believing men and women gardens through which rivers flow, where they will abide forever, and beautiful mansions in the Gardens of Eternity. But the greatest of all is Allah’s approval. This is the ultimate triumph."
        },
        {
            "verseNumber": 73,
            "verseString": "O Prophet, strive against the unbelievers and the hypocrites, and be harsh with them. Their ultimate abode is Hell—a terrible destination."
        },
        {
            "verseNumber": 74,
            "verseString": "They swear by God that they said nothing, yet they did utter words of disbelief and renounced faith after their submission. They plotted things beyond their reach. Their resentment only arises because God and His Messenger have enriched them through His favor. If they repent, it will be better for them. But if they turn away, God will severely punish them in this world and the Hereafter. They will have no protector or helper on earth.",
            "verseStringReplacedWithAllah": "They swear by Allah that they said nothing, yet they did utter words of disbelief and renounced faith after their submission. They plotted things beyond their reach. Their resentment only arises because Allah and His Messenger have enriched them through His favor. If they repent, it will be better for them. But if they turn away, Allah will severely punish them in this world and the Hereafter. They will have no protector or helper on earth."
        },
        {
            "verseNumber": 75,
            "verseString": "Among them are those who pledged to God: “If he gives us from his bounty, we will give in charity and be among the righteous.”",
            "verseStringReplacedWithAllah": "Among them are those who pledged to Allah: “If he gives us from his bounty, we will give in charity and be among the righteous.”"
        },
        {
            "verseNumber": 76,
            "verseString": "Yet, when He bestowed His bounty upon them, they were stingy with it, turned their backs, and distanced themselves."
        },
        {
            "verseNumber": 77,
            "verseString": "Thus, He punished them with hypocrisy in their hearts, until the Day they will meet Him, due to their breach of their promise to God and their dishonesty.",
            "verseStringReplacedWithAllah": "Thus, He punished them with hypocrisy in their hearts, until the Day they will meet Him, due to their breach of their promise to Allah and their dishonesty."
        },
        {
            "verseNumber": 78,
            "verseString": "Don’t they know that God knows their secrets and their private conversations, and that God is the Knower of the unseen?",
            "verseStringReplacedWithAllah": "Don’t they know that Allah knows their secrets and their private conversations, and that Allah is the Knower of the unseen?"
        },
        {
            "verseNumber": 79,
            "verseString": "Those who criticize the believers who willingly give out in charity, and ridicule those who find nothing to give except their own efforts, God will ridicule them, and they will have a painful punishment.",
            "verseStringReplacedWithAllah": "Those who criticize the believers who willingly give out in charity, and ridicule those who find nothing to give except their own efforts, Allah will ridicule them, and they will have a painful punishment."
        },
        {
            "verseNumber": 80,
            "verseString": "Whether you ask forgiveness for them or not, even if you were to ask for it seventy times, God will not forgive them. This is because they denied God and His Messenger. God doesn’t guide the immoral people.",
            "verseStringReplacedWithAllah": "Whether you ask forgiveness for them or not, even if you were to ask for it seventy times, Allah will not forgive them. This is because they denied Allah and His Messenger. Allah doesn’t guide the immoral people."
        },
        {
            "verseNumber": 81,
            "verseString": "Those who stayed behind rejoiced in staying behind the Messenger of God, and they disliked striving with their wealth and lives in God’s cause. They said, “Don’t venture out in the heat.” Say, “The fire of Hell is hotter still—if only they could understand.”",
            "verseStringReplacedWithAllah": "Those who stayed behind rejoiced in staying behind the Messenger of Allah, and they disliked striving with their wealth and lives in Allah’s cause. They said, “Don’t venture out in the heat.” Say, “The fire of Hell is hotter still—if only they could understand.”"
        },
        {
            "verseNumber": 82,
            "verseString": "So let them laugh a little and cry much as recompense for what they used to earn."
        },
        {
            "verseNumber": 83,
            "verseString": "If God returns you to a group of them, and they ask for your permission to go out, say, “You will never march with me, nor will you fight an enemy with me. You were content to remain inactive the first time, so stay with those who stay behind.”",
            "verseStringReplacedWithAllah": "If Allah returns you to a group of them, and they ask for your permission to go out, say, “You will never march with me, nor will you fight an enemy with me. You were content to remain inactive the first time, so stay with those who stay behind.”"
        },
        {
            "verseNumber": 84,
            "verseString": "Never pray for any of them who dies, nor shall you stand at his graveside. They denied God and His Messenger, and they died while they were sinners.",
            "verseStringReplacedWithAllah": "Never pray for any of them who dies, nor shall you stand at his graveside. They denied Allah and His Messenger, and they died while they were sinners."
        },
        {
            "verseNumber": 85,
            "verseString": "Let not their wealth and their children impress you. God wants to punish them via them in this life, and their souls pass away while they are unbelievers.",
            "verseStringReplacedWithAllah": "Let not their wealth and their children impress you. Allah wants to punish them via them in this life, and their souls pass away while they are unbelievers."
        },
        {
            "verseNumber": 86,
            "verseString": "When a chapter is revealed, stating: “Believe in God and strive with His Messenger,” the affluent among them ask for your exemption, saying, “Let us be with those who stay behind.”",
            "verseStringReplacedWithAllah": "When a chapter is revealed, stating: “Believe in Allah and strive with His Messenger,” the affluent among them ask for your exemption, saying, “Let us be with those who stay behind.”"
        },
        {
            "verseNumber": 87,
            "verseString": "They are content to be with those who stay behind; their hearts were sealed, so they don’t understand."
        },
        {
            "verseNumber": 88,
            "verseString": "However, the Messenger and those who believed with him strive with their wealth and their lives. For these will be the good things, and it is they who will be successful."
        },
        {
            "verseNumber": 89,
            "verseString": "God has prepared for them gardens under which rivers flow, wherein they will abide forever. That’s the supreme success.",
            "verseStringReplacedWithAllah": "Allah has prepared for them gardens under which rivers flow, wherein they will abide forever. That’s the supreme success."
        },
        {
            "verseNumber": 90,
            "verseString": "Some Desert Arabs came with excuses, seeking an exemption, and those who lied to God and His Messenger sat. A painful punishment will strike those among them who disbelieved.",
            "verseStringReplacedWithAllah": "Some Desert Arabs came with excuses, seeking an exemption, and those who lied to Allah and His Messenger sat. A painful punishment will strike those among them who disbelieved."
        },
        {
            "verseNumber": 91,
            "verseString": "There is no blame upon the weak, nor upon the sick, nor upon those who find nothing to spend, provided they are true toward God and His messenger. There is no blame on those who do good. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "There is no blame upon the weak, nor upon the sick, nor upon those who find nothing to spend, provided they are true toward Allah and His messenger. There is no blame on those who do good. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 92,
            "verseString": "Nor on those who, when they came to you asking to be transported, and you said, “I have nothing to transport you on,” they turned away, their eyes overflowing with tears out of sadness that they couldn’t find the means to spend."
        },
        {
            "verseNumber": 93,
            "verseString": "The blame lies only with those who ask your permission while they are wealthy. They prefer to remain with those who stay behind, and God has sealed their hearts, leaving them devoid of understanding.",
            "verseStringReplacedWithAllah": "The blame lies only with those who ask your permission while they are wealthy. They prefer to remain with those who stay behind, and Allah has sealed their hearts, leaving them devoid of understanding."
        },
        {
            "verseNumber": 94,
            "verseString": "They will make excuses to you when you return to them. Say, “Don’t make excuses; we won’t believe you. God has informed us of your intentions. God and His Messenger will observe your actions, and you will be returned to the Knower of the unseen and the seen, who will inform you of everything you did.”",
            "verseStringReplacedWithAllah": "They will make excuses to you when you return to them. Say, “Don’t make excuses; we won’t believe you. Allah has informed us of your intentions. Allah and His Messenger will observe your actions, and you will be returned to the Knower of the unseen and the seen, who will inform you of everything you did.”"
        },
        {
            "verseNumber": 95,
            "verseString": "Upon your return to them, they will swear by God, hoping you will accept their excuses. Distance yourself from them, for they are impure, and their dwelling is Hell—a just compensation for their actions.",
            "verseStringReplacedWithAllah": "Upon your return to them, they will swear by Allah, hoping you will accept their excuses. Distance yourself from them, for they are impure, and their dwelling is Hell—a just compensation for their actions."
        },
        {
            "verseNumber": 96,
            "verseString": "They swear to you to gain your approval, but even if you approve of them, God doesn’t approve of the sinful people.",
            "verseStringReplacedWithAllah": "They swear to you to gain your approval, but even if you approve of them, Allah doesn’t approve of the sinful people."
        },
        {
            "verseNumber": 97,
            "verseString": "The Desert Arabs are the staunchest in disbelief and hypocrisy, and least likely to know the boundaries that God revealed to His Messenger. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "The Desert Arabs are the staunchest in disbelief and hypocrisy, and least likely to know the boundaries that Allah revealed to His Messenger. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 98,
            "verseString": "Among the Desert Arabs, some consider what they spend as a loss, and they await misfortunes to befall you. Yet, they will be afflicted by misfortunes. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "Among the Desert Arabs, some consider what they spend as a loss, and they await misfortunes to befall you. Yet, they will be afflicted by misfortunes. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 99,
            "verseString": "However, among the Desert Arabs are those who believe in God and the Last Day, and regard their contributions as a means to draw closer to God, and the prayers of the Messenger. Indeed, it will bring them nearer, and God will admit them into His mercy. God is Forgiving, Most Merciful.",
            "verseStringReplacedWithAllah": "However, among the Desert Arabs are those who believe in Allah and the Last Day, and regard their contributions as a means to draw closer to Allah, and the prayers of the Messenger. Indeed, it will bring them nearer, and Allah will admit them into His mercy. Allah is Forgiving, Most Merciful."
        },
        {
            "verseNumber": 100,
            "verseString": "The pioneers—the first of the Emigrants and the Helpers—and those who followed them in goodness: God is pleased with them, and they are pleased with Him. He prepared for them Gardens through which rivers flow, where they will dwell forever. This is the supreme achievement.",
            "verseStringReplacedWithAllah": "The pioneers—the first of the Emigrants and the Helpers—and those who followed them in goodness: Allah is pleased with them, and they are pleased with Him. He prepared for them Gardens through which rivers flow, where they will dwell forever. This is the supreme achievement."
        },
        {
            "verseNumber": 101,
            "verseString": "Among the Desert Arabs around you, some are hypocrites, as well as among the city dwellers. They are persistent in hypocrisy. You don’t know them, but We certainly do. We will punish them twice; then they will be returned to a severe punishment."
        },
        {
            "verseNumber": 102,
            "verseString": "And there are those who admit their sins, and they have mixed a righteous deed with another that was bad. Perhaps God will relent towards them. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "And there are those who admit their sins, and they have mixed a righteous deed with another that was bad. Perhaps Allah will relent towards them. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 103,
            "verseString": "Receive from their wealth a charity to purify and cleanse them, and pray for them. Your prayers bring them tranquility. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "Receive from their wealth a charity to purify and cleanse them, and pray for them. Your prayers bring them tranquility. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 104,
            "verseString": "Don’t they know that it is God who accepts repentance from His beings and receives charities, and that it is God who is the Acceptor of repentance and the Merciful?",
            "verseStringReplacedWithAllah": "Don’t they know that it is Allah who accepts repentance from His beings and receives charities, and that it is Allah who is the Acceptor of repentance and the Merciful?"
        },
        {
            "verseNumber": 105,
            "verseString": "Say, “Work! God will see your work and so will His Messenger and the believers. Then you will be returned to the Knower of the unseen and the seen, and He will inform you of everything you did.”",
            "verseStringReplacedWithAllah": "Say, “Work! Allah will see your work and so will His Messenger and the believers. Then you will be returned to the Knower of the unseen and the seen, and He will inform you of everything you did.”"
        },
        {
            "verseNumber": 106,
            "verseString": "And others deferred to the decree of God, whether He will punish them or whether He will forgive them. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "And others deferred to the decree of Allah, whether He will punish them or whether He will forgive them. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 107,
            "verseString": "Those who have established a mosque with the intent to cause harm, promote disbelief, sow discord among believers, and as an outpost for those who have previously waged war against God and His Messenger, they will swear, “we intended nothing but good.” Still, God bears witness that they are liars.",
            "verseStringReplacedWithAllah": "Those who have established a mosque with the intent to cause harm, promote disbelief, sow discord among believers, and as an outpost for those who have previously waged war against Allah and His Messenger, they will swear, “we intended nothing but good.” Still, Allah bears witness that they are liars."
        },
        {
            "verseNumber": 108,
            "verseString": "Don’t ever stand therein. A mosque established on righteousness from its very beginning is more deserving of your attendance. Within it are men who love to purify themselves, and God loves those who purify themselves.",
            "verseStringReplacedWithAllah": "Don’t ever stand therein. A mosque established on righteousness from its very beginning is more deserving of your attendance. Within it are men who love to purify themselves, and Allah loves those who purify themselves."
        },
        {
            "verseNumber": 109,
            "verseString": "Is one who lays the foundation of his building based on righteousness and seeking God’s approval better, or one who erects his building on the brink of a collapsing cliff that collapses with him into the fire of Hell? God does not guide the wrongdoing people.",
            "verseStringReplacedWithAllah": "Is one who lays the foundation of his building based on righteousness and seeking Allah’s approval better, or one who erects his building on the brink of a collapsing cliff that collapses with him into the fire of Hell? Allah does not guide the wrongdoing people."
        },
        {
            "verseNumber": 110,
            "verseString": "The building which they built won’t cease to be a cause of skepticism in their hearts, until their hearts are cut. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "The building which they built won’t cease to be a cause of skepticism in their hearts, until their hearts are cut. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 111,
            "verseString": "God has bought from the believers their lives and their wealth because Paradise is for them. They fight for God’s cause. They slay and are slain. This promise is binding on Him in the Torah, the Gospel, and the Quran. Who is more faithful to his covenant than God? So, rejoice in the deal you’ve made. This is the ultimate triumph.",
            "verseStringReplacedWithAllah": "Allah has bought from the believers their lives and their wealth because Paradise is for them. They fight for Allah’s cause. They slay and are slain. This promise is binding on Him in the Torah, the Gospel, and the Quran. Who is more faithful to his covenant than Allah? So, rejoice in the deal you’ve made. This is the ultimate triumph."
        },
        {
            "verseNumber": 112,
            "verseString": "Those who repent, worship, praise, journey, bow down, prostrate themselves, advocate for righteousness, forbid evil, and observe God’s limits—give good news to the believers.",
            "verseStringReplacedWithAllah": "Those who repent, worship, praise, journey, bow down, prostrate themselves, advocate for righteousness, forbid evil, and observe Allah’s limits—give good news to the believers."
        },
        {
            "verseNumber": 113,
            "verseString": "It’s not for the Prophet and the believers to seek forgiveness for the polytheists, even if they were their relatives, after it became clear to them that they are inhabitants of the blazing Fire."
        },
        {
            "verseNumber": 114,
            "verseString": "Abraham’s plea for his father’s forgiveness was only due to a promise he had made to him. But when it became clear to him that he is an enemy to God, he dissociated himself from him. Abraham was compassionate and forbearing.",
            "verseStringReplacedWithAllah": "Abraham’s plea for his father’s forgiveness was only due to a promise he had made to him. But when it became clear to him that he is an enemy to Allah, he dissociated himself from him. Abraham was compassionate and forbearing."
        },
        {
            "verseNumber": 115,
            "verseString": "God wouldn’t misguide a people after He has guided them, until He has made clear to them what they should avoid. God is knowledgeable of all things.",
            "verseStringReplacedWithAllah": "Allah wouldn’t misguide a people after He has guided them, until He has made clear to them what they should avoid. Allah is knowledgeable of all things."
        },
        {
            "verseNumber": 116,
            "verseString": "To God belongs the kingdom of the heavens and the earth; He gives life and causes death. You have no protector or helper other than God.",
            "verseStringReplacedWithAllah": "To Allah belongs the kingdom of the heavens and the earth; He gives life and causes death. You have no protector or helper other than Allah."
        },
        {
            "verseNumber": 117,
            "verseString": "God accepted the repentance of the Prophet, the emigrants, and the helpers who followed him during the hour of difficulty, after the hearts of a group of them had almost deviated. Then, He accepted their repentance. He is Kind and Merciful towards them.",
            "verseStringReplacedWithAllah": "Allah accepted the repentance of the Prophet, the emigrants, and the helpers who followed him during the hour of difficulty, after the hearts of a group of them had almost deviated. Then, He accepted their repentance. He is Kind and Merciful towards them."
        },
        {
            "verseNumber": 118,
            "verseString": "Also, the three were left behind; until, the earth, in all its vastness, became constricted for them, and their souls became narrowed for them, and they realized that there was no refuge from God, except toward Him. Then, He turned to them in mercy so they could repent. God is the Acceptor of Repentance, the Most Merciful.",
            "verseStringReplacedWithAllah": "Also, the three were left behind; until, the earth, in all its vastness, became constricted for them, and their souls became narrowed for them, and they realized that there was no refuge from Allah, except toward Him. Then, He turned to them in mercy so they could repent. Allah is the Acceptor of Repentance, the Most Merciful."
        },
        {
            "verseNumber": 119,
            "verseString": "O you who believe, fear God, and be among the truthful.",
            "verseStringReplacedWithAllah": "O you who believe, fear Allah, and be among the truthful."
        },
        {
            "verseNumber": 120,
            "verseString": "It’s not for the inhabitants of the city and the Desert Arabs around them to stay behind God’s Messenger, or to prefer themselves over him. Because they don’t suffer from thirst, fatigue, or hunger striving in the cause of God, nor take a step that infuriates the unbelievers, nor receive anything from an enemy, but it is recorded for them as a righteous deed. Truly, God does not waste the reward of those who do good.",
            "verseStringReplacedWithAllah": "It’s not for the inhabitants of the city and the Desert Arabs around them to stay behind Allah’s Messenger, or to prefer themselves over him. Because they don’t suffer from thirst, fatigue, or hunger striving in the cause of Allah, nor take a step that infuriates the unbelievers, nor receive anything from an enemy, but it is recorded for them as a righteous deed. Truly, Allah does not waste the reward of those who do good."
        },
        {
            "verseNumber": 121,
            "verseString": "No expenditure they make, small or large, or any ground they march across, will go unrecorded for them. God will reward them according to the best of their deeds.",
            "verseStringReplacedWithAllah": "No expenditure they make, small or large, or any ground they march across, will go unrecorded for them. Allah will reward them according to the best of their deeds."
        },
        {
            "verseNumber": 122,
            "verseString": "It is not for the believers to march out altogether. From every division that sets out, a group from each division should remain behind to gain knowledge in the religion, and to warn their people when they return to them, so they may beware."
        },
        {
            "verseNumber": 123,
            "verseString": "O you who believe, fight those of the unbelievers who attack you, and let them find harshness in you; and know that God is with the righteous.",
            "verseStringReplacedWithAllah": "O you who believe, fight those of the unbelievers who attack you, and let them find harshness in you; and know that Allah is with the righteous."
        },
        {
            "verseNumber": 124,
            "verseString": "Whenever a chapter is revealed, some of them ask, “Which of you has this increased in faith?” As for those who have believed, it increases their faith and they are rejoicing."
        },
        {
            "verseNumber": 125,
            "verseString": "But as for those in whose hearts is disease, it increases their filth to their filth; and they die while they are unbelievers."
        },
        {
            "verseNumber": 126,
            "verseString": "Don’t they see that they are tested once or twice every year? They still neither repent, nor do they remember."
        },
        {
            "verseNumber": 127,
            "verseString": "Whenever a chapter is revealed, they glance at each other, asking, “Does anyone see you?” Then, they turn away. God has turned their hearts away, because they are a people who don’t understand.",
            "verseStringReplacedWithAllah": "Whenever a chapter is revealed, they glance at each other, asking, “Does anyone see you?” Then, they turn away. Allah has turned their hearts away, because they are a people who don’t understand."
        },
        {
            "verseNumber": 128,
            "verseString": "There has come to you a messenger from among yourselves. Your hardship distresses him; he is deeply concerned for you; to the believers, he is kind and merciful."
        },
        {
            "verseNumber": 129,
            "verseString": "But if they turn away, say, “God is sufficient for me. There is no god but He. On Him I have relied, and He is the Lord of the Grand Throne.”",
            "verseStringReplacedWithAllah": "But if they turn away, say, “Allah is sufficient for me. There is no god but He. On Him I have relied, and He is the Lord of the Grand Throne.”"
        }
    ],
    "chapterNumber": 9,
    "nameInEnglish": "Repentance",
    "nameInTransliteration": "Al Tawbah",
    "nameInArabic": "التوبة",
    "numberOfVerses": 129
}