{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Everything in the heavens and the earth praises God, the Almighty, the All-Wise.",
            "verseStringReplacedWithAllah": "Everything in the heavens and the earth praises Allah, the Almighty, the All-Wise."
        },
        {
            "verseNumber": 2,
            "verseString": "His reign extends over the heavens and the earth. He gives life and causes death, and He has power over everything."
        },
        {
            "verseNumber": 3,
            "verseString": "He is the First and the Last, the Outward and the Inward, and He knows everything."
        },
        {
            "verseNumber": 4,
            "verseString": "It is He who created the heavens and the earth in six periods and then established Himself on the Throne. He knows what penetrates the earth and what emerges from it, what descends from the sky, and what ascends into it. He is with you wherever you may be, and God sees everything you do.",
            "verseStringReplacedWithAllah": "It is He who created the heavens and the earth in six periods and then established Himself on the Throne. He knows what penetrates the earth and what emerges from it, what descends from the sky, and what ascends into it. He is with you wherever you may be, and Allah sees everything you do."
        },
        {
            "verseNumber": 5,
            "verseString": "To Him belongs the sovereignty of the heavens and the earth. And to God, all matters are returned.",
            "verseStringReplacedWithAllah": "To Him belongs the sovereignty of the heavens and the earth. And to Allah, all matters are returned."
        },
        {
            "verseNumber": 6,
            "verseString": "He merges night into day, day into night; He is fully aware of the innermost secrets of the hearts."
        },
        {
            "verseNumber": 7,
            "verseString": "Believe in God and His Messenger, and spend from what He made you successors in. Those among you who believe and donate will have a great reward.",
            "verseStringReplacedWithAllah": "Believe in Allah and His Messenger, and spend from what He made you successors in. Those among you who believe and donate will have a great reward."
        },
        {
            "verseNumber": 8,
            "verseString": "Why wouldn’t you believe in God, when the Messenger invites you to have faith in your Lord? He has already taken a covenant from you—if you are believers.",
            "verseStringReplacedWithAllah": "Why wouldn’t you believe in Allah, when the Messenger invites you to have faith in your Lord? He has already taken a covenant from you—if you are believers."
        },
        {
            "verseNumber": 9,
            "verseString": "It is He who reveals clear verses to His servant, leading you from darkness into light. God is Most Gentle and Most Merciful towards you.",
            "verseStringReplacedWithAllah": "It is He who reveals clear verses to His servant, leading you from darkness into light. Allah is Most Gentle and Most Merciful towards you."
        },
        {
            "verseNumber": 10,
            "verseString": "What holds you back from contributing to God’s cause, when the entirety of the heavens and the Earth is His inheritance? None of you equals those who donated and fought before the conquest. Their rank is superior to those who gave and fought afterward. Nevertheless, God promises goodness to all. God is fully aware of your actions.",
            "verseStringReplacedWithAllah": "What holds you back from contributing to Allah’s cause, when the entirety of the heavens and the Earth is His inheritance? None of you equals those who donated and fought before the conquest. Their rank is superior to those who gave and fought afterward. Nevertheless, Allah promises goodness to all. Allah is fully aware of your actions."
        },
        {
            "verseNumber": 11,
            "verseString": "Who will give to God a generous loan, so He may multiply it for him manifold and grant him a noble reward?",
            "verseStringReplacedWithAllah": "Who will give to Allah a generous loan, so He may multiply it for him manifold and grant him a noble reward?"
        },
        {
            "verseNumber": 12,
            "verseString": "On that Day, you will see the believing men and women, their light shining before them and on their right: “Today, rejoice in Gardens through which rivers flow, where you will reside eternally. That is the great success.”"
        },
        {
            "verseNumber": 13,
            "verseString": "On that Day, the hypocritical men and women will call out to the believers, “Wait for us, let us absorb some of your light.” However, they will be told, “Go back behind you and seek light.” Then a wall with a door will be erected between them. Inside it will be mercy, and on the outside of it will be suffering."
        },
        {
            "verseNumber": 14,
            "verseString": "They will call out to them, “Were we not with you?” They will reply, “Yes, but you led yourselves into temptation. You hesitated, doubted, and your desires deluded you, until God’s decree came to pass. And the Deceiver deceived you about God.”",
            "verseStringReplacedWithAllah": "They will call out to them, “Were we not with you?” They will reply, “Yes, but you led yourselves into temptation. You hesitated, doubted, and your desires deluded you, until Allah’s decree came to pass. And the Deceiver deceived you about Allah.”"
        },
        {
            "verseNumber": 15,
            "verseString": "“Today, no ransom will be accepted from you or from those who disbelieved. Your dwelling is the Fire—it is most suited for you; a terrible destination.”"
        },
        {
            "verseNumber": 16,
            "verseString": "Isn’t it time yet for the believers’ hearts to become humble to God’s remembrance and the revealed truth? They shouldn’t be like those who were given the Scripture before, whose hearts hardened over time, and many of them are sinners.",
            "verseStringReplacedWithAllah": "Isn’t it time yet for the believers’ hearts to become humble to Allah’s remembrance and the revealed truth? They shouldn’t be like those who were given the Scripture before, whose hearts hardened over time, and many of them are sinners."
        },
        {
            "verseNumber": 17,
            "verseString": "Know that God revives the earth after its death. We’ve clearly explained Our revelations to you, so you may understand.",
            "verseStringReplacedWithAllah": "Know that Allah revives the earth after its death. We’ve clearly explained Our revelations to you, so you may understand."
        },
        {
            "verseNumber": 18,
            "verseString": "The charitable men and women who lend to God a good loan: it will be multiplied for them, and they will have a generous reward.",
            "verseStringReplacedWithAllah": "The charitable men and women who lend to Allah a good loan: it will be multiplied for them, and they will have a generous reward."
        },
        {
            "verseNumber": 19,
            "verseString": "Those who believe in God and His messengers—they are the truthful and the witnesses before their Lord. They will have their reward and their light. But those who disbelieve and deny Our signs—they are the inhabitants of the Blaze.",
            "verseStringReplacedWithAllah": "Those who believe in Allah and His messengers—they are the truthful and the witnesses before their Lord. They will have their reward and their light. But those who disbelieve and deny Our signs—they are the inhabitants of the Blaze."
        },
        {
            "verseNumber": 20,
            "verseString": "Know that the life of this world is but play, diversion, glitter, boasting among you, and competition in increase of wealth and children—like rain whose resulting crop delights the unbelievers; then it withers, and you see it turning yellow; then it becomes scattered debris. There is severe punishment, forgiveness from God, and approval in the Hereafter. The life of this world is nothing more than the enjoyment of delusion.",
            "verseStringReplacedWithAllah": "Know that the life of this world is but play, diversion, glitter, boasting among you, and competition in increase of wealth and children—like rain whose resulting crop delights the unbelievers; then it withers, and you see it turning yellow; then it becomes scattered debris. There is severe punishment, forgiveness from Allah, and approval in the Hereafter. The life of this world is nothing more than the enjoyment of delusion."
        },
        {
            "verseNumber": 21,
            "verseString": "Race toward forgiveness from your Lord, and a Paradise as vast as the heavens and the earth, prepared for those who believe in God and His messengers. This is God’s bounty, which He gives to whom He wills. God is the possessor of immense bounty.",
            "verseStringReplacedWithAllah": "Race toward forgiveness from your Lord, and a Paradise as vast as the heavens and the earth, prepared for those who believe in Allah and His messengers. This is Allah’s bounty, which He gives to whom He wills. Allah is the possessor of immense bounty."
        },
        {
            "verseNumber": 22,
            "verseString": "Every calamity that strikes the earth or yourselves was recorded before We brought it into existence. This is easy for God.",
            "verseStringReplacedWithAllah": "Every calamity that strikes the earth or yourselves was recorded before We brought it into existence. This is easy for Allah."
        },
        {
            "verseNumber": 23,
            "verseString": "So that you may not despair over what eludes you, nor rejoice over what He has given you. God doesn’t love the boastful or the arrogant.",
            "verseStringReplacedWithAllah": "So that you may not despair over what eludes you, nor rejoice over what He has given you. Allah doesn’t love the boastful or the arrogant."
        },
        {
            "verseNumber": 24,
            "verseString": "Those who are reluctant to give and advise others to be the same; and whoever turns away—God is the Self-Sufficient, the Praiseworthy.",
            "verseStringReplacedWithAllah": "Those who are reluctant to give and advise others to be the same; and whoever turns away—Allah is the Self-Sufficient, the Praiseworthy."
        },
        {
            "verseNumber": 25,
            "verseString": "We sent Our messengers with clear signs, and We sent down with them the Scripture and the Balance, so that people may uphold justice. We also sent down iron, in which is a great strength and benefits for humankind, so that God may distinguish those who support Him and His messengers, although unseen. God is Powerful and Mighty.",
            "verseStringReplacedWithAllah": "We sent Our messengers with clear signs, and We sent down with them the Scripture and the Balance, so that people may uphold justice. We also sent down iron, in which is a great strength and benefits for humankind, so that Allah may distinguish those who support Him and His messengers, although unseen. Allah is Powerful and Mighty."
        },
        {
            "verseNumber": 26,
            "verseString": "We sent Noah and Abraham, and We established prophethood and Scripture among their descendants. Some of them were guided, yet many are sinners."
        },
        {
            "verseNumber": 27,
            "verseString": "Then, following their footsteps, We sent Our messengers, and We sent Jesus, the son of Mary, and We gave him the Gospel. We instilled compassion and mercy into the hearts of his followers. They invented monasticism, which We had not prescribed for them—only seeking God’s approval, but they didn’t observe it with due observance. Therefore, We gave those among them who believed their reward, but many of them are sinners.",
            "verseStringReplacedWithAllah": "Then, following their footsteps, We sent Our messengers, and We sent Jesus, the son of Mary, and We gave him the Gospel. We instilled compassion and mercy into the hearts of his followers. They invented monasticism, which We had not prescribed for them—only seeking Allah’s approval, but they didn’t observe it with due observance. Therefore, We gave those among them who believed their reward, but many of them are sinners."
        },
        {
            "verseNumber": 28,
            "verseString": "O you who believe, be conscious of God, and believe in His Messenger; He will give you a double share of His mercy, and He will make for you a light by which you walk, and forgive you. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "O you who believe, be conscious of Allah, and believe in His Messenger; He will give you a double share of His mercy, and He will make for you a light by which you walk, and forgive you. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 29,
            "verseString": "The People of the Scripture should know that they have no monopoly whatsoever over God’s mercy and grace, and that all grace and mercy are in God’s hands. He grants them to whom He wills. God is the possessor of vast bounty.",
            "verseStringReplacedWithAllah": "The People of the Scripture should know that they have no monopoly whatsoever over Allah’s mercy and grace, and that all grace and mercy are in Allah’s hands. He grants them to whom He wills. Allah is the possessor of vast bounty."
        }
    ],
    "chapterNumber": 57,
    "nameInEnglish": "Iron",
    "nameInTransliteration": "Al Hadid",
    "nameInArabic": "الحـديد",
    "numberOfVerses": 29
}