{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "O you, Enwrapped."
        },
        {
            "verseNumber": 2,
            "verseString": "Stand in prayer at night, except for a little."
        },
        {
            "verseNumber": 3,
            "verseString": "Half of it, or subtract a little from it."
        },
        {
            "verseNumber": 4,
            "verseString": "Or add to it, and recite the Quran with measured recitation."
        },
        {
            "verseNumber": 5,
            "verseString": "We will send down to you a heavy word."
        },
        {
            "verseNumber": 6,
            "verseString": "The night vigil is more effective, and more suitable for understanding."
        },
        {
            "verseNumber": 7,
            "verseString": "You have during the day long engagements."
        },
        {
            "verseNumber": 8,
            "verseString": "Invoke the name of your Lord, and dedicate yourself to Him wholeheartedly."
        },
        {
            "verseNumber": 9,
            "verseString": "Lord of the east and the west, there is no deity except Him, so take Him as Trustee."
        },
        {
            "verseNumber": 10,
            "verseString": "And bear patiently what they say, and leave them in a dignified manner."
        },
        {
            "verseNumber": 11,
            "verseString": "And leave Me and the deniers, the possessors of ease and comfort; and respite them for a while."
        },
        {
            "verseNumber": 12,
            "verseString": "We prepared chains, and a blazing fire."
        },
        {
            "verseNumber": 13,
            "verseString": "And food that gags, and a torment most painful."
        },
        {
            "verseNumber": 14,
            "verseString": "The Day the earth and the mountains will quake, and the mountains will become like shifting mounds of sand."
        },
        {
            "verseNumber": 15,
            "verseString": "We have sent to you a Messenger, a witness over you, just as We sent a Messenger to Pharaoh."
        },
        {
            "verseNumber": 16,
            "verseString": "But Pharaoh defied the Messenger, so We seized him with a devastating grip."
        },
        {
            "verseNumber": 17,
            "verseString": "If you persist in disbelief, how will you guard yourselves on a Day that will turn children’s hair white?"
        },
        {
            "verseNumber": 18,
            "verseString": "The heavens will crack from it. His promise is always fulfilled."
        },
        {
            "verseNumber": 19,
            "verseString": "This is a reminder, so whoever wills may take a path toward his Lord."
        },
        {
            "verseNumber": 20,
            "verseString": "Your Lord knows that you stand for nearly two-thirds of the night, or half of it, or a third of it, and so do a party of those who are with you. God regulates the night and the day. He knew that you wouldn’t be able to do it, so He relented towards you. Read what’s easy from the Quran. He knows that some of you may be ill, others traveling through the land seeking God’s bounty, and others fighting in God’s cause. So read what’s easy from it. Establish prayer, give the purifying charity, and lend God a good loan. Whatever good you forward for yourselves, you’ll find it with God, better and more significant in reward. And seek forgiveness from God; God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "Your Lord knows that you stand for nearly two-thirds of the night, or half of it, or a third of it, and so do a party of those who are with you. Allah regulates the night and the day. He knew that you wouldn’t be able to do it, so He relented towards you. Read what’s easy from the Quran. He knows that some of you may be ill, others traveling through the land seeking Allah’s bounty, and others fighting in Allah’s cause. So read what’s easy from it. Establish prayer, give the purifying charity, and lend Allah a good loan. Whatever good you forward for yourselves, you’ll find it with Allah, better and more significant in reward. And seek forgiveness from Allah; Allah is Forgiving and Merciful."
        }
    ],
    "chapterNumber": 73,
    "nameInEnglish": "The Enwrapped",
    "nameInTransliteration": "Al Muzzammil",
    "nameInArabic": "الـمـزمـل",
    "numberOfVerses": 20
}