{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Praise be to God, to whom belongs everything in the heavens and the earth, and praise be to Him in the Hereafter. He is the Wise, the Expert.",
            "verseStringReplacedWithAllah": "Praise be to Allah, to whom belongs everything in the heavens and the earth, and praise be to Him in the Hereafter. He is the Wise, the Expert."
        },
        {
            "verseNumber": 2,
            "verseString": "He knows what penetrates the earth and what emerges from it, what descends from the sky, and what ascends to it. He is the Merciful, the Forgiving."
        },
        {
            "verseNumber": 3,
            "verseString": "Those disbelieving say, “The Hour won’t come upon us.” Say, “Yes, by my Lord, it will surely come upon you. He is the Knower of the Unseen.” Not an atom’s weight within the heavens and the earth escapes from His knowledge, nor anything smaller or larger, but it is recorded in a clear book."
        },
        {
            "verseNumber": 4,
            "verseString": "He will reward those who believe and do good deeds. For them is forgiveness and generous provision."
        },
        {
            "verseNumber": 5,
            "verseString": "But for those who strive against Our verses, trying to undermine them, will be a torment of painful wrath."
        },
        {
            "verseNumber": 6,
            "verseString": "Those endowed with knowledge recognize that what’s revealed to you from your Lord is the truth, guiding to the path of the Almighty, the Praiseworthy."
        },
        {
            "verseNumber": 7,
            "verseString": "Those who disbelieved said, “Shall we point out to you a man who will inform you, that when you’ve disintegrated completely, you will be created anew?”"
        },
        {
            "verseNumber": 8,
            "verseString": "“Did he invent a lie about God, or is he afflicted with madness?” Those who don’t believe in the Hereafter suffer and are far astray.",
            "verseStringReplacedWithAllah": "“Did he invent a lie about Allah, or is he afflicted with madness?” Those who don’t believe in the Hereafter suffer and are far astray."
        },
        {
            "verseNumber": 9,
            "verseString": "Didn’t they consider what’s before them and what’s behind them of the heavens and the earth? If We will, We could let the earth swallow them, or drop pieces of the sky on them. In this, there is a sign for every returning servant."
        },
        {
            "verseNumber": 10,
            "verseString": "We bestowed upon David a grace from Us: “O mountains, sing praises with him, and you birds as well.” And We softened iron for him."
        },
        {
            "verseNumber": 11,
            "verseString": "“Craft coats of armor, and balance the links well. And work righteousness. I am observant of what you do.”"
        },
        {
            "verseNumber": 12,
            "verseString": "For Solomon, the wind, its outward journey was one month, and its return journey was one month. We made a spring of tar flow for him. Among Jinns are those who worked for him by his Lord’s permission. Whoever deviated from Our command among them, We made him taste of the punishment of the Blaze."
        },
        {
            "verseNumber": 13,
            "verseString": "They made for him whatever he pleased—sanctuaries, statues, bowls like reservoirs, and firmly fixed cooking pots. “Work gratefully, O house of David.” But few of My servants are grateful."
        },
        {
            "verseNumber": 14,
            "verseString": "When We decreed his death, nothing showed them his death except an earthworm consuming his staff. When he fell, the jinn perceived that if they had known the unseen, they wouldn’t have remained in the shameful torment."
        },
        {
            "verseNumber": 15,
            "verseString": "There was a sign for Sheba in their homeland: two gardens, one on the right and one on the left. “Eat from your Lord’s provisions, and give thanks to Him. A good land and a forgiving Lord.”"
        },
        {
            "verseNumber": 16,
            "verseString": "Yet they turned away, so We sent upon them the Flood of Dam, and We replaced their two gardens with gardens yielding bitter fruit, tamarisks, and a few thorny shrubs."
        },
        {
            "verseNumber": 17,
            "verseString": "We penalized them for their ingratitude. Would we penalize any but the ungrateful?"
        },
        {
            "verseNumber": 18,
            "verseString": "We placed between them and the towns that We had blessed, prominent towns, and We determined the distances between them: “Travel safely between them, night and day.”"
        },
        {
            "verseNumber": 19,
            "verseString": "Yet they said, “Our Lord, extend the distances of our journeys,” and they wronged themselves. As a result, We made them legends and scattered them in every direction. There are signs in this for every patient, grateful individual."
        },
        {
            "verseNumber": 20,
            "verseString": "Satan’s prediction for them proved accurate; they followed him, except for a group of believers."
        },
        {
            "verseNumber": 21,
            "verseString": "He had no authority over them, except to distinguish those who believed in the Hereafter from those who harbored doubts. Your Lord oversees everything."
        },
        {
            "verseNumber": 22,
            "verseString": "Say, “Call upon those you claim besides God. They don’t possess even an atom’s weight in the heavens or the earth, nor do they have any share in them. And He has no helpers among them.”",
            "verseStringReplacedWithAllah": "Say, “Call upon those you claim besides Allah. They don’t possess even an atom’s weight in the heavens or the earth, nor do they have any share in them. And He has no helpers among them.”"
        },
        {
            "verseNumber": 23,
            "verseString": "Intercession with Him avails nothing except those to whom He grants permission. Once fear is dispelled from their hearts, they will ask, “What did your Lord say?” They will answer, “The truth; and He is the Most High, the Great.”"
        },
        {
            "verseNumber": 24,
            "verseString": "Say, “Who provides for you from the heavens and the earth?” Say, “God,” and “Either us or you are on guidance or clearly in the wrong.”",
            "verseStringReplacedWithAllah": "Say, “Who provides for you from the heavens and the earth?” Say, “Allah,” and “Either us or you are on guidance or clearly in the wrong.”"
        },
        {
            "verseNumber": 25,
            "verseString": "Say, “You won’t be held accountable for our sins, nor will we be held accountable for your actions.”"
        },
        {
            "verseNumber": 26,
            "verseString": "Say, “Our Lord will gather us together, then He will judge justly between us. He is the All-Knowing Judge.”"
        },
        {
            "verseNumber": 27,
            "verseString": "Say, “Show me those you’ve attached to Him as partners. No, indeed! He is God, the Mighty, the Wise.”",
            "verseStringReplacedWithAllah": "Say, “Show me those you’ve attached to Him as partners. No, indeed! He is Allah, the Mighty, the Wise.”"
        },
        {
            "verseNumber": 28,
            "verseString": "We sent you as a messenger to all of humanity, bearing good news and warnings, but most people are unaware."
        },
        {
            "verseNumber": 29,
            "verseString": "They ask, “When is this promise, if you are truthful?”"
        },
        {
            "verseNumber": 30,
            "verseString": "Say, “For you, there is a promised Day. You cannot delay it by an hour, nor can you bring it forward.”"
        },
        {
            "verseNumber": 31,
            "verseString": "The unbelievers say, “We will never believe in this Quran, nor in what preceded it.” If only you could see the wrongdoers, held captive before their Lord, casting blame on one another. Those who were oppressed will say to those who were arrogant, “If not for you, we would’ve been believers.”"
        },
        {
            "verseNumber": 32,
            "verseString": "The arrogant will answer the oppressed, “Did we deter you from guidance after it had reached you? No, indeed, you were the ones who transgressed.”"
        },
        {
            "verseNumber": 33,
            "verseString": "The oppressed will say to the arrogant, “Rather, it was your constant scheming, day and night, urging us to disbelieve in God and set up rivals to Him.” And they will hide their regret when they see the punishment. We will place iron collars around the necks of the unbelievers. Won’t they be recompensed for what they did?",
            "verseStringReplacedWithAllah": "The oppressed will say to the arrogant, “Rather, it was your constant scheming, day and night, urging us to disbelieve in Allah and set up rivals to Him.” And they will hide their regret when they see the punishment. We will place iron collars around the necks of the unbelievers. Won’t they be recompensed for what they did?"
        },
        {
            "verseNumber": 34,
            "verseString": "Every time We sent a warner to a city, its affluent inhabitants responded by saying, “We reject the message you’ve been sent with.”"
        },
        {
            "verseNumber": 35,
            "verseString": "They say, “We have more wealth and children, and we won’t be punished.”"
        },
        {
            "verseNumber": 36,
            "verseString": "Say, “My Lord expands and restricts provision for whom He wills, yet most people don’t know.”"
        },
        {
            "verseNumber": 37,
            "verseString": "It is not your wealth or your children that will bring you closer to Us. But those who believe and perform righteous deeds—their rewards will be multiplied, and they will reside in secure homes."
        },
        {
            "verseNumber": 38,
            "verseString": "Those who strive to invalidate Our verses will be subject to punishment."
        },
        {
            "verseNumber": 39,
            "verseString": "Say, “My Lord provides for whom He wills among His servants and restricts for him. Whatever you spend of anything, He will replace it; and He is the best of providers.”"
        },
        {
            "verseNumber": 40,
            "verseString": "On the Day He will gather them all together, then say to the angels, “Was it you these people used to worship?”"
        },
        {
            "verseNumber": 41,
            "verseString": "They will respond, “Glory to You! Our loyalty is to You, not to them. Rather, they were worshiping the jinn; most of them were believers in them.”"
        },
        {
            "verseNumber": 42,
            "verseString": "“Today, you have no power to benefit or harm one another.” And We will say to those who acted unjustly, “Taste the punishment of the Fire, which you used to deny.”"
        },
        {
            "verseNumber": 43,
            "verseString": "When Our clear verses are recited to them, they say, “This is nothing but a man who wants to deviate you from what your fathers worshiped.” And they say, “This is nothing but fabricated fiction.” When truth reaches those who disbelieve, they dismiss it as nothing but an obvious sorcery."
        },
        {
            "verseNumber": 44,
            "verseString": "We didn’t give them any scriptures to study, nor did We send any warner to them before you."
        },
        {
            "verseNumber": 45,
            "verseString": "Their predecessors also denied, despite not having attained even a tenth of what We had given them. They denied My messengers, so how was My reproach?"
        },
        {
            "verseNumber": 46,
            "verseString": "Say, “I only advise you on one matter: that you stand for God in pairs or individually, and then reflect. There is no insanity in your friend; he is only a warner to you before the onset of a severe punishment.”",
            "verseStringReplacedWithAllah": "Say, “I only advise you on one matter: that you stand for Allah in pairs or individually, and then reflect. There is no insanity in your friend; he is only a warner to you before the onset of a severe punishment.”"
        },
        {
            "verseNumber": 47,
            "verseString": "Say, “Whatever payment I have asked of you; it is yours. My reward is from God alone, who bears witness to all things.”",
            "verseStringReplacedWithAllah": "Say, “Whatever payment I have asked of you; it is yours. My reward is from Allah alone, who bears witness to all things.”"
        },
        {
            "verseNumber": 48,
            "verseString": "Say, “My Lord casts the truth, the Knower of the unseen.”"
        },
        {
            "verseNumber": 49,
            "verseString": "Say, “The truth has come, while falsehood can neither originate nor repeat.”"
        },
        {
            "verseNumber": 50,
            "verseString": "Say, “If I have strayed, I stray only to my detriment. And if I’m guided, it’s by what my Lord reveals to me. He is All-Hearing and Ever Near.”"
        },
        {
            "verseNumber": 51,
            "verseString": "If only you could see, when they will be frightened, with no escape, and they are seized from a place nearby."
        },
        {
            "verseNumber": 52,
            "verseString": "They will say, “We have believed in it.” But how can they attain it from a faraway place?"
        },
        {
            "verseNumber": 53,
            "verseString": "They had already disbelieved in it before, conjecturing about the unseen from a distant place."
        },
        {
            "verseNumber": 54,
            "verseString": "A barrier was placed between them and what they desire, just as was done with their past counterparts. They were in disquieting doubt."
        }
    ],
    "chapterNumber": 34,
    "nameInEnglish": "Sheba",
    "nameInTransliteration": "Saba",
    "nameInArabic": "سبإ",
    "numberOfVerses": 54
}