{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Everything in the heavens and on earth praises God, the Almighty, the All-Wise.",
            "verseStringReplacedWithAllah": "Everything in the heavens and on earth praises Allah, the Almighty, the All-Wise."
        },
        {
            "verseNumber": 2,
            "verseString": "It is He who expelled the disbelieving People of the Scripture from their homes during the first gathering. You didn’t anticipate their departure, and they assumed their strongholds would protect them from God. However, God came upon them from where they didn’t expect, striking fear into their hearts. They demolished their homes with their own hands and the believer’s hands. Therefore, take a lesson, O people of understanding.",
            "verseStringReplacedWithAllah": "It is He who expelled the disbelieving People of the Scripture from their homes during the first gathering. You didn’t anticipate their departure, and they assumed their strongholds would protect them from Allah. However, Allah came upon them from where they didn’t expect, striking fear into their hearts. They demolished their homes with their own hands and the believer’s hands. Therefore, take a lesson, O people of understanding."
        },
        {
            "verseNumber": 3,
            "verseString": "Had God not decreed their banishment, He would’ve punished them in this world. And in the Hereafter, they will face the torment of the Fire.",
            "verseStringReplacedWithAllah": "Had Allah not decreed their banishment, He would’ve punished them in this world. And in the Hereafter, they will face the torment of the Fire."
        },
        {
            "verseNumber": 4,
            "verseString": "That is because they opposed God and His Messenger. Whoever opposes God—God is severe in penalty.",
            "verseStringReplacedWithAllah": "That is because they opposed Allah and His Messenger. Whoever opposes Allah—Allah is severe in penalty."
        },
        {
            "verseNumber": 5,
            "verseString": "What you cut down of the trees or left standing on their trunks, it was with God’s permission, to disgrace the wicked.",
            "verseStringReplacedWithAllah": "What you cut down of the trees or left standing on their trunks, it was with Allah’s permission, to disgrace the wicked."
        },
        {
            "verseNumber": 6,
            "verseString": "The gains that God granted His Messenger from them, without you having to mount on horses or camels, are because God gives His messengers authority over whomever He wills. God has power over all things.",
            "verseStringReplacedWithAllah": "The gains that Allah granted His Messenger from them, without you having to mount on horses or camels, are because Allah gives His messengers authority over whomever He wills. Allah has power over all things."
        },
        {
            "verseNumber": 7,
            "verseString": "The gains that God allocated to His Messenger from the town-dwellers are for God, the Messenger, the relatives, the orphans, the needy, and the person on the path—so it may not only circulate among the wealthy among you. Accept what the Messenger gives you, and refrain from what he forbids you. Fear God, for God is severe in retribution.",
            "verseStringReplacedWithAllah": "The gains that Allah allocated to His Messenger from the town-dwellers are for Allah, the Messenger, the relatives, the orphans, the needy, and the person on the path—so it may not only circulate among the wealthy among you. Accept what the Messenger gives you, and refrain from what he forbids you. Fear Allah, for Allah is severe in retribution."
        },
        {
            "verseNumber": 8,
            "verseString": "For the impoverished emigrants who were expelled from their homes and their properties, seeking favor from God and His approval, and supporting God and His Messenger—these are the truthful ones.",
            "verseStringReplacedWithAllah": "For the impoverished emigrants who were expelled from their homes and their properties, seeking favor from Allah and His approval, and supporting Allah and His Messenger—these are the truthful ones."
        },
        {
            "verseNumber": 9,
            "verseString": "Those who had taken up residence and faith before them, love those who emigrated to them, and find no hesitation in their hearts in assisting them. They prioritize them over themselves, despite their own needs. Those who protect themselves from their own stinginess are the successful ones."
        },
        {
            "verseNumber": 10,
            "verseString": "And those who came after them pray: “Our Lord, forgive us and our brethren who preceded us in faith, and leave no resentment in our hearts towards those who have believed. Our Lord, You are Most Kind, Most Merciful.”"
        },
        {
            "verseNumber": 11,
            "verseString": "Didn’t you see the hypocrites who say to their disbelieving brethren among the People of the Scripture, “If you are expelled, we will surely go out with you, and we will never obey anyone against you; and if you are fought, we will surely help you.” But God testifies that they are liars.",
            "verseStringReplacedWithAllah": "Didn’t you see the hypocrites who say to their disbelieving brethren among the People of the Scripture, “If you are expelled, we will surely go out with you, and we will never obey anyone against you; and if you are fought, we will surely help you.” But Allah testifies that they are liars."
        },
        {
            "verseNumber": 12,
            "verseString": "If they are expelled, they won’t go out with them; if they are attacked, they won’t help them. And even if they were to help them, they would turn their backs, then they wouldn’t be helped."
        },
        {
            "verseNumber": 13,
            "verseString": "Their fear of you is more intense than their fear of God. This is because they are people who don’t comprehend.",
            "verseStringReplacedWithAllah": "Their fear of you is more intense than their fear of Allah. This is because they are people who don’t comprehend."
        },
        {
            "verseNumber": 14,
            "verseString": "They won’t fight you except from within fortified towns or behind walls. Their internal strife is intense. You may perceive them as united, but their hearts are fragmented. This is because they are people who lack understanding."
        },
        {
            "verseNumber": 15,
            "verseString": "Like those before them, they experienced the evil consequences of their conduct, and an agonizing punishment awaits them."
        },
        {
            "verseNumber": 16,
            "verseString": "Like the example of Satan, when he lures a person into disbelief. But when he disbelieves, he says, “I am innocent of you; I fear God, the Lord of the worlds.”",
            "verseStringReplacedWithAllah": "Like the example of Satan, when he lures a person into disbelief. But when he disbelieves, he says, “I am innocent of you; I fear Allah, the Lord of the worlds.”"
        },
        {
            "verseNumber": 17,
            "verseString": "The end result for them is the Fire, where they will dwell forever. This is the recompense for those who do wrong."
        },
        {
            "verseNumber": 18,
            "verseString": "O you who believe, be conscious of God, and let each soul consider what it has prepared for tomorrow. And fear God, for He knows everything you do.",
            "verseStringReplacedWithAllah": "O you who believe, be conscious of Allah, and let each soul consider what it has prepared for tomorrow. And fear Allah, for He knows everything you do."
        },
        {
            "verseNumber": 19,
            "verseString": "And be not like those who forgot God, so He made them forget themselves. These are the sinners.",
            "verseStringReplacedWithAllah": "And be not like those who forgot Allah, so He made them forget themselves. These are the sinners."
        },
        {
            "verseNumber": 20,
            "verseString": "Not equal are the inhabitants of the Fire and the inhabitants of Paradise. The inhabitants of Paradise—they are the victorious."
        },
        {
            "verseNumber": 21,
            "verseString": "If We had revealed this Quran upon a mountain, you would’ve seen it humbled, shattered from fear of God. We present these parables to people, so they may reflect.",
            "verseStringReplacedWithAllah": "If We had revealed this Quran upon a mountain, you would’ve seen it humbled, shattered from fear of Allah. We present these parables to people, so they may reflect."
        },
        {
            "verseNumber": 22,
            "verseString": "He is God, besides whom there is no god, the Knower of the invisible and the visible. He is the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "He is Allah, besides whom there is no god, the Knower of the invisible and the visible. He is the Gracious, the Merciful."
        },
        {
            "verseNumber": 23,
            "verseString": "He is God, other than whom there is no deity, the Sovereign, the Sacred, the Source of Peace, the Giver of Faith, the Overseer, the Mighty, the Compeller, the Majestic. Glory be to God, far beyond what they associate with Him.",
            "verseStringReplacedWithAllah": "He is Allah, other than whom there is no deity, the Sovereign, the Sacred, the Source of Peace, the Giver of Faith, the Overseer, the Mighty, the Compeller, the Majestic. Glory be to Allah, far beyond what they associate with Him."
        },
        {
            "verseNumber": 24,
            "verseString": "He is God, the Creator, the Inventor, the Designer. To Him belong the most beautiful names. All that’s in the heavens and the earth declares His glory. He is the Almighty, the All-Wise.",
            "verseStringReplacedWithAllah": "He is Allah, the Creator, the Inventor, the Designer. To Him belong the most beautiful names. All that’s in the heavens and the earth declares His glory. He is the Almighty, the All-Wise."
        }
    ],
    "chapterNumber": 59,
    "nameInEnglish": "The Gathering",
    "nameInTransliteration": "Al Hashr",
    "nameInArabic": "الـحـشـر",
    "numberOfVerses": 24
}