{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif. Lam. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "This Book, beyond doubt, is a revelation from the Lord of the worlds."
        },
        {
            "verseNumber": 3,
            "verseString": "Do they say, “He fabricated it”? No, it is the truth from your Lord, to warn a people who received no prior warning, so they may be guided."
        },
        {
            "verseNumber": 4,
            "verseString": "It is God who created the heavens and the earth, and whatever is between, in six periods, then He established Himself upon the throne. You have no protector or intercessor apart from Him. Will you not remember?",
            "verseStringReplacedWithAllah": "It is Allah who created the heavens and the earth, and whatever is between, in six periods, then He established Himself upon the throne. You have no protector or intercessor apart from Him. Will you not remember?"
        },
        {
            "verseNumber": 5,
            "verseString": "He directs the affairs from the heavens to the earth; then it ascends to Him, in a Day the measure of which is a thousand years according to your calculations."
        },
        {
            "verseNumber": 6,
            "verseString": "He is the Knower of the unseen and the seen, the Almighty, the Most Merciful."
        },
        {
            "verseNumber": 7,
            "verseString": "He who perfected everything that He created and began the creation of man from clay."
        },
        {
            "verseNumber": 8,
            "verseString": "Then, He made his reproduction from an extract of a base fluid."
        },
        {
            "verseNumber": 9,
            "verseString": "Then He shaped him and breathed into him from His Spirit, giving you hearing, sight, and intelligence. Yet, you are seldom grateful."
        },
        {
            "verseNumber": 10,
            "verseString": "They question, “After we have disintegrated into the earth, are we to be created anew?” In fact, they deny the meeting with their Lord."
        },
        {
            "verseNumber": 11,
            "verseString": "Say, “The angel of death, assigned to you, will reclaim you, then you will be returned to your Lord.”"
        },
        {
            "verseNumber": 12,
            "verseString": "If only you could see when the guilty bow their heads before their Lord: “Our Lord, we’ve seen and heard, so send us back, and we will act righteously. We are now convinced.”"
        },
        {
            "verseNumber": 13,
            "verseString": "Had We willed, We could’ve given every soul its guidance, but My decree has been fulfilled: “I will fill Hell with jinn and humans altogether.”"
        },
        {
            "verseNumber": 14,
            "verseString": "So taste, because you forgot the meeting of this Day of yours. We’ve forgotten you. Taste the punishment of eternity for what you used to do."
        },
        {
            "verseNumber": 15,
            "verseString": "When reminded of them, those who believe in Our revelations fall prostrate and glorify their Lord with praise, without any pride."
        },
        {
            "verseNumber": 16,
            "verseString": "Their sides shun their beds, calling upon their Lord in fear and hope. And from what We’ve provided for them, they spend."
        },
        {
            "verseNumber": 17,
            "verseString": "No soul knows what delights to the eyes are kept hidden for it—a reward for their deeds."
        },
        {
            "verseNumber": 18,
            "verseString": "Is the believer like the sinner? They are not equal."
        },
        {
            "verseNumber": 19,
            "verseString": "As for those who believe and do righteous deeds, for them are the Gardens of Refuge, as accommodation for what they used to do."
        },
        {
            "verseNumber": 20,
            "verseString": "But for those who defiantly disobey, their dwelling will be the Fire. Every time they wish to get out of it, they will be returned to it, and it will be said to them, “Taste the punishment of the Fire which you used to deny.”"
        },
        {
            "verseNumber": 21,
            "verseString": "We will make them taste the lesser suffering, before the greater suffering, so they may return."
        },
        {
            "verseNumber": 22,
            "verseString": "Who is more unjust than the one who, when reminded of his Lord’s verses, turns away from them? We will take revenge on the criminals."
        },
        {
            "verseNumber": 23,
            "verseString": "We gave Moses the Scripture, so don’t be in doubt about His meeting. And We made it a guide for the Children of Israel."
        },
        {
            "verseNumber": 24,
            "verseString": "We selected leaders from among them, who, under Our guidance, directed others, as long as they demonstrated steadfastness and had unwavering belief in Our revelations."
        },
        {
            "verseNumber": 25,
            "verseString": "On the Day of Resurrection, your Lord will adjudicate among them concerning the matters they disputed."
        },
        {
            "verseNumber": 26,
            "verseString": "Isn’t it a lesson for them, how many generations We destroyed before them, in whose dwellings they walk? Indeed in that are signs; do they not hear?"
        },
        {
            "verseNumber": 27,
            "verseString": "Don’t they see that We drive water to barren land, and with it, We produce crops that they and their livestock eat? Can’t they see?"
        },
        {
            "verseNumber": 28,
            "verseString": "And they say, “When will this judgment come, if you are truthful?”"
        },
        {
            "verseNumber": 29,
            "verseString": "Say, “On the day of judgment, the faith of those who disbelieved won’t benefit them, nor will they be reprieved.”"
        },
        {
            "verseNumber": 30,
            "verseString": "So turn away from them and wait, they are also waiting."
        }
    ],
    "chapterNumber": 32,
    "nameInEnglish": "Prostration",
    "nameInTransliteration": "As Sajdah",
    "nameInArabic": "السجدة",
    "numberOfVerses": 30
}