{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif. Lam. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "The Romans have been defeated."
        },
        {
            "verseNumber": 3,
            "verseString": "In the nearest region of the land, and yet, after their defeat, they will be victorious."
        },
        {
            "verseNumber": 4,
            "verseString": "Within a few years—to God belongs the command, before and after. And on that day, the believers will rejoice.",
            "verseStringReplacedWithAllah": "Within a few years—to Allah belongs the command, before and after. And on that day, the believers will rejoice."
        },
        {
            "verseNumber": 5,
            "verseString": "In the victory of God. He grants victory to whom He wills. He is the Almighty, the Merciful.",
            "verseStringReplacedWithAllah": "In the victory of Allah. He grants victory to whom He wills. He is the Almighty, the Merciful."
        },
        {
            "verseNumber": 6,
            "verseString": "The promise of God—God never breaks His promise, but most people don’t know.",
            "verseStringReplacedWithAllah": "The promise of Allah—Allah never breaks His promise, but most people don’t know."
        },
        {
            "verseNumber": 7,
            "verseString": "They know the superficial aspects of this worldly life, but they are oblivious to the Hereafter."
        },
        {
            "verseNumber": 8,
            "verseString": "Don’t they reflect within themselves? God didn’t create the heavens, the earth, and what’s between them, except with the truth and for a determined term. Yet, many among humankind deny the meeting with their Lord.",
            "verseStringReplacedWithAllah": "Don’t they reflect within themselves? Allah didn’t create the heavens, the earth, and what’s between them, except with the truth and for a determined term. Yet, many among humankind deny the meeting with their Lord."
        },
        {
            "verseNumber": 9,
            "verseString": "Didn’t they travel through the earth and see how was the end of those before them? They were stronger than them. They tilled the ground and developed it more than they have developed it. Their messengers came to them with clear proofs. Surely, God was not to wrong them; they wronged themselves.",
            "verseStringReplacedWithAllah": "Didn’t they travel through the earth and see how was the end of those before them? They were stronger than them. They tilled the ground and developed it more than they have developed it. Their messengers came to them with clear proofs. Surely, Allah was not to wrong them; they wronged themselves."
        },
        {
            "verseNumber": 10,
            "verseString": "The outcome for those who did evil was the worst, because they denied God’s signs and they used to ridicule them.",
            "verseStringReplacedWithAllah": "The outcome for those who did evil was the worst, because they denied Allah’s signs and they used to ridicule them."
        },
        {
            "verseNumber": 11,
            "verseString": "God begins creation; then He will repeat it; then you will be returned to Him.",
            "verseStringReplacedWithAllah": "Allah begins creation; then He will repeat it; then you will be returned to Him."
        },
        {
            "verseNumber": 12,
            "verseString": "On the Day the Hour sets in, the guilty will be struck with despair."
        },
        {
            "verseNumber": 13,
            "verseString": "None of their associates will intercede for them, and they will reject their partners."
        },
        {
            "verseNumber": 14,
            "verseString": "On the Day when the Hour appears—on that Day, they will be separated."
        },
        {
            "verseNumber": 15,
            "verseString": "As for those who believed and did righteous deeds, they will be made happy in a Garden."
        },
        {
            "verseNumber": 16,
            "verseString": "However, those who disbelieved, denied Our revelations and the meeting of the Hereafter—those will be ushered into punishment."
        },
        {
            "verseNumber": 17,
            "verseString": "So exalted is God when you reach the evening and when you reach the morning.",
            "verseStringReplacedWithAllah": "So exalted is Allah when you reach the evening and when you reach the morning."
        },
        {
            "verseNumber": 18,
            "verseString": "To Him belongs all praise in the heavens and the earth, and in the late afternoon, and when the day begins to decline."
        },
        {
            "verseNumber": 19,
            "verseString": "He brings the living from the dead, and He brings the dead from the living, and He revives the earth after its death. Likewise, you will be resurrected."
        },
        {
            "verseNumber": 20,
            "verseString": "Among His signs is that He created you from dust—and behold—you are humans spreading."
        },
        {
            "verseNumber": 21,
            "verseString": "And among His signs is that He created for you, of yourselves, spouses, so that you may find tranquility in them, and He placed between you love and mercy. In that are signs for those who reflect."
        },
        {
            "verseNumber": 22,
            "verseString": "And among His signs is the creation of the heavens and the earth, and the variations of your languages and your colors. In that are signs for the knowledgeable."
        },
        {
            "verseNumber": 23,
            "verseString": "And among His signs is your sleep, during both night and day, and your pursuit of His bounty. In that are signs for people who would hear."
        },
        {
            "verseNumber": 24,
            "verseString": "And among His signs is that He shows you the lightning, causing fear and aspiration, and He sends rain down from the sky, reviving the earth after its death. In that are lessons for those who understand."
        },
        {
            "verseNumber": 25,
            "verseString": "And among His signs is that heaven and earth stand by His command. Then, when He calls you out from the earth, you will emerge at once."
        },
        {
            "verseNumber": 26,
            "verseString": "Every being in the heavens and on earth belongs to Him; all are obedient to Him."
        },
        {
            "verseNumber": 27,
            "verseString": "He is the One who begins creation, then repeats it, and it is easier for Him. To Him pertains the highest example in the heavens and on earth. He is the Mighty, the Wise."
        },
        {
            "verseNumber": 28,
            "verseString": "He offers you a comparison from your own selves: would you make your servants equal partners in your wealth, you fear them as you fear each other? Thus, We make the revelations clear for those who reflect."
        },
        {
            "verseNumber": 29,
            "verseString": "The wrongdoers follow their desires without knowledge. Who can guide those whom God has led astray? They have no helpers.",
            "verseStringReplacedWithAllah": "The wrongdoers follow their desires without knowledge. Who can guide those whom Allah has led astray? They have no helpers."
        },
        {
            "verseNumber": 30,
            "verseString": "Embrace the faith of monotheism—the inclination God has instilled in humans. There is no altering of God’s creation. This is the upright religion, yet most people are unaware.",
            "verseStringReplacedWithAllah": "Embrace the faith of monotheism—the inclination Allah has instilled in humans. There is no altering of Allah’s creation. This is the upright religion, yet most people are unaware."
        },
        {
            "verseNumber": 31,
            "verseString": "Turn to Him, be conscious of Him, and establish prayer. And don’t be of those who associate others with Him."
        },
        {
            "verseNumber": 32,
            "verseString": "Those who divided their religion and became denominations, each faction rejoicing in what they possess."
        },
        {
            "verseNumber": 33,
            "verseString": "When adversity touches people, they call upon their Lord, turning sincerely to Him. Yet when He gives them a taste of His mercy, some of them ascribe partners to their Lord."
        },
        {
            "verseNumber": 34,
            "verseString": "In this way, they are ungrateful for what We’ve given them. Enjoy the fleeting pleasure; you will find out."
        },
        {
            "verseNumber": 35,
            "verseString": "Did We grant them any authority that justifies their association of partners with Him?"
        },
        {
            "verseNumber": 36,
            "verseString": "When We let people taste mercy, they rejoice in it. But when adversity strikes them as a result of their actions, they fall into despair."
        },
        {
            "verseNumber": 37,
            "verseString": "Don’t they realize that God expands the provision for whom He wills, and He restricts it? Therein lie signs for a people who believe.",
            "verseStringReplacedWithAllah": "Don’t they realize that Allah expands the provision for whom He wills, and He restricts it? Therein lie signs for a people who believe."
        },
        {
            "verseNumber": 38,
            "verseString": "So give the near kin his due right, and also the needy and the displaced. This is best for those who seek God’s favor; these are the ones who will prosper.",
            "verseStringReplacedWithAllah": "So give the near kin his due right, and also the needy and the displaced. This is best for those who seek Allah’s favor; these are the ones who will prosper."
        },
        {
            "verseNumber": 39,
            "verseString": "The interest you charge to increase people’s wealth doesn’t grow with God. But the charity you give, seeking God’s presence, these are the ones that will multiply.",
            "verseStringReplacedWithAllah": "The interest you charge to increase people’s wealth doesn’t grow with Allah. But the charity you give, seeking Allah’s presence, these are the ones that will multiply."
        },
        {
            "verseNumber": 40,
            "verseString": "God is the One who created you, provides for you, causes you to die, and then revives you. Can any of your ’partners’ do any of that? Glorified is He, and exalted above what they associate with Him.",
            "verseStringReplacedWithAllah": "Allah is the One who created you, provides for you, causes you to die, and then revives you. Can any of your ’partners’ do any of that? Glorified is He, and exalted above what they associate with Him."
        },
        {
            "verseNumber": 41,
            "verseString": "Corruption has appeared on land and sea, because of what people’s hands have done, causing them to experience some of the effects of their deeds, so they may return."
        },
        {
            "verseNumber": 42,
            "verseString": "Say, “Roam the earth, and see the outcome of those who came before. Most of them were polytheists.”"
        },
        {
            "verseNumber": 43,
            "verseString": "Dedicate yourself to the authentic, ever-true religion, before a Day comes from God that can’t be averted. On that Day, they will be divided.",
            "verseStringReplacedWithAllah": "Dedicate yourself to the authentic, ever-true religion, before a Day comes from Allah that can’t be averted. On that Day, they will be divided."
        },
        {
            "verseNumber": 44,
            "verseString": "The disbelief of the unbelievers only serves to burden them; meanwhile, those who act righteously are preparing for their own selves."
        },
        {
            "verseNumber": 45,
            "verseString": "He rewards those who believe and do good works from His bounty. He doesn’t love the unbelievers."
        },
        {
            "verseNumber": 46,
            "verseString": "Among His signs are the winds, heralds of good news, enabling you to experience His mercy. Ships sail by His command, for you to seek from His bounty, so you may give thanks."
        },
        {
            "verseNumber": 47,
            "verseString": "We sent before you messengers to their own peoples and they came to them with clear proofs. Then, We exacted retribution from those who sinned. It is incumbent upon Us to help the believers."
        },
        {
            "verseNumber": 48,
            "verseString": "God is the One who releases the winds, stirring up clouds. He spreads them across the sky as He wills, and He breaks them up. You see raindrops issuing from within them. Then, when He makes it fall upon whom He will of His beings, behold, they rejoice.",
            "verseStringReplacedWithAllah": "Allah is the One who releases the winds, stirring up clouds. He spreads them across the sky as He wills, and He breaks them up. You see raindrops issuing from within them. Then, when He makes it fall upon whom He will of His beings, behold, they rejoice."
        },
        {
            "verseNumber": 49,
            "verseString": "Though before it was sent down upon them—just before that—they were in despair."
        },
        {
            "verseNumber": 50,
            "verseString": "Look at the traces of God’s mercy, how He revives the earth after its death. He is the One who will revive the dead, and He has power over all things.",
            "verseStringReplacedWithAllah": "Look at the traces of Allah’s mercy, how He revives the earth after its death. He is the One who will revive the dead, and He has power over all things."
        },
        {
            "verseNumber": 51,
            "verseString": "But if We send a wind, and they see it turning things yellow, they would, after that, persist in their disbelief."
        },
        {
            "verseNumber": 52,
            "verseString": "You can’t make the dead hear, nor can you make the deaf hear the call when they’ve turned their backs and retreated."
        },
        {
            "verseNumber": 53,
            "verseString": "And you can’t guide the blind out of their misguidance. You can make hear only those who believe in Our messages and have submitted."
        },
        {
            "verseNumber": 54,
            "verseString": "God is the One who created you weak, then made you strong after weakness, then decreed after strength, weakness and old age. He creates as He wills. He is the All-Knowing, the All-Powerful.",
            "verseStringReplacedWithAllah": "Allah is the One who created you weak, then made you strong after weakness, then decreed after strength, weakness and old age. He creates as He wills. He is the All-Knowing, the All-Powerful."
        },
        {
            "verseNumber": 55,
            "verseString": "On the Day when the Hour arrives, the criminals will swear they remained only an hour; thus are they deluded."
        },
        {
            "verseNumber": 56,
            "verseString": "Those given knowledge and faith will say, “According to God’s decree, you remained until Resurrection Day. This is the Day of Resurrection, but you were unaware.”",
            "verseStringReplacedWithAllah": "Those given knowledge and faith will say, “According to Allah’s decree, you remained until Resurrection Day. This is the Day of Resurrection, but you were unaware.”"
        },
        {
            "verseNumber": 57,
            "verseString": "On that Day, the excuses of those who did wrong won’t benefit them, nor will they be permitted to make amends."
        },
        {
            "verseNumber": 58,
            "verseString": "In this Quran, We present various parables for people. Yet, regardless of what verse you offer them, the unbelievers will say, “You are just making things up.”"
        },
        {
            "verseNumber": 59,
            "verseString": "Thus God seals the hearts of those who don’t know.",
            "verseStringReplacedWithAllah": "Thus Allah seals the hearts of those who don’t know."
        },
        {
            "verseNumber": 60,
            "verseString": "So be patient; the promise of God is truth. And let not those who lack certainty discourage you.",
            "verseStringReplacedWithAllah": "So be patient; the promise of Allah is truth. And let not those who lack certainty discourage you."
        }
    ],
    "chapterNumber": 30,
    "nameInEnglish": "The Romans",
    "nameInTransliteration": "Ar Rum",
    "nameInArabic": "الروم",
    "numberOfVerses": 60
}