{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "When the hypocrites come to you, they say, “We testify that you are God’s Messenger.” Yet, God knows that you are His Messenger, and God testifies that the hypocrites are liars.",
            "verseStringReplacedWithAllah": "When the hypocrites come to you, they say, “We testify that you are Allah’s Messenger.” Yet, Allah knows that you are His Messenger, and Allah testifies that the hypocrites are liars."
        },
        {
            "verseNumber": 2,
            "verseString": "They use their oaths as a shield, hindering others from God’s path. Their deeds are indeed deplorable.",
            "verseStringReplacedWithAllah": "They use their oaths as a shield, hindering others from Allah’s path. Their deeds are indeed deplorable."
        },
        {
            "verseNumber": 3,
            "verseString": "This is because they believed, then disbelieved, so their hearts were sealed and they don’t understand."
        },
        {
            "verseNumber": 4,
            "verseString": "When you see them, their physical appearances impress you, and when they speak, you listen to their words. They are like propped-up hollow timber. They think every shout is against them; they are the enemy, so beware of them. May God combat them! How deluded they are!",
            "verseStringReplacedWithAllah": "When you see them, their physical appearances impress you, and when they speak, you listen to their words. They are like propped-up hollow timber. They think every shout is against them; they are the enemy, so beware of them. May Allah combat them! How deluded they are!"
        },
        {
            "verseNumber": 5,
            "verseString": "When they are told, “Come, let the Messenger of God seek forgiveness for you,” they turn their heads in disdain, and you see them turning away, while they are arrogant.",
            "verseStringReplacedWithAllah": "When they are told, “Come, let the Messenger of Allah seek forgiveness for you,” they turn their heads in disdain, and you see them turning away, while they are arrogant."
        },
        {
            "verseNumber": 6,
            "verseString": "Whether you pray for their forgiveness or not, God won’t forgive them. God doesn’t guide the rebellious people.",
            "verseStringReplacedWithAllah": "Whether you pray for their forgiveness or not, Allah won’t forgive them. Allah doesn’t guide the rebellious people."
        },
        {
            "verseNumber": 7,
            "verseString": "They say, “Don’t spend on those who are with God’s Messenger, until they disband.” To God belong the treasures of the heavens and the earth, but the hypocrites can’t comprehend.",
            "verseStringReplacedWithAllah": "They say, “Don’t spend on those who are with Allah’s Messenger, until they disband.” To Allah belong the treasures of the heavens and the earth, but the hypocrites can’t comprehend."
        },
        {
            "verseNumber": 8,
            "verseString": "They say, “Once we return to the City, the more honorable will expel the more humble.” However, all honor and power belong to God, His Messenger, and the believers, but the hypocrites don’t know.",
            "verseStringReplacedWithAllah": "They say, “Once we return to the City, the more honorable will expel the more humble.” However, all honor and power belong to Allah, His Messenger, and the believers, but the hypocrites don’t know."
        },
        {
            "verseNumber": 9,
            "verseString": "O you who believe, don’t let your wealth and children distract you from the remembrance of God. Those who do are the losers.",
            "verseStringReplacedWithAllah": "O you who believe, don’t let your wealth and children distract you from the remembrance of Allah. Those who do are the losers."
        },
        {
            "verseNumber": 10,
            "verseString": "Spend from what We provide for you before death comes to one of you, and he says, “My Lord, if only You would delay me for a short while, so that I could give charity and be one of the righteous.”"
        },
        {
            "verseNumber": 11,
            "verseString": "But never will God delay a soul when its appointed time has come. God is informed of everything you do.",
            "verseStringReplacedWithAllah": "But never will Allah delay a soul when its appointed time has come. Allah is informed of everything you do."
        }
    ],
    "chapterNumber": 63,
    "nameInEnglish": "The Hypocrites",
    "nameInTransliteration": "Al Munafiqun",
    "nameInArabic": "الـمنافقون",
    "numberOfVerses": 11
}