{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "O Prophet, when you divorce women, divorce them at their prescribed periods, and count their waiting period accurately. Be conscious of God, your Lord. Don’t expel them from their homes, nor should they leave, unless they have committed a clearly immoral conduct. These are the limits set by God. Whoever oversteps God’s limits wrongs his soul. You don’t know; perhaps God will thereafter bring about a new situation.",
            "verseStringReplacedWithAllah": "O Prophet, when you divorce women, divorce them at their prescribed periods, and count their waiting period accurately. Be conscious of Allah, your Lord. Don’t expel them from their homes, nor should they leave, unless they have committed a clearly immoral conduct. These are the limits set by Allah. Whoever oversteps Allah’s limits wrongs his soul. You don’t know; perhaps Allah will thereafter bring about a new situation."
        },
        {
            "verseNumber": 2,
            "verseString": "When they have reached their term, either retain them kindly or separate from them amicably. Call upon two trustworthy witnesses from among you, and establish truthful testimony for God. This counsels whoever believes in God and the Last Day. Whoever fears God, He will make a way out for him.",
            "verseStringReplacedWithAllah": "When they have reached their term, either retain them kindly or separate from them amicably. Call upon two trustworthy witnesses from among you, and establish truthful testimony for Allah. This counsels whoever believes in Allah and the Last Day. Whoever fears Allah, He will make a way out for him."
        },
        {
            "verseNumber": 3,
            "verseString": "He will provide for him from where he doesn’t expect. Whoever puts his trust in God—He will be enough for him. God will accomplish His purpose. God has set a measure for all things.",
            "verseStringReplacedWithAllah": "He will provide for him from where he doesn’t expect. Whoever puts his trust in Allah—He will be enough for him. Allah will accomplish His purpose. Allah has set a measure for all things."
        },
        {
            "verseNumber": 4,
            "verseString": "As for your women who have passed menopause, if you are in doubt, their waiting period shall be three months, as well as for those who haven’t menstruated yet. As for those who are pregnant, their term lasts until they have given birth. Whoever fears God: He will make his affairs easy.",
            "verseStringReplacedWithAllah": "As for your women who have passed menopause, if you are in doubt, their waiting period shall be three months, as well as for those who haven’t menstruated yet. As for those who are pregnant, their term lasts until they have given birth. Whoever fears Allah: He will make his affairs easy."
        },
        {
            "verseNumber": 5,
            "verseString": "This is God’s commandment, which He revealed to you. Whoever fears God, He will erase his sins and magnify his reward.",
            "verseStringReplacedWithAllah": "This is Allah’s commandment, which He revealed to you. Whoever fears Allah, He will erase his sins and magnify his reward."
        },
        {
            "verseNumber": 6,
            "verseString": "Provide them residence where you reside, according to your means, and don’t harass them to make their lives difficult. If they’re pregnant, provide for them until they give birth. If they nurse for you, compensate them and maintain a cordial relationship. If you disagree, then another woman may nurse for him."
        },
        {
            "verseNumber": 7,
            "verseString": "The wealthy should spend according to his means, and the one with limited resources should spend from what God has given him. God doesn’t burden a soul beyond what He has given it. God will bring about, after hardship, ease.",
            "verseStringReplacedWithAllah": "The wealthy should spend according to his means, and the one with limited resources should spend from what Allah has given him. Allah doesn’t burden a soul beyond what He has given it. Allah will bring about, after hardship, ease."
        },
        {
            "verseNumber": 8,
            "verseString": "Many cities rebelled against the command of their Lord and His messengers, so We held them strictly accountable and severely punished them."
        },
        {
            "verseNumber": 9,
            "verseString": "So they tasted the outcome of their deeds, and the result of their deeds was loss."
        },
        {
            "verseNumber": 10,
            "verseString": "God has prepared for them a severe punishment. So beware of God, O you of understanding who have believed. God has sent down to you a reminder.",
            "verseStringReplacedWithAllah": "Allah has prepared for them a severe punishment. So beware of Allah, O you of understanding who have believed. Allah has sent down to you a reminder."
        },
        {
            "verseNumber": 11,
            "verseString": "A messenger who delivers to you God’s clear verses, to bring out those who believe and do righteous deeds from darkness into light. Whoever believes in God and acts righteously, He will admit him into Gardens through which rivers flow, to live there forever. God has prepared for him an excellent provision.",
            "verseStringReplacedWithAllah": "A messenger who delivers to you Allah’s clear verses, to bring out those who believe and do righteous deeds from darkness into light. Whoever believes in Allah and acts righteously, He will admit him into Gardens through which rivers flow, to live there forever. Allah has prepared for him an excellent provision."
        },
        {
            "verseNumber": 12,
            "verseString": "It is God who created seven heavens and; and of the earth, the like of them. The command descends throughout them, so you may know that God has power over all things and that God encompasses all things in knowledge.",
            "verseStringReplacedWithAllah": "It is Allah who created seven heavens and; and of the earth, the like of them. The command descends throughout them, so you may know that Allah has power over all things and that Allah encompasses all things in knowledge."
        }
    ],
    "chapterNumber": 65,
    "nameInEnglish": "Divorce",
    "nameInTransliteration": "At Talaq",
    "nameInArabic": "الـطلاق",
    "numberOfVerses": 12
}