{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "By the Mount."
        },
        {
            "verseNumber": 2,
            "verseString": "And a Scripture inscribed."
        },
        {
            "verseNumber": 3,
            "verseString": "In a published scroll."
        },
        {
            "verseNumber": 4,
            "verseString": "And the frequented House."
        },
        {
            "verseNumber": 5,
            "verseString": "And the elevated roof."
        },
        {
            "verseNumber": 6,
            "verseString": "And the surging sea."
        },
        {
            "verseNumber": 7,
            "verseString": "The punishment of your Lord will occur."
        },
        {
            "verseNumber": 8,
            "verseString": "No one can avert it."
        },
        {
            "verseNumber": 9,
            "verseString": "On the Day when the heavens sways in agitation."
        },
        {
            "verseNumber": 10,
            "verseString": "And the mountains are set in motion."
        },
        {
            "verseNumber": 11,
            "verseString": "Woe, on that Day, to the deniers."
        },
        {
            "verseNumber": 12,
            "verseString": "Those who are engrossed in vanity."
        },
        {
            "verseNumber": 13,
            "verseString": "On that Day, they will be pushed into the Fire of Hell."
        },
        {
            "verseNumber": 14,
            "verseString": "“This is the very Fire which you used to deny."
        },
        {
            "verseNumber": 15,
            "verseString": "Is this magic, or do you not see?"
        },
        {
            "verseNumber": 16,
            "verseString": "Burn therein, it’s the same for you whether you bear it patiently, or not. You are only being recompensed for what you used to do."
        },
        {
            "verseNumber": 17,
            "verseString": "However, the righteous will be in gardens of pleasure."
        },
        {
            "verseNumber": 18,
            "verseString": "Delighted with what their Lord has given them, and their Lord has shielded them from the punishment of the Blaze."
        },
        {
            "verseNumber": 19,
            "verseString": "“Eat and drink cheerfully, as a reward for your endeavors.”"
        },
        {
            "verseNumber": 20,
            "verseString": "Reclining on luxurious furnishings, We will pair them with splendid companions."
        },
        {
            "verseNumber": 21,
            "verseString": "Those who believed and whose descendants followed them in faith, We will join with them, their offspring, and We won’t reduce anything from their deeds. Every person is held in pledge for what he earned."
        },
        {
            "verseNumber": 22,
            "verseString": "We will supply them with fruits and meats, as they desire."
        },
        {
            "verseNumber": 23,
            "verseString": "Circulated among them will be a cup, causing neither vain talk nor sinful behavior."
        },
        {
            "verseNumber": 24,
            "verseString": "They will be served by youthful attendants as hidden pearls."
        },
        {
            "verseNumber": 25,
            "verseString": "They will approach one another, inquiring."
        },
        {
            "verseNumber": 26,
            "verseString": "They will say, “Previously, we were anxious about our families."
        },
        {
            "verseNumber": 27,
            "verseString": "But God blessed us and protected us from the torment of the Scorching Winds.",
            "verseStringReplacedWithAllah": "But Allah blessed us and protected us from the torment of the Scorching Winds."
        },
        {
            "verseNumber": 28,
            "verseString": "We used to pray to Him. He is the Benevolent, the Merciful.”"
        },
        {
            "verseNumber": 29,
            "verseString": "So, remind them. You are not, by the grace of your Lord, a fortune teller or insane."
        },
        {
            "verseNumber": 30,
            "verseString": "Do they say, “A poet, we await his demise?”"
        },
        {
            "verseNumber": 31,
            "verseString": "Say, “Wait; I am waiting with you.”"
        },
        {
            "verseNumber": 32,
            "verseString": "Are their dreams prompting them to do this? Or are they rebellious people?"
        },
        {
            "verseNumber": 33,
            "verseString": "Or do they say, “He made it up”? They can’t be sure."
        },
        {
            "verseNumber": 34,
            "verseString": "Then, let them produce a similar statement—if they are truthful."
        },
        {
            "verseNumber": 35,
            "verseString": "Or were they created from nonexistence? Or are they the creators?"
        },
        {
            "verseNumber": 36,
            "verseString": "Or did they create the heavens and the earth? Certainly, they lack conviction."
        },
        {
            "verseNumber": 37,
            "verseString": "Or do they possess your Lord’s treasures? Or are they the ones in control?"
        },
        {
            "verseNumber": 38,
            "verseString": "Or do they have a ladder by which they can listen in? Then, let their listener produce clear authority."
        },
        {
            "verseNumber": 39,
            "verseString": "Or does He have daughters while you have sons?"
        },
        {
            "verseNumber": 40,
            "verseString": "Or is it that you ask them for a fee, so they are burdened by a debt?"
        },
        {
            "verseNumber": 41,
            "verseString": "Or do they know the Unseen, so they write it down?"
        },
        {
            "verseNumber": 42,
            "verseString": "Or are they plotting a scheme? But those who disbelieve are the ones trapped in their plot."
        },
        {
            "verseNumber": 43,
            "verseString": "Or do they have a god other than God? Exalted is God, far above what they associate with Him.",
            "verseStringReplacedWithAllah": "Or do they have a god other than Allah? Exalted is Allah, far above what they associate with Him."
        },
        {
            "verseNumber": 44,
            "verseString": "Even if they were to see pieces of the sky falling, they would say, “Clouds, piled up.”"
        },
        {
            "verseNumber": 45,
            "verseString": "So, leave them until they encounter their Day, when they will be thunderstruck."
        },
        {
            "verseNumber": 46,
            "verseString": "On that Day, their plotting won’t avail them, nor will they be helped."
        },
        {
            "verseNumber": 47,
            "verseString": "For those who perpetrate injustice, there is a punishment even more severe, yet most of them are unaware."
        },
        {
            "verseNumber": 48,
            "verseString": "Wait patiently for the judgment of your Lord; you are under Our vigilant observation. Praise your Lord when you arise."
        },
        {
            "verseNumber": 49,
            "verseString": "And glorify Him during the night, and as the stars retreat."
        }
    ],
    "chapterNumber": 52,
    "nameInEnglish": "The Mount",
    "nameInTransliteration": "At Tur",
    "nameInArabic": "الـطور",
    "numberOfVerses": 49
}