{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "The decree of God has come, so don’t rush it. He is Exalted, far beyond what they associate with Him.",
            "verseStringReplacedWithAllah": "The decree of Allah has come, so don’t rush it. He is Exalted, far beyond what they associate with Him."
        },
        {
            "verseNumber": 2,
            "verseString": "He sends down the angels with the spirit from His command, upon whom He wills of His servants, saying, “Warn that there is no god but Me, so fear Me.”"
        },
        {
            "verseNumber": 3,
            "verseString": "He created the heavens and the earth with truth. He is far above what they associate with Him."
        },
        {
            "verseNumber": 4,
            "verseString": "He created man from a drop, and behold, he becomes a clear disputant."
        },
        {
            "verseNumber": 5,
            "verseString": "And the livestock, He created them for you. In them, there is warmth and other benefits. And from them, you eat."
        },
        {
            "verseNumber": 6,
            "verseString": "And there is beauty in them for you when you herd them in the evening and drive them out to graze in the morning."
        },
        {
            "verseNumber": 7,
            "verseString": "They transport your loads to regions you couldn’t reach without considerable hardship. Your Lord is Kind and Merciful."
        },
        {
            "verseNumber": 8,
            "verseString": "And horses, mules, and donkeys for you to ride and as adornment. And He creates what you don’t know."
        },
        {
            "verseNumber": 9,
            "verseString": "Upon God is the direction of the way, though some of them are crooked. If He willed, He could’ve guided you all.",
            "verseStringReplacedWithAllah": "Upon Allah is the direction of the way, though some of them are crooked. If He willed, He could’ve guided you all."
        },
        {
            "verseNumber": 10,
            "verseString": "It is He who sends down rain from the sky, from it you drink, and from it grows vegetation for your livestock to eat."
        },
        {
            "verseNumber": 11,
            "verseString": "He produces crops, olives, date palms, grapes, and all kinds of fruits for you. In this, there is a sign for people who reflect."
        },
        {
            "verseNumber": 12,
            "verseString": "He has subdued for you the night and the day. The sun, the moon, and the stars, are subservient by His command. In that are signs for people who reason."
        },
        {
            "verseNumber": 13,
            "verseString": "Everything He scattered for you on earth is of diverse colors. In this, there is a sign for those who notice."
        },
        {
            "verseNumber": 14,
            "verseString": "It is He who made the sea subservient for you, that you may eat from it tender meat and extract ornaments to wear. You see ships plowing through it, so you may seek His bounty and give thanks."
        },
        {
            "verseNumber": 15,
            "verseString": "He set up mountains on the earth so it wouldn’t shake with you, and rivers and roads, so you may be guided."
        },
        {
            "verseNumber": 16,
            "verseString": "And landmarks; and by the stars, they navigate."
        },
        {
            "verseNumber": 17,
            "verseString": "Can He who creates be like the one who does not create? Will you not reflect?"
        },
        {
            "verseNumber": 18,
            "verseString": "If you try to count God’s favors, you can never enumerate them. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "If you try to count Allah’s favors, you can never enumerate them. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 19,
            "verseString": "God knows what you conceal and what you reveal.",
            "verseStringReplacedWithAllah": "Allah knows what you conceal and what you reveal."
        },
        {
            "verseNumber": 20,
            "verseString": "Those they call upon besides God create nothing, but are themselves created.",
            "verseStringReplacedWithAllah": "Those they call upon besides Allah create nothing, but are themselves created."
        },
        {
            "verseNumber": 21,
            "verseString": "They are dead, not alive, and they don’t perceive when they’ll be resurrected."
        },
        {
            "verseNumber": 22,
            "verseString": "Your God is one God. As for those who don’t believe in the Hereafter—their hearts are denying, and they are arrogant."
        },
        {
            "verseNumber": 23,
            "verseString": "God knows what they conceal and what they reveal. He doesn’t love the arrogant.",
            "verseStringReplacedWithAllah": "Allah knows what they conceal and what they reveal. He doesn’t love the arrogant."
        },
        {
            "verseNumber": 24,
            "verseString": "When asked, “What did your Lord reveal?” They respond, “Myths of the ancients.”"
        },
        {
            "verseNumber": 25,
            "verseString": "On Resurrection Day, they will bear their burdens in full, along with some of the burdens of those they misled without knowledge. Alas, evil is what they bear!"
        },
        {
            "verseNumber": 26,
            "verseString": "Those before them also plotted, but God undermined their foundations, and the roof collapsed upon them from above. The punishment came upon them from where they didn’t perceive.",
            "verseStringReplacedWithAllah": "Those before them also plotted, but Allah undermined their foundations, and the roof collapsed upon them from above. The punishment came upon them from where they didn’t perceive."
        },
        {
            "verseNumber": 27,
            "verseString": "Then, on the Day of Resurrection, He will humiliate them and question, “Where are My ‘partners’ concerning whom you used to dispute?” Those knowledgeable will say, “Today, disgrace and misery are upon the unbelievers.”"
        },
        {
            "verseNumber": 28,
            "verseString": "Those whose souls the angels take while they wronged themselves, will offer their submission: “We were not doing any wrong!”. Yet, God has full knowledge of what you used to do.",
            "verseStringReplacedWithAllah": "Those whose souls the angels take while they wronged themselves, will offer their submission: “We were not doing any wrong!”. Yet, Allah has full knowledge of what you used to do."
        },
        {
            "verseNumber": 29,
            "verseString": "So, enter the gates of Hell, to reside therein eternally. Horrible is the residence for the arrogant!"
        },
        {
            "verseNumber": 30,
            "verseString": "The righteous will be asked, “What did your Lord reveal?” They will reply, “The best.” For those who do good in this life, there is goodness, and the home of the Hereafter is even better. How wonderful is the residence of the righteous!"
        },
        {
            "verseNumber": 31,
            "verseString": "They will enter the Gardens of Eternity, beneath which rivers flow. Therein, they will have all that they wish for. Thus does God reward the righteous.",
            "verseStringReplacedWithAllah": "They will enter the Gardens of Eternity, beneath which rivers flow. Therein, they will have all that they wish for. Thus does Allah reward the righteous."
        },
        {
            "verseNumber": 32,
            "verseString": "When the angels receive the souls of the good-natured, they will say, “Peace be upon you. Enter Paradise due to your deeds.”"
        },
        {
            "verseNumber": 33,
            "verseString": "Are they waiting for the angels to come to them, or for your Lord’s command to arrive? This is what those before them did. God didn’t wrong them, but they wronged themselves.",
            "verseStringReplacedWithAllah": "Are they waiting for the angels to come to them, or for your Lord’s command to arrive? This is what those before them did. Allah didn’t wrong them, but they wronged themselves."
        },
        {
            "verseNumber": 34,
            "verseString": "The consequences of their deeds overtook them, and the very things they used to ridicule engulfed them."
        },
        {
            "verseNumber": 35,
            "verseString": "Those who associate others argue, “If God had willed, we wouldn’t have worshiped anything other than Him, neither us nor our ancestors, nor would we have prohibited anything without His sanction.” Those before them did the same. Are the messengers’ duty anything other than the clear conveyance of the message?",
            "verseStringReplacedWithAllah": "Those who associate others argue, “If Allah had willed, we wouldn’t have worshiped anything other than Him, neither us nor our ancestors, nor would we have prohibited anything without His sanction.” Those before them did the same. Are the messengers’ duty anything other than the clear conveyance of the message?"
        },
        {
            "verseNumber": 36,
            "verseString": "We sent a messenger to every community, saying, “Worship God and shun false gods.” Among them were those whom God guided, while others deserved misguidance. So, travel through the earth and observe the end of the deniers.",
            "verseStringReplacedWithAllah": "We sent a messenger to every community, saying, “Worship Allah and shun false gods.” Among them were those whom Allah guided, while others deserved misguidance. So, travel through the earth and observe the end of the deniers."
        },
        {
            "verseNumber": 37,
            "verseString": "Despite your concern for their guidance, God doesn’t guide those He allows to go astray, and they will have no helpers.",
            "verseStringReplacedWithAllah": "Despite your concern for their guidance, Allah doesn’t guide those He allows to go astray, and they will have no helpers."
        },
        {
            "verseNumber": 38,
            "verseString": "They swear their strongest oaths by God that God won’t resurrect the dead. Yet, it’s absolutely a true promise from Him, though most people don’t know.",
            "verseStringReplacedWithAllah": "They swear their strongest oaths by Allah that Allah won’t resurrect the dead. Yet, it’s absolutely a true promise from Him, though most people don’t know."
        },
        {
            "verseNumber": 39,
            "verseString": "This serves to clarify the matters they dispute and make those who disbelieve realize that they were liars."
        },
        {
            "verseNumber": 40,
            "verseString": "When We decree something, We only say to it, “Be,” and it is."
        },
        {
            "verseNumber": 41,
            "verseString": "Those who emigrate for the sake of God after being oppressed, We will establish them in this world in a favorable place. But the reward of the Hereafter is even greater, if only they knew.",
            "verseStringReplacedWithAllah": "Those who emigrate for the sake of Allah after being oppressed, We will establish them in this world in a favorable place. But the reward of the Hereafter is even greater, if only they knew."
        },
        {
            "verseNumber": 42,
            "verseString": "Those who endure patiently and place their trust in their Lord."
        },
        {
            "verseNumber": 43,
            "verseString": "We sent no messengers before you except men whom We inspired. If you don’t know, ask those who possess knowledge."
        },
        {
            "verseNumber": 44,
            "verseString": "To you, We sent down the Message, providing clear instructions and sacred scriptures, so that you may clarify to people what was revealed to them, and that they may reflect."
        },
        {
            "verseNumber": 45,
            "verseString": "Can those who devise evil plans really feel secure that God won’t cause the earth to swallow them, or that the punishment won’t come upon them whence they perceive not?",
            "verseStringReplacedWithAllah": "Can those who devise evil plans really feel secure that Allah won’t cause the earth to swallow them, or that the punishment won’t come upon them whence they perceive not?"
        },
        {
            "verseNumber": 46,
            "verseString": "Or that He won’t catch them amidst their everyday activities, from which they can’t escape?"
        },
        {
            "verseNumber": 47,
            "verseString": "Or that He won’t take them in a state of fear? Your Lord is Kind and Merciful."
        },
        {
            "verseNumber": 48,
            "verseString": "Don’t they see everything God created, how their shadows shift from the right and the left, all humbly submitting to God?",
            "verseStringReplacedWithAllah": "Don’t they see everything Allah created, how their shadows shift from the right and the left, all humbly submitting to Allah?"
        },
        {
            "verseNumber": 49,
            "verseString": "To God prostrates whatever is in the heavens and whatever is on earth: every living creature, and the angels, and with no pride.",
            "verseStringReplacedWithAllah": "To Allah prostrates whatever is in the heavens and whatever is on earth: every living creature, and the angels, and with no pride."
        },
        {
            "verseNumber": 50,
            "verseString": "They fear their Lord above them and do what they’re commanded."
        },
        {
            "verseNumber": 51,
            "verseString": "God said, “Don’t take two gods. He is the One and Only God. Therefore, revere only Me.”",
            "verseStringReplacedWithAllah": "Allah said, “Don’t take two gods. He is the One and Only Allah. Therefore, revere only Me.”"
        },
        {
            "verseNumber": 52,
            "verseString": "Everything in the heavens and on earth is His, and unto Him is religion due perpetually. Would you fear anyone other than God?",
            "verseStringReplacedWithAllah": "Everything in the heavens and on earth is His, and unto Him is religion due perpetually. Would you fear anyone other than Allah?"
        },
        {
            "verseNumber": 53,
            "verseString": "Whatever good comes to you, it’s from God. Yet when harm touches you, it’s unto Him that you cry out in distress.",
            "verseStringReplacedWithAllah": "Whatever good comes to you, it’s from Allah. Yet when harm touches you, it’s unto Him that you cry out in distress."
        },
        {
            "verseNumber": 54,
            "verseString": "Yet, when He alleviates your suffering, some of you associate others with their Lord."
        },
        {
            "verseNumber": 55,
            "verseString": "Such ingratitude for what We’ve given them! Enjoy yourselves; soon, you will come to know."
        },
        {
            "verseNumber": 56,
            "verseString": "And they allocate a share of what We’ve provided them to what they don’t know. Certainly, by God, you will be questioned about your fabrications.",
            "verseStringReplacedWithAllah": "And they allocate a share of what We’ve provided them to what they don’t know. Certainly, by Allah, you will be questioned about your fabrications."
        },
        {
            "verseNumber": 57,
            "verseString": "And they attribute to God daughters, exalted is He; while for themselves, what they desire.",
            "verseStringReplacedWithAllah": "And they attribute to Allah daughters, exalted is He; while for themselves, what they desire."
        },
        {
            "verseNumber": 58,
            "verseString": "When one of them is given news of a female, his face darkens, he becomes choked with silent grief."
        },
        {
            "verseNumber": 59,
            "verseString": "He hides from people due to the bad news he received. Should he keep her despite the dishonor, or bury her in the dust? What a poor decision they make!"
        },
        {
            "verseNumber": 60,
            "verseString": "Those who don’t believe in the Hereafter set a terrible example, while God sets the highest standard. He is the Mighty, the Wise.",
            "verseStringReplacedWithAllah": "Those who don’t believe in the Hereafter set a terrible example, while Allah sets the highest standard. He is the Mighty, the Wise."
        },
        {
            "verseNumber": 61,
            "verseString": "If God were to punish people for their wrongdoings, He wouldn’t leave a living creature on it. However, He defers them to an appointed term. When their time arrives, they can neither delay nor hasten it by an hour.",
            "verseStringReplacedWithAllah": "If Allah were to punish people for their wrongdoings, He wouldn’t leave a living creature on it. However, He defers them to an appointed term. When their time arrives, they can neither delay nor hasten it by an hour."
        },
        {
            "verseNumber": 62,
            "verseString": "They attribute to God what they hate, and their tongues falsely claim that all good things are theirs. No doubt, the Fire is their destiny, and they will be left in it.",
            "verseStringReplacedWithAllah": "They attribute to Allah what they hate, and their tongues falsely claim that all good things are theirs. No doubt, the Fire is their destiny, and they will be left in it."
        },
        {
            "verseNumber": 63,
            "verseString": "By God, We sent messengers to communities before you, but Satan made their deeds fair-seeming to them. He is their ally today, and a severe punishment awaits them.",
            "verseStringReplacedWithAllah": "By Allah, We sent messengers to communities before you, but Satan made their deeds fair-seeming to them. He is their ally today, and a severe punishment awaits them."
        },
        {
            "verseNumber": 64,
            "verseString": "We revealed the Scripture to you, so you may clarify for them what they dispute, and as guidance and mercy for believers."
        },
        {
            "verseNumber": 65,
            "verseString": "God sends down water from the sky, thereby reviving the earth after its demise. In this, there is a sign for those who listen.",
            "verseStringReplacedWithAllah": "Allah sends down water from the sky, thereby reviving the earth after its demise. In this, there is a sign for those who listen."
        },
        {
            "verseNumber": 66,
            "verseString": "There is a lesson for you in livestock: We give you drink from within them. From what’s in their bellies, between excretions and blood, we produce for you pure milk, pleasant for those who drink it."
        },
        {
            "verseNumber": 67,
            "verseString": "And from the fruits of date palms and grapevines, you obtain sugar and good provision. In this, there is a sign for those who think."
        },
        {
            "verseNumber": 68,
            "verseString": "Your Lord inspired the bee: “Establish your hives in the mountains, the trees, and what they construct.”"
        },
        {
            "verseNumber": 69,
            "verseString": "Then, feed on the various fruits, and traverse the paths of your Lord with precision. From within their bodies comes a syrup of varying colors, wherein there is healing for people. In this, there is a sign for those who ponder."
        },
        {
            "verseNumber": 70,
            "verseString": "God created you; then He will cause you to die. Some of you will be reduced to the most feeble age, so they don’t know anything after having known. God is All-Knowing, Most Capable.",
            "verseStringReplacedWithAllah": "Allah created you; then He will cause you to die. Some of you will be reduced to the most feeble age, so they don’t know anything after having known. Allah is All-Knowing, Most Capable."
        },
        {
            "verseNumber": 71,
            "verseString": "God has favored some of you with more provisions than others. Yet those who are favored wouldn’t hand over their provision to those whom their right hands possess so they become equal to them therein. Do they then deny God’s blessings?",
            "verseStringReplacedWithAllah": "Allah has favored some of you with more provisions than others. Yet those who are favored wouldn’t hand over their provision to those whom their right hands possess so they become equal to them therein. Do they then deny Allah’s blessings?"
        },
        {
            "verseNumber": 72,
            "verseString": "God created spouses for you from among yourselves, and through them, He blessed you with children and grandchildren. And He provided you with good things of sustenance. Will they believe in falsehoods and show ingratitude for God’s blessings?",
            "verseStringReplacedWithAllah": "Allah created spouses for you from among yourselves, and through them, He blessed you with children and grandchildren. And He provided you with good things of sustenance. Will they believe in falsehoods and show ingratitude for Allah’s blessings?"
        },
        {
            "verseNumber": 73,
            "verseString": "They worship powerless idols instead of God, idols that don’t have the power to provide for them from the heavens and the earth.",
            "verseStringReplacedWithAllah": "They worship powerless idols instead of Allah, idols that don’t have the power to provide for them from the heavens and the earth."
        },
        {
            "verseNumber": 74,
            "verseString": "So, don’t set up parallels to God. God knows, and you don’t know.",
            "verseStringReplacedWithAllah": "So, don’t set up parallels to Allah. Allah knows, and you don’t know."
        },
        {
            "verseNumber": 75,
            "verseString": "God presents an example: A slave, powerless and owned by his master, versus a man whom We’ve provided with a good livelihood, which he spends secretly and openly. Can they be considered equal? Praise be to God, but most of them don’t know.",
            "verseStringReplacedWithAllah": "Allah presents an example: A slave, powerless and owned by his master, versus a man whom We’ve provided with a good livelihood, which he spends secretly and openly. Can they be considered equal? Praise be to Allah, but most of them don’t know."
        },
        {
            "verseNumber": 76,
            "verseString": "God illustrates another example: Two men, one mute, incapable of doing anything useful, is completely dependent on his master; no matter how he directs him, he brings nothing good. Can he be compared to one who promotes justice and follows a straight path?",
            "verseStringReplacedWithAllah": "Allah illustrates another example: Two men, one mute, incapable of doing anything useful, is completely dependent on his master; no matter how he directs him, he brings nothing good. Can he be compared to one who promotes justice and follows a straight path?"
        },
        {
            "verseNumber": 77,
            "verseString": "To God belongs the unseen realms of the heavens and the earth. The coming of the Hour is as swift as the blink of an eye, or even swifter. God has power over everything.",
            "verseStringReplacedWithAllah": "To Allah belongs the unseen realms of the heavens and the earth. The coming of the Hour is as swift as the blink of an eye, or even swifter. Allah has power over everything."
        },
        {
            "verseNumber": 78,
            "verseString": "God brought you out of your mothers’ wombs, devoid of knowledge. He endowed you with hearing, sight, and intellect, that perhaps you would be grateful.",
            "verseStringReplacedWithAllah": "Allah brought you out of your mothers’ wombs, devoid of knowledge. He endowed you with hearing, sight, and intellect, that perhaps you would be grateful."
        },
        {
            "verseNumber": 79,
            "verseString": "Don’t they see the birds suspended in mid-air? None sustains them except God. In this, there are signs for those who believe.",
            "verseStringReplacedWithAllah": "Don’t they see the birds suspended in mid-air? None sustains them except Allah. In this, there are signs for those who believe."
        },
        {
            "verseNumber": 80,
            "verseString": "God provided you with homes for your comfort, and tents made from the hides of animals for your necessities during your travels and periods of rest. He gave you from their wool, fur, and hair, furnishings and goods for a time.",
            "verseStringReplacedWithAllah": "Allah provided you with homes for your comfort, and tents made from the hides of animals for your necessities during your travels and periods of rest. He gave you from their wool, fur, and hair, furnishings and goods for a time."
        },
        {
            "verseNumber": 81,
            "verseString": "God has given you shade from what He created, and has provided you with retreats in the mountains. He gave you clothing to protect you from the heat, and armor to protect you from your violence. Thus, He perfects His blessings on you, that you may submit.",
            "verseStringReplacedWithAllah": "Allah has given you shade from what He created, and has provided you with retreats in the mountains. He gave you clothing to protect you from the heat, and armor to protect you from your violence. Thus, He perfects His blessings on you, that you may submit."
        },
        {
            "verseNumber": 82,
            "verseString": "If they turn away, your duty is clear communication."
        },
        {
            "verseNumber": 83,
            "verseString": "They recognize God’s blessings, yet they reject them, for the majority of them are ungrateful.",
            "verseStringReplacedWithAllah": "They recognize Allah’s blessings, yet they reject them, for the majority of them are ungrateful."
        },
        {
            "verseNumber": 84,
            "verseString": "On the Day when We summon a witness from every community, those who disbelieved won’t be allowed to present excuses, nor will they be pardoned."
        },
        {
            "verseNumber": 85,
            "verseString": "When the wrongdoers witness the punishment, it won’t be lessened for them, nor will they be granted delay."
        },
        {
            "verseNumber": 86,
            "verseString": "When those who associated partners with God see their supposed partners, they will cry, “Our Lord, these are our partners whom we invoked besides You.” But they will throw back at them the words, “You are liars!”",
            "verseStringReplacedWithAllah": "When those who associated partners with Allah see their supposed partners, they will cry, “Our Lord, these are our partners whom we invoked besides You.” But they will throw back at them the words, “You are liars!”"
        },
        {
            "verseNumber": 87,
            "verseString": "On that Day, they will surrender to God, and all their invented claims will desert them.",
            "verseStringReplacedWithAllah": "On that Day, they will surrender to Allah, and all their invented claims will desert them."
        },
        {
            "verseNumber": 88,
            "verseString": "For those who disbelieve and obstruct others from God’s path, We will add to their punishment because of their misconduct.",
            "verseStringReplacedWithAllah": "For those who disbelieve and obstruct others from Allah’s path, We will add to their punishment because of their misconduct."
        },
        {
            "verseNumber": 89,
            "verseString": "On the Day when We summon a witness from every community against them, We bring you as a witness against these. We revealed to you the Scripture, clarifying all things—a guide, mercy, and good news for those who submit."
        },
        {
            "verseNumber": 90,
            "verseString": "God commands justice, kindness, and giving to relatives. He prohibits immorality, injustice, and oppression. He advises you, so you may be mindful.",
            "verseStringReplacedWithAllah": "Allah commands justice, kindness, and giving to relatives. He prohibits immorality, injustice, and oppression. He advises you, so you may be mindful."
        },
        {
            "verseNumber": 91,
            "verseString": "Fulfill your commitments to God, and don’t violate your oaths after their confirmation, having made God your guarantor. God knows all that you do.",
            "verseStringReplacedWithAllah": "Fulfill your commitments to Allah, and don’t violate your oaths after their confirmation, having made Allah your guarantor. Allah knows all that you do."
        },
        {
            "verseNumber": 92,
            "verseString": "Don’t be like the woman who unravels her finely spun thread, making your oaths a means of deceit among yourselves. God tests you in this manner. On the Day of Resurrection, He will clarify for you everything you disputed.",
            "verseStringReplacedWithAllah": "Don’t be like the woman who unravels her finely spun thread, making your oaths a means of deceit among yourselves. Allah tests you in this manner. On the Day of Resurrection, He will clarify for you everything you disputed."
        },
        {
            "verseNumber": 93,
            "verseString": "If God had willed, He could’ve made you one community, but He misguides whom He wills and guides whom He wills. You’ll be questioned about your actions.",
            "verseStringReplacedWithAllah": "If Allah had willed, He could’ve made you one community, but He misguides whom He wills and guides whom He wills. You’ll be questioned about your actions."
        },
        {
            "verseNumber": 94,
            "verseString": "Don’t make your oaths a means of deception between you, lest your footing slips after being firm, and you suffer distress for hindering others from God’s path, and incur a terrible punishment.",
            "verseStringReplacedWithAllah": "Don’t make your oaths a means of deception between you, lest your footing slips after being firm, and you suffer distress for hindering others from Allah’s path, and incur a terrible punishment."
        },
        {
            "verseNumber": 95,
            "verseString": "Don’t trade God’s covenant for a trivial gain; what God prepared for you is far superior, if only you knew.",
            "verseStringReplacedWithAllah": "Don’t trade Allah’s covenant for a trivial gain; what Allah prepared for you is far superior, if only you knew."
        },
        {
            "verseNumber": 96,
            "verseString": "What you have will run out, but what God has remains. We will reward those who are patient according to their best deeds.",
            "verseStringReplacedWithAllah": "What you have will run out, but what Allah has remains. We will reward those who are patient according to their best deeds."
        },
        {
            "verseNumber": 97,
            "verseString": "Whoever acts righteously, male or female, and is a believer, We will grant them a good life and reward them according to their best deeds."
        },
        {
            "verseNumber": 98,
            "verseString": "When you read the Quran, seek refuge in God from Satan, the outcast.",
            "verseStringReplacedWithAllah": "When you read the Quran, seek refuge in Allah from Satan, the outcast."
        },
        {
            "verseNumber": 99,
            "verseString": "He has no authority over those who believe and trust in their Lord."
        },
        {
            "verseNumber": 100,
            "verseString": "His influence extends only to those who take him as an ally and those who associate partners with Him."
        },
        {
            "verseNumber": 101,
            "verseString": "When We replace one verse with another—and God knows best what He reveals—they say, “YYou are just making things up.” Yet, most of them lack knowledge.",
            "verseStringReplacedWithAllah": "When We replace one verse with another—and Allah knows best what He reveals—they say, “YYou are just making things up.” Yet, most of them lack knowledge."
        },
        {
            "verseNumber": 102,
            "verseString": "Say, “The Holy Spirit brought it down from your Lord, in truth, to stabilize those who believe, and as guidance and good news for the Submitters.”"
        },
        {
            "verseNumber": 103,
            "verseString": "We know they say, “A human is teaching him.” The language of the one they maliciously allude to is foreign, yet this is in clear Arabic."
        },
        {
            "verseNumber": 104,
            "verseString": "Those who don’t believe in God’s revelations—God won’t guide them, and for them is a painful punishment.",
            "verseStringReplacedWithAllah": "Those who don’t believe in Allah’s revelations—Allah won’t guide them, and for them is a painful punishment."
        },
        {
            "verseNumber": 105,
            "verseString": "Those who deny God’s revelations are the ones who fabricate falsehoods and are untruthful.",
            "verseStringReplacedWithAllah": "Those who deny Allah’s revelations are the ones who fabricate falsehoods and are untruthful."
        },
        {
            "verseNumber": 106,
            "verseString": "Anyone who rejects God after having faith—except for one who is coerced while his heart remains firm in faith—but anyone who opens their heart to disbelief, upon them descends God’s wrath, and a grave punishment awaits them.",
            "verseStringReplacedWithAllah": "Anyone who rejects Allah after having faith—except for one who is coerced while his heart remains firm in faith—but anyone who opens their heart to disbelief, upon them descends Allah’s wrath, and a grave punishment awaits them."
        },
        {
            "verseNumber": 107,
            "verseString": "That is because they favor the worldly life over the Hereafter. And God doesn’t guide the disbelieving people.",
            "verseStringReplacedWithAllah": "That is because they favor the worldly life over the Hereafter. And Allah doesn’t guide the disbelieving people."
        },
        {
            "verseNumber": 108,
            "verseString": "They are the ones God sealed their hearts, their hearing, and their sight. They are the ones who are heedless.",
            "verseStringReplacedWithAllah": "They are the ones Allah sealed their hearts, their hearing, and their sight. They are the ones who are heedless."
        },
        {
            "verseNumber": 109,
            "verseString": "No doubt, they will be the losers in the Hereafter."
        },
        {
            "verseNumber": 110,
            "verseString": "However, to those who emigrated after being persecuted, and who strived and showed patience, your Lord, in return, is forgiving and merciful."
        },
        {
            "verseNumber": 111,
            "verseString": "On that Day, every soul will come pleading for itself, and every soul will be fully compensated for what it has done, and they won’t be wronged."
        },
        {
            "verseNumber": 112,
            "verseString": "God presents an example of a secure and peaceful city, its provisions arriving abundantly from every direction. But it showed ingratitude for God’s blessings, so God made it taste the cloak of hunger and fear, as a consequence of their deeds.",
            "verseStringReplacedWithAllah": "Allah presents an example of a secure and peaceful city, its provisions arriving abundantly from every direction. But it showed ingratitude for Allah’s blessings, so Allah made it taste the cloak of hunger and fear, as a consequence of their deeds."
        },
        {
            "verseNumber": 113,
            "verseString": "A messenger from themselves had come to them, but they denied him. So, the punishment seized them while they were wrongdoers."
        },
        {
            "verseNumber": 114,
            "verseString": "So, eat from what God provided for you, lawful and good, and be grateful for God’s favor, if you truly worship Him.",
            "verseStringReplacedWithAllah": "So, eat from what Allah provided for you, lawful and good, and be grateful for Allah’s favor, if you truly worship Him."
        },
        {
            "verseNumber": 115,
            "verseString": "He only forbade you dead animals, blood, the flesh of swine, and what has been consecrated to other than God. But if one is compelled by necessity, without willful disobedience or transgression, God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "He only forbade you dead animals, blood, the flesh of swine, and what has been consecrated to other than Allah. But if one is compelled by necessity, without willful disobedience or transgression, Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 116,
            "verseString": "Don’t say, falsely, with your tongues: “This is lawful, and this is unlawful,” in order to invent lies about God. Those who fabricate lies against God don’t succeed.",
            "verseStringReplacedWithAllah": "Don’t say, falsely, with your tongues: “This is lawful, and this is unlawful,” in order to invent lies about Allah. Those who fabricate lies against Allah don’t succeed."
        },
        {
            "verseNumber": 117,
            "verseString": "A brief enjoyment, then they will have a severe punishment."
        },
        {
            "verseNumber": 118,
            "verseString": "We’ve detailed to you the prohibitions imposed on the Jews; We didn’t wrong them, but they used to wrong themselves."
        },
        {
            "verseNumber": 119,
            "verseString": "As for those who commit evil deeds inadvertently, but later repent and reform, your Lord, after that, is Forgiving and Merciful."
        },
        {
            "verseNumber": 120,
            "verseString": "Abraham was an exemplary leader, devoutly obedient to God, a monotheist, and he wasn’t among the polytheists.",
            "verseStringReplacedWithAllah": "Abraham was an exemplary leader, devoutly obedient to Allah, a monotheist, and he wasn’t among the polytheists."
        },
        {
            "verseNumber": 121,
            "verseString": "Being appreciative of His blessings, He chose him and guided him to a straight path."
        },
        {
            "verseNumber": 122,
            "verseString": "We granted him goodness in this life, and in the Hereafter, he will be among the righteous."
        },
        {
            "verseNumber": 123,
            "verseString": "Then, We revealed to you: Follow the religious path of Abraham, the devout monotheist, who was not of the polytheists.”"
        },
        {
            "verseNumber": 124,
            "verseString": "The Sabbath was only instituted for those in dispute over it. Your Lord will resolve their disputes on Resurrection Day."
        },
        {
            "verseNumber": 125,
            "verseString": "Invite to the path of your Lord through wisdom and kind advice, and engage in discussions in the most courteous manner. Your Lord knows best who strays from His path, and He knows best those who are rightly guided."
        },
        {
            "verseNumber": 126,
            "verseString": "If you retaliate, then retaliate proportionately to the offense committed against you. However, if you endure, it is indeed better for those who are patient."
        },
        {
            "verseNumber": 127,
            "verseString": "Be patient; your patience is solely through God. Don’t grieve over them, and don’t be distressed by their plots.",
            "verseStringReplacedWithAllah": "Be patient; your patience is solely through Allah. Don’t grieve over them, and don’t be distressed by their plots."
        },
        {
            "verseNumber": 128,
            "verseString": "God is with the righteous, and those who do good deeds.",
            "verseStringReplacedWithAllah": "Allah is with the righteous, and those who do good deeds."
        }
    ],
    "chapterNumber": 16,
    "nameInEnglish": "The Bee",
    "nameInTransliteration": "An Nahl",
    "nameInArabic": "النحل",
    "numberOfVerses": 128
}