{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "We sent Noah to his people: “Warn your people, before a severe punishment comes to them.”"
        },
        {
            "verseNumber": 2,
            "verseString": "He said, “O my people, I am a clear warner to you."
        },
        {
            "verseNumber": 3,
            "verseString": "Worship God, fear Him, and obey me.",
            "verseStringReplacedWithAllah": "Worship Allah, fear Him, and obey me."
        },
        {
            "verseNumber": 4,
            "verseString": "He will forgive your sins and delay you to a specified term. When God’s appointed time arrives, it can’t be deferred—if only you could understand.”",
            "verseStringReplacedWithAllah": "He will forgive your sins and delay you to a specified term. When Allah’s appointed time arrives, it can’t be deferred—if only you could understand.”"
        },
        {
            "verseNumber": 5,
            "verseString": "He implored, “My Lord, I called out to my people night and day."
        },
        {
            "verseNumber": 6,
            "verseString": "But my call only increased their flight away."
        },
        {
            "verseNumber": 7,
            "verseString": "Whenever I urged them to seek Your forgiveness, they would stick their fingers in their ears, cover themselves with their garments, persist in their stubbornness, and grow increasingly arrogant."
        },
        {
            "verseNumber": 8,
            "verseString": "I called out to them openly."
        },
        {
            "verseNumber": 9,
            "verseString": "And I appealed to them publicly, and I spoke with them privately."
        },
        {
            "verseNumber": 10,
            "verseString": "I said, ‘Seek forgiveness from your Lord, for He is Ever-Forgiving."
        },
        {
            "verseNumber": 11,
            "verseString": "He will send down abundant rain upon you."
        },
        {
            "verseNumber": 12,
            "verseString": "And provide you with wealth and children, and bless you with gardens, and grant you rivers."
        },
        {
            "verseNumber": 13,
            "verseString": "What’s the matter with you, that you don’t attribute to God due grandeur.",
            "verseStringReplacedWithAllah": "What’s the matter with you, that you don’t attribute to Allah due grandeur."
        },
        {
            "verseNumber": 14,
            "verseString": "When He created you in stages."
        },
        {
            "verseNumber": 15,
            "verseString": "Don’t you see how God created seven heavens in perfect harmony?",
            "verseStringReplacedWithAllah": "Don’t you see how Allah created seven heavens in perfect harmony?"
        },
        {
            "verseNumber": 16,
            "verseString": "And He made the moon a luminary in them, and He made the sun a glowing lamp."
        },
        {
            "verseNumber": 17,
            "verseString": "And God germinated you from the earth like plants.",
            "verseStringReplacedWithAllah": "And Allah germinated you from the earth like plants."
        },
        {
            "verseNumber": 18,
            "verseString": "Then He will return you to it, and He will extract you once again."
        },
        {
            "verseNumber": 19,
            "verseString": "And God made the earth a spread for you.",
            "verseStringReplacedWithAllah": "And Allah made the earth a spread for you."
        },
        {
            "verseNumber": 20,
            "verseString": "So you may move along its wide roads.’”"
        },
        {
            "verseNumber": 21,
            "verseString": "Noah said, “My Lord, they defied me, and they followed those whose wealth and children only amplify their loss.”"
        },
        {
            "verseNumber": 22,
            "verseString": "They devised a formidable plan."
        },
        {
            "verseNumber": 23,
            "verseString": "They said, “Never abandon your gods. Never abandon Wadd, nor Suwa, nor Yaghoos, nor Yaooq, nor Nassr."
        },
        {
            "verseNumber": 24,
            "verseString": "They misled many. So, increase the wrongdoers in nothing but straying.”"
        },
        {
            "verseNumber": 25,
            "verseString": "Because of their sins, they were drowned and entered into fire, finding no allies to defend them against God.",
            "verseStringReplacedWithAllah": "Because of their sins, they were drowned and entered into fire, finding no allies to defend them against Allah."
        },
        {
            "verseNumber": 26,
            "verseString": "Noah prayed, “O my Lord, don’t leave a single disbeliever on earth."
        },
        {
            "verseNumber": 27,
            "verseString": "If You allow them to remain, they will mislead Your devotees, and they will give birth to nothing but sinful unbelievers."
        },
        {
            "verseNumber": 28,
            "verseString": "My Lord, forgive me, my parents, and whoever enters my home as a believer, and all believing men and women, but increase the wrongdoers in nothing but ruin.”"
        }
    ],
    "chapterNumber": 71,
    "nameInEnglish": "Noah",
    "nameInTransliteration": "Nuh",
    "nameInArabic": "نوح",
    "numberOfVerses": 28
}