{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Ya, Seen."
        },
        {
            "verseNumber": 2,
            "verseString": "By the Wise Quran."
        },
        {
            "verseNumber": 3,
            "verseString": "You are certainly among the messengers."
        },
        {
            "verseNumber": 4,
            "verseString": "On a straight path."
        },
        {
            "verseNumber": 5,
            "verseString": "The revelation of the Almighty, the Merciful."
        },
        {
            "verseNumber": 6,
            "verseString": "To warn a people whose forefathers weren’t warned, thus they are unaware."
        },
        {
            "verseNumber": 7,
            "verseString": "The word has been justified against most of them, for they don’t believe."
        },
        {
            "verseNumber": 8,
            "verseString": "We placed shackles around their necks, up to their chins, so their heads are forcibly raised."
        },
        {
            "verseNumber": 9,
            "verseString": "We placed a barrier before and a barrier behind them, and we covered them, so they couldn’t see."
        },
        {
            "verseNumber": 10,
            "verseString": "Whether you warn them or not, it’s the same for them—they will not believe."
        },
        {
            "verseNumber": 11,
            "verseString": "You only warn those who adhere to the Message and revere the Most Merciful unseen. Give them good news of forgiveness and a generous reward."
        },
        {
            "verseNumber": 12,
            "verseString": "It’s We who revive the dead, and We record what they forward, and their traces. We accounted for everything in a clear register."
        },
        {
            "verseNumber": 13,
            "verseString": "Present to them a parable: the inhabitants of a city, when the messengers came to it."
        },
        {
            "verseNumber": 14,
            "verseString": "We sent two messengers to them, but they rejected both, so We reinforced them with a third. They said, “We are messengers to you.”"
        },
        {
            "verseNumber": 15,
            "verseString": "They replied, “You are nothing but humans like us, and the Merciful revealed nothing. You are only lying.”"
        },
        {
            "verseNumber": 16,
            "verseString": "They responded, “Our Lord knows that we’ve been sent to you."
        },
        {
            "verseNumber": 17,
            "verseString": "We only must convey the Clear Message.”"
        },
        {
            "verseNumber": 18,
            "verseString": "They said, “We see an ill omen from you. If you don’t stop, we will stone you and punish you severely.”"
        },
        {
            "verseNumber": 19,
            "verseString": "They responded, “Your ill omen is with you. Is it because you were reminded? Rather, you are a transgressing people.”"
        },
        {
            "verseNumber": 20,
            "verseString": "Then a man came running from the farthest part of the city, saying, “O my people, follow the messengers."
        },
        {
            "verseNumber": 21,
            "verseString": "Follow those who ask no payment from you, and are themselves guided."
        },
        {
            "verseNumber": 22,
            "verseString": "“Why shouldn’t I worship Him who originated me, and to whom you’ll be returned?"
        },
        {
            "verseNumber": 23,
            "verseString": "Should I take other gods besides Him? If the Merciful intends harm for me, their intercession won’t avail me at all, nor will they save me."
        },
        {
            "verseNumber": 24,
            "verseString": "In that case, I would be in clear error."
        },
        {
            "verseNumber": 25,
            "verseString": "I have believed in your Lord, so listen to me.”"
        },
        {
            "verseNumber": 26,
            "verseString": "It was said, “Enter Paradise,” he exclaimed, “If only my people knew."
        },
        {
            "verseNumber": 27,
            "verseString": "How my Lord has forgiven me and made me among the honored.”"
        },
        {
            "verseNumber": 28,
            "verseString": "We didn’t send down upon his people, after him, any hosts from heaven, nor was it necessary."
        },
        {
            "verseNumber": 29,
            "verseString": "It was but one shout, and behold, they were extinguished."
        },
        {
            "verseNumber": 30,
            "verseString": "Alas for the beings! Whenever a messenger comes to them, they ridicule him."
        },
        {
            "verseNumber": 31,
            "verseString": "Didn’t they consider how many generations We destroyed before them, which will never return to them?"
        },
        {
            "verseNumber": 32,
            "verseString": "Yet, every single one of them will be brought before Us."
        },
        {
            "verseNumber": 33,
            "verseString": "A sign for them is the dead earth. We give it life, and from it, we produce grain, of which they eat."
        },
        {
            "verseNumber": 34,
            "verseString": "We established gardens of date palms and vineyards in it, We caused springs to burst forth therein."
        },
        {
            "verseNumber": 35,
            "verseString": "So they may eat of its fruit. Their hands didn’t make it. Won’t they give thanks?"
        },
        {
            "verseNumber": 36,
            "verseString": "Glory be to Him who created all pairs—from what the earth grows, from themselves, and from what they don’t know."
        },
        {
            "verseNumber": 37,
            "verseString": "Another sign for them is the night. We strip away the day from it, and behold, they are in darkness."
        },
        {
            "verseNumber": 38,
            "verseString": "And the sun runs toward its stopping place. That’s the decree of the Almighty, the Knowing."
        },
        {
            "verseNumber": 39,
            "verseString": "We established phases for the moon, until it returns resembling an old, curved date stalk."
        },
        {
            "verseNumber": 40,
            "verseString": "The sun is not permitted to overtake the moon, nor does the night outpace the day. Each floats in an orbit."
        },
        {
            "verseNumber": 41,
            "verseString": "A sign for them is that We carried their progeny in the filled Ark."
        },
        {
            "verseNumber": 42,
            "verseString": "And We’ve created for them similar to it on which they embark."
        },
        {
            "verseNumber": 43,
            "verseString": "And if We will, We could drown them, with no one to hear their screams, and they won’t be rescued."
        },
        {
            "verseNumber": 44,
            "verseString": "Except out of mercy from Us, and for enjoyment for a while."
        },
        {
            "verseNumber": 45,
            "verseString": "When they are told, “Guard yourselves from what’s before you and what’s behind you, so you may receive mercy.”"
        },
        {
            "verseNumber": 46,
            "verseString": "Yet, they persistently ignore every sign that comes to them from their Lord."
        },
        {
            "verseNumber": 47,
            "verseString": "When told, “Give from what God has provided you,” the unbelievers say to the believers, “Should we feed those, if God willed, He would’ve fed them? You are evidently misguided.”",
            "verseStringReplacedWithAllah": "When told, “Give from what Allah has provided you,” the unbelievers say to the believers, “Should we feed those, if Allah willed, He would’ve fed them? You are evidently misguided.”"
        },
        {
            "verseNumber": 48,
            "verseString": "And they say, “When will this promise be fulfilled, if you are truthful?”"
        },
        {
            "verseNumber": 49,
            "verseString": "They only await a single blast that will seize them while arguing."
        },
        {
            "verseNumber": 50,
            "verseString": "They won’t be able to make any will, nor will they return to their families."
        },
        {
            "verseNumber": 51,
            "verseString": "The Trumpet will be blown, and behold, from their graves, they will rush towards their Lord."
        },
        {
            "verseNumber": 52,
            "verseString": "They will cry out, “Woe to us! Who resurrected us from our resting place? This is what the Merciful had promised, and the messengers spoke the truth.”"
        },
        {
            "verseNumber": 53,
            "verseString": "It will be but a single shout, and they will all be brought before Us."
        },
        {
            "verseNumber": 54,
            "verseString": "On that Day, no soul will be wronged in the least, and you will only be reimbursed for your actions."
        },
        {
            "verseNumber": 55,
            "verseString": "That Day, the residents of Paradise will be occupied in joyful things."
        },
        {
            "verseNumber": 56,
            "verseString": "They and their spouses will be reclining on couches in the shade."
        },
        {
            "verseNumber": 57,
            "verseString": "There, they will have fruits and whatever they request."
        },
        {
            "verseNumber": 58,
            "verseString": "“Peace”—a word from a Merciful Lord."
        },
        {
            "verseNumber": 59,
            "verseString": "But separate yourselves today, you criminals!"
        },
        {
            "verseNumber": 60,
            "verseString": "Didn’t I covenant with you, O Children of Adam, that you must not worship Satan, for he is your clear enemy?"
        },
        {
            "verseNumber": 61,
            "verseString": "And that you should worship Me, for this is a straight path."
        },
        {
            "verseNumber": 62,
            "verseString": "He led many of you astray. Didn’t you use your reason?"
        },
        {
            "verseNumber": 63,
            "verseString": "This is the Hellfire you were repeatedly warned about."
        },
        {
            "verseNumber": 64,
            "verseString": "Today, experience it because you used to deny."
        },
        {
            "verseNumber": 65,
            "verseString": "On that Day, We will seal their mouths. Their hands will speak to Us, and their feet will testify to their deeds."
        },
        {
            "verseNumber": 66,
            "verseString": "Had We willed, We could’ve blotted out their eyes; then they would stumble on the path. But how will they see?"
        },
        {
            "verseNumber": 67,
            "verseString": "Had We willed, We could’ve immobilized them in their places, leaving them incapable of advancing or retreating."
        },
        {
            "verseNumber": 68,
            "verseString": "Those to whom We grant a long life, We reverse in development. Don’t they understand?"
        },
        {
            "verseNumber": 69,
            "verseString": "We didn’t teach him poetry, nor is it appropriate for him. It is but a reminder and a Clear Quran."
        },
        {
            "verseNumber": 70,
            "verseString": "To warn those who are living, and to justify the sentence against the unbelievers."
        },
        {
            "verseNumber": 71,
            "verseString": "Don’t they see that We created for them, from Our handiwork, the livestock that they own?"
        },
        {
            "verseNumber": 72,
            "verseString": "And We tamed them for them; some they ride, and some they eat."
        },
        {
            "verseNumber": 73,
            "verseString": "And for them therein are benefits and beverages. Won’t they be grateful?"
        },
        {
            "verseNumber": 74,
            "verseString": "Yet, they’ve taken gods other than God, hoping they might get help.",
            "verseStringReplacedWithAllah": "Yet, they’ve taken gods other than Allah, hoping they might get help."
        },
        {
            "verseNumber": 75,
            "verseString": "They can’t assist them, but they are troops in readiness for them."
        },
        {
            "verseNumber": 76,
            "verseString": "So let not their statements sadden you. We know what they hide and what they disclose."
        },
        {
            "verseNumber": 77,
            "verseString": "Does man not consider that We created him from a drop, yet behold, he is an open adversary?"
        },
        {
            "verseNumber": 78,
            "verseString": "He strikes a comparison for Us, while forgetting his own creation. He asks, “Who can give life to bones while they are disintegrated?”"
        },
        {
            "verseNumber": 79,
            "verseString": "Say, “He who initiated their creation will give them life. He is All-Knowing of every creation.”"
        },
        {
            "verseNumber": 80,
            "verseString": "Who made for you fire from green trees, and behold, you kindle from it."
        },
        {
            "verseNumber": 81,
            "verseString": "Isn’t He who created the heavens and the earth Able to create the likes of them? And He is the All-Knowing Creator."
        },
        {
            "verseNumber": 82,
            "verseString": "His command, when He intends a thing, is only to say to it, “Be,” and it becomes."
        },
        {
            "verseNumber": 83,
            "verseString": "So glory to He in whose hand is the dominion of everything, and to Him you will be returned."
        }
    ],
    "chapterNumber": 36,
    "nameInEnglish": "Ya Seen",
    "nameInTransliteration": "Ya Seen",
    "nameInArabic": "يس",
    "numberOfVerses": 83
}