{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Blessed is He in whose hand lies the dominion, and He is over all things competent."
        },
        {
            "verseNumber": 2,
            "verseString": "He who created life and death to test which of you is best in conduct. And He is the Exalted in Might, the Forgiving."
        },
        {
            "verseNumber": 3,
            "verseString": "He who created seven heavens in layers. You will see no discrepancy in the creation of the Merciful. Look again: do you see any flaws?"
        },
        {
            "verseNumber": 4,
            "verseString": "Look again, and yet again, and your sight will return to you dazzled and fatigued."
        },
        {
            "verseNumber": 5,
            "verseString": "We adorned the lowest heaven with lamps, and We made them projectiles to drive away the devils. We prepared for them the torment of the Blaze."
        },
        {
            "verseNumber": 6,
            "verseString": "For those who deny their Lord, the punishment of Hell awaits—a terrible destination."
        },
        {
            "verseNumber": 7,
            "verseString": "When they are thrown into it, they will hear it gasping as it boils over."
        },
        {
            "verseNumber": 8,
            "verseString": "It almost bursts with rage. Every time a batch is hurled into it, its keepers will ask them, “Did no Warner come to you?”"
        },
        {
            "verseNumber": 9,
            "verseString": "They will answer, “Yes, a warner did come to us, but we denied and said, ‘God didn’t reveal anything; you are greatly mistaken.’”",
            "verseStringReplacedWithAllah": "They will answer, “Yes, a warner did come to us, but we denied and said, ‘Allah didn’t reveal anything; you are greatly mistaken.’”"
        },
        {
            "verseNumber": 10,
            "verseString": "And they will say, “If only we had listened or used reason, we wouldn’t be among the inhabitants of the Fiery Blaze.”"
        },
        {
            "verseNumber": 11,
            "verseString": "They confessed their sin. So, away with the dwellers of the Blaze."
        },
        {
            "verseNumber": 12,
            "verseString": "For those who fear their Lord unseen, for them is forgiveness and a grand reward."
        },
        {
            "verseNumber": 13,
            "verseString": "Whether you conceal your words or declare them, He knows the secrets of the hearts."
        },
        {
            "verseNumber": 14,
            "verseString": "Wouldn’t He know, He who created? He is the Kind, the Expert."
        },
        {
            "verseNumber": 15,
            "verseString": "It is He who made the earth manageable for you. So traverse its tracks and eat from His provision. To Him is the resurgence."
        },
        {
            "verseNumber": 16,
            "verseString": "Are you certain that the One in the heavens won’t cause the earth to swallow you as it shakes?"
        },
        {
            "verseNumber": 17,
            "verseString": "Are you sure that the One in the heavens won’t send upon you a violent wind? Then you will know how My warning was."
        },
        {
            "verseNumber": 18,
            "verseString": "Those before them also denied. So, how was My condemnation?"
        },
        {
            "verseNumber": 19,
            "verseString": "Don’t they see the birds above them, spreading and folding their wings? None holds them up except the Merciful. He is watchful over all things."
        },
        {
            "verseNumber": 20,
            "verseString": "Who could be an army to aid you, other than the Most Merciful? The unbelievers are in nothing but delusion."
        },
        {
            "verseNumber": 21,
            "verseString": "Who will sustain you if He withholds His provision? Yet, they persist in defiance and aversion."
        },
        {
            "verseNumber": 22,
            "verseString": "Who is better guided: the one who walks face down, or the one who walks upright on a straight path?"
        },
        {
            "verseNumber": 23,
            "verseString": "Say, “It is He who created you and endowed you with hearing, sight, and hearts. Yet, little do you give thanks.”"
        },
        {
            "verseNumber": 24,
            "verseString": "Say, “It is He who multiplied you throughout the earth, and to Him, you will be gathered.”"
        },
        {
            "verseNumber": 25,
            "verseString": "They ask, “When will this promise be fulfilled, if you are truthful?”"
        },
        {
            "verseNumber": 26,
            "verseString": "Respond, “Its knowledge lies only with God, and I am but a clear warner.”",
            "verseStringReplacedWithAllah": "Respond, “Its knowledge lies only with Allah, and I am but a clear warner.”"
        },
        {
            "verseNumber": 27,
            "verseString": "When they see it approaching, the faces of those who disbelieved will be gloomy, and it will be said, “This is what you were calling for.”"
        },
        {
            "verseNumber": 28,
            "verseString": "Say, “Consider this: whether God destroys me and those with me, or He showers us with His mercy, who can protect the unbelievers from a severe punishment?”",
            "verseStringReplacedWithAllah": "Say, “Consider this: whether Allah destroys me and those with me, or He showers us with His mercy, who can protect the unbelievers from a severe punishment?”"
        },
        {
            "verseNumber": 29,
            "verseString": "Say, “He is the Most Merciful. We have believed in Him, and upon Him, we rely. Soon, you will realize who is in glaring error.”"
        },
        {
            "verseNumber": 30,
            "verseString": "Say, “Consider this: if your water were to sink, who could supply you with fresh, flowing water?”"
        }
    ],
    "chapterNumber": 67,
    "nameInEnglish": "Sovereignty",
    "nameInTransliteration": "Al Mulk",
    "nameInArabic": "الـملك",
    "numberOfVerses": 30
}