{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Alif. Lam. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "This is the Book, beyond any doubt, a guide for the righteous."
        },
        {
            "verseNumber": 3,
            "verseString": "Those who believe in the unseen, perform the prayer, and spend from what We provide for them."
        },
        {
            "verseNumber": 4,
            "verseString": "And those who believe in what was revealed to you, and in what was revealed before you, and are certain of the Hereafter."
        },
        {
            "verseNumber": 5,
            "verseString": "These are guided by their Lord, and these are the successful."
        },
        {
            "verseNumber": 6,
            "verseString": "As for those who disbelieve, whether you warn them or not, it’s the same for them; they will not believe."
        },
        {
            "verseNumber": 7,
            "verseString": "God sealed their hearts and hearing, and over their vision is a veil. They will have a severe punishment.",
            "verseStringReplacedWithAllah": "Allah sealed their hearts and hearing, and over their vision is a veil. They will have a severe punishment."
        },
        {
            "verseNumber": 8,
            "verseString": "Some people claim, “We believe in God and the Last Day,” yet they aren’t believers.",
            "verseStringReplacedWithAllah": "Some people claim, “We believe in Allah and the Last Day,” yet they aren’t believers."
        },
        {
            "verseNumber": 9,
            "verseString": "They attempt to deceive God and those who believe, but they only deceive themselves, and they perceive not.",
            "verseStringReplacedWithAllah": "They attempt to deceive Allah and those who believe, but they only deceive themselves, and they perceive not."
        },
        {
            "verseNumber": 10,
            "verseString": "There is a disease in their hearts, and God has increased their disease. A severe punishment awaits them because of their lies.",
            "verseStringReplacedWithAllah": "There is a disease in their hearts, and Allah has increased their disease. A severe punishment awaits them because of their lies."
        },
        {
            "verseNumber": 11,
            "verseString": "When they’re told, “Don’t sow corruption on earth,” they reply, “We are only reformers.”"
        },
        {
            "verseNumber": 12,
            "verseString": "In truth, it is they who are the corrupters, but they don’t feel it."
        },
        {
            "verseNumber": 13,
            "verseString": "When they’re told, “Believe as others have believed,” they reply, “Should we believe as the irrational have believed?” In fact, it is they who are irrational, yet they are unaware."
        },
        {
            "verseNumber": 14,
            "verseString": "When they encounter those who believe, they say, “We believe.” But when alone with their devils, they say, “We are really with you; we were only mocking.”"
        },
        {
            "verseNumber": 15,
            "verseString": "God mocks them and prolongs them in their transgression, wandering blindly.",
            "verseStringReplacedWithAllah": "Allah mocks them and prolongs them in their transgression, wandering blindly."
        },
        {
            "verseNumber": 16,
            "verseString": "These are the ones who purchased misguidance in exchange for guidance, but their trade didn’t profit them, nor are they guided."
        },
        {
            "verseNumber": 17,
            "verseString": "Their situation is like that of a person who kindles a fire; when it illuminates all around him, God takes away their light, leaving them in utter darkness, unable to see.",
            "verseStringReplacedWithAllah": "Their situation is like that of a person who kindles a fire; when it illuminates all around him, Allah takes away their light, leaving them in utter darkness, unable to see."
        },
        {
            "verseNumber": 18,
            "verseString": "Deaf, dumb, blind—they won’t return."
        },
        {
            "verseNumber": 19,
            "verseString": "Or like a thunderstorm from the sky, within which are darkness, thunder, and lightning. They press their fingers into their ears against the thunderclaps, terrified of death. God surrounds the unbelievers.",
            "verseStringReplacedWithAllah": "Or like a thunderstorm from the sky, within which are darkness, thunder, and lightning. They press their fingers into their ears against the thunderclaps, terrified of death. Allah surrounds the unbelievers."
        },
        {
            "verseNumber": 20,
            "verseString": "The lightning almost takes away their sight. Whenever it illuminates for them, they walk in it; but when darkness covers them, they stand still. If God wills, He could take away their hearing and sight. God is capable of everything.",
            "verseStringReplacedWithAllah": "The lightning almost takes away their sight. Whenever it illuminates for them, they walk in it; but when darkness covers them, they stand still. If Allah wills, He could take away their hearing and sight. Allah is capable of everything."
        },
        {
            "verseNumber": 21,
            "verseString": "O people, worship your Lord, who created you and those before you, so that you may become righteous."
        },
        {
            "verseNumber": 22,
            "verseString": "He who made the earth habitable for you, and the sky a structure, and sent down rain from the sky, thereby producing fruits for your sustenance. Don’t set up rivals to God while you know.",
            "verseStringReplacedWithAllah": "He who made the earth habitable for you, and the sky a structure, and sent down rain from the sky, thereby producing fruits for your sustenance. Don’t set up rivals to Allah while you know."
        },
        {
            "verseNumber": 23,
            "verseString": "If you doubt what We revealed to Our servant, produce a chapter like it, and call upon your witnesses, other than God, if you are indeed truthful.",
            "verseStringReplacedWithAllah": "If you doubt what We revealed to Our servant, produce a chapter like it, and call upon your witnesses, other than Allah, if you are indeed truthful."
        },
        {
            "verseNumber": 24,
            "verseString": "But if you don’t—and you won’t—then beware of the Fire, whose fuel is people and stones, prepared for the unbelievers."
        },
        {
            "verseNumber": 25,
            "verseString": "Give good news to those who believe and do righteous deeds, that they’ll have gardens through which rivers flow. Whenever they are given fruits from there as sustenance, they will say, “This is what we were given before,” they will be given things in resemblance. Therein, they will have purified spouses and dwell there forever."
        },
        {
            "verseNumber": 26,
            "verseString": "God is not shy to illustrate an example—whether it is of a mosquito or something larger than it. Those who believe know that it’s the truth from their Lord. But those who disbelieve question, “What could God mean by this example?” Through it, He misguides many and guides many. However, He misguides only the wrongdoers.",
            "verseStringReplacedWithAllah": "Allah is not shy to illustrate an example—whether it is of a mosquito or something larger than it. Those who believe know that it’s the truth from their Lord. But those who disbelieve question, “What could Allah mean by this example?” Through it, He misguides many and guides many. However, He misguides only the wrongdoers."
        },
        {
            "verseNumber": 27,
            "verseString": "Those who violate God’s covenant after its ratification, cut what God commanded to be joined, and spread corruption on earth—these are the losers.",
            "verseStringReplacedWithAllah": "Those who violate Allah’s covenant after its ratification, cut what Allah commanded to be joined, and spread corruption on earth—these are the losers."
        },
        {
            "verseNumber": 28,
            "verseString": "How can you disbelieve in God, when you were lifeless, then He gave you life, then He will cause you to die, then He will bring you back to life, and then to Him you will be returned?",
            "verseStringReplacedWithAllah": "How can you disbelieve in Allah, when you were lifeless, then He gave you life, then He will cause you to die, then He will bring you back to life, and then to Him you will be returned?"
        },
        {
            "verseNumber": 29,
            "verseString": "It is He who created everything on earth for you, then He turned towards the sky and formed them into seven heavens. He is fully aware of everything."
        },
        {
            "verseNumber": 30,
            "verseString": "When your Lord said to the angels, “I am placing a successor on earth,” they questioned, “Will You place in it one who will spread corruption and shed blood, while we glorify You with praises and sanctify You?” He answered, “I know what you don’t know.”"
        },
        {
            "verseNumber": 31,
            "verseString": "He taught Adam the names—all of them. Then He presented them to the angels, and said, “Tell me the names of these, if you are truthful.”"
        },
        {
            "verseNumber": 32,
            "verseString": "They replied, “Glory be to You; we have no knowledge, except what You taught us. It is You who is the Knowing, the Wise.”"
        },
        {
            "verseNumber": 33,
            "verseString": "Then He said, “O Adam, inform them of their names.” When he had done so, He said, “Didn’t I say to you that I know the unseen aspects of the heavens and the earth, and that I know what you disclose and what you conceal?”"
        },
        {
            "verseNumber": 34,
            "verseString": "And when We said to the angels, “Prostrate yourselves before Adam,” they all did, except Iblis. He refused, was arrogant, and became one of the ungrateful."
        },
        {
            "verseNumber": 35,
            "verseString": "We said, “O Adam, dwell, you and your wife, in Paradise, and eat freely from it wherever you wish, but don’t approach this tree, else you become wrongdoers.”"
        },
        {
            "verseNumber": 36,
            "verseString": "But Satan made them slip from it and got them evicted from where they were. We said, “Descend; some of you will be enemies to others. On earth, you’ll have settlement and sustenance for a time.”"
        },
        {
            "verseNumber": 37,
            "verseString": "Then Adam received words from his Lord, and He accepted his repentance. He is the Acceptor of Repentance, the Merciful."
        },
        {
            "verseNumber": 38,
            "verseString": "We said, “Descend from it, all of you. When guidance comes to you from Me, those who follow My guidance will neither fear nor grieve."
        },
        {
            "verseNumber": 39,
            "verseString": "But those who disbelieve and deny Our signs, they will be the dwellers of the Fire, where they will remain forever.”"
        },
        {
            "verseNumber": 40,
            "verseString": "O Children of Israel, remember My favor which I bestowed upon you, fulfill My covenant and I will fulfill yours, and fear only Me."
        },
        {
            "verseNumber": 41,
            "verseString": "Believe in what I revealed, which confirms what you already possess. And don’t be the first to reject it, nor sell My revelations for a trivial price, and revere only Me."
        },
        {
            "verseNumber": 42,
            "verseString": "Don’t mix the truth with falsehood, nor knowingly conceal the truth."
        },
        {
            "verseNumber": 43,
            "verseString": "Establish prayer, give the purifying charity, and bow down with those who bow down."
        },
        {
            "verseNumber": 44,
            "verseString": "Do you command people to righteousness, yet forget yourselves, even while you read the Scriptures? Don’t you understand?"
        },
        {
            "verseNumber": 45,
            "verseString": "And seek help through patience and prayer. But it’s difficult, except for the humble."
        },
        {
            "verseNumber": 46,
            "verseString": "Those who are certain they will meet their Lord and return to Him."
        },
        {
            "verseNumber": 47,
            "verseString": "O Children of Israel, remember My favor that I granted you, and how I preferred you over the worlds."
        },
        {
            "verseNumber": 48,
            "verseString": "And fear a Day when no soul will avail another, nor will intercession be accepted from it, nor will compensation be accepted from it, nor will they be helped."
        },
        {
            "verseNumber": 49,
            "verseString": "Recall when We saved you from Pharaoh’s people, who inflicted upon you grievous suffering, slaughtering your sons while sparing your women. In that was a severe trial from your Lord."
        },
        {
            "verseNumber": 50,
            "verseString": "And when We parted the sea for you, We rescued you and drowned Pharaoh’s people while you watched."
        },
        {
            "verseNumber": 51,
            "verseString": "We summoned Moses for forty nights, and in his absence, you took to worshiping the calf and were wrongdoers."
        },
        {
            "verseNumber": 52,
            "verseString": "Yet, We pardoned you afterwards so that you might be grateful."
        },
        {
            "verseNumber": 53,
            "verseString": "We gave Moses the Scripture and the discernment to guide you."
        },
        {
            "verseNumber": 54,
            "verseString": "Moses said to his people, “O my people, you’ve wronged yourselves by adopting the calf. So repent to your Maker and kill yourselves; this is better for you before your Maker.” Then, He accepted your repentance. He is the Acceptor of Repentance, the Merciful."
        },
        {
            "verseNumber": 55,
            "verseString": "When you said, “O Moses, we won’t believe you until we see God plainly,” a thunderbolt struck you while you watched.",
            "verseStringReplacedWithAllah": "When you said, “O Moses, we won’t believe you until we see Allah plainly,” a thunderbolt struck you while you watched."
        },
        {
            "verseNumber": 56,
            "verseString": "After that, We revived you after your death, so that you may be grateful."
        },
        {
            "verseNumber": 57,
            "verseString": "We shaded you with the clouds, and We sent down manna and quails for you: “Eat from the good provisions We’ve given you.” They didn’t wrong Us, but they wronged themselves."
        },
        {
            "verseNumber": 58,
            "verseString": "When We commanded, “Enter this town, and eat freely from it wherever you wish, but enter the gate humbly, and say words of humility. We will forgive your sins and will increase the good-doers.”"
        },
        {
            "verseNumber": 59,
            "verseString": "However, the wrongdoers among them altered the words they were given, so We sent down a scourge from the sky upon the wrongdoers for their transgressions."
        },
        {
            "verseNumber": 60,
            "verseString": "And when Moses sought water for his people, We instructed, “Strike the rock with your staff.” Twelve springs gushed from it, and each tribe knew its drinking place. “Eat and drink from God’s provision, and don’t corrupt the earth with disobedience.”",
            "verseStringReplacedWithAllah": "And when Moses sought water for his people, We instructed, “Strike the rock with your staff.” Twelve springs gushed from it, and each tribe knew its drinking place. “Eat and drink from Allah’s provision, and don’t corrupt the earth with disobedience.”"
        },
        {
            "verseNumber": 61,
            "verseString": "When you said, “O Moses, we can’t endure one kind of food. So pray to your Lord for us, to produce for us earthly crops like herbs, cucumbers, garlic, lentils, and onions.” He replied, “Would you exchange something superior for something inferior? Go down to any city, and you’ll have what you requested.” They were stricken with humiliation and misery, and they incurred God’s wrath. This was because they rejected God’s signs, unjustly killed prophets, and because they disobeyed and transgressed.",
            "verseStringReplacedWithAllah": "When you said, “O Moses, we can’t endure one kind of food. So pray to your Lord for us, to produce for us earthly crops like herbs, cucumbers, garlic, lentils, and onions.” He replied, “Would you exchange something superior for something inferior? Go down to any city, and you’ll have what you requested.” They were stricken with humiliation and misery, and they incurred Allah’s wrath. This was because they rejected Allah’s signs, unjustly killed prophets, and because they disobeyed and transgressed."
        },
        {
            "verseNumber": 62,
            "verseString": "Those who believe, and those who are Jewish, and the Christians, and the Sabians—whoever believes in God and the Last Day and acts righteously—will have their reward from their Lord. They have nothing to fear, nor will they grieve.",
            "verseStringReplacedWithAllah": "Those who believe, and those who are Jewish, and the Christians, and the Sabians—whoever believes in Allah and the Last Day and acts righteously—will have their reward from their Lord. They have nothing to fear, nor will they grieve."
        },
        {
            "verseNumber": 63,
            "verseString": "We made a covenant with you, as We raised the Mount above you: “Hold firmly to what We’ve given you, and remember what’s in it, so that you may become righteous.”"
        },
        {
            "verseNumber": 64,
            "verseString": "Yet, you turned away after that. Were it not for God’s grace and mercy upon you, you would’ve been among the losers.",
            "verseStringReplacedWithAllah": "Yet, you turned away after that. Were it not for Allah’s grace and mercy upon you, you would’ve been among the losers."
        },
        {
            "verseNumber": 65,
            "verseString": "You knew those among you who transgressed the Sabbath. We said to them, “Be apes, despised.”"
        },
        {
            "verseNumber": 66,
            "verseString": "So We made it an exemplary punishment for their generation and the generations to follow, and a lesson for the virtuous."
        },
        {
            "verseNumber": 67,
            "verseString": "When Moses told his people, “God commands you to sacrifice a cow,” they replied, “Are you making fun of us?” He replied, “I seek refuge in God from being among the ignorant.”",
            "verseStringReplacedWithAllah": "When Moses told his people, “Allah commands you to sacrifice a cow,” they replied, “Are you making fun of us?” He replied, “I seek refuge in Allah from being among the ignorant.”"
        },
        {
            "verseNumber": 68,
            "verseString": "They said, “Ask your Lord to clarify for us what kind.” He replied, “He says it’s a cow, not too old nor too young, but of middle age. So do what you’re commanded.”"
        },
        {
            "verseNumber": 69,
            "verseString": "They said, “Ask your Lord to clarify for us its color.” He replied, “He says it’s a cow, bright yellow in color, pleasing to the onlookers.”"
        },
        {
            "verseNumber": 70,
            "verseString": "They said, “Ask your Lord to specify for us exactly what it is, all cows are alike to us. And, if God wills, we will be guided.”",
            "verseStringReplacedWithAllah": "They said, “Ask your Lord to specify for us exactly what it is, all cows are alike to us. And, if Allah wills, we will be guided.”"
        },
        {
            "verseNumber": 71,
            "verseString": "He replied, “He says it’s a cow not utilized for plowing or irrigating fields, flawless, with no blemish.” They said, “Now you’ve brought the truth.” So they slaughtered her, but they almost didn’t."
        },
        {
            "verseNumber": 72,
            "verseString": "When you killed a person and disputed over it, God unveiled what you were hiding.",
            "verseStringReplacedWithAllah": "When you killed a person and disputed over it, Allah unveiled what you were hiding."
        },
        {
            "verseNumber": 73,
            "verseString": "We commanded, “Strike him with part of it.” Thus, does God bring the dead to life. He shows you His signs so you may understand.",
            "verseStringReplacedWithAllah": "We commanded, “Strike him with part of it.” Thus, does Allah bring the dead to life. He shows you His signs so you may understand."
        },
        {
            "verseNumber": 74,
            "verseString": "Then your hearts hardened after that, being like stones or even harder. Yet, there are stones from which rivers burst forth, and there are some that split open and water comes out, and there are some that fall down for awe of God. And God is not unaware of what you do.",
            "verseStringReplacedWithAllah": "Then your hearts hardened after that, being like stones or even harder. Yet, there are stones from which rivers burst forth, and there are some that split open and water comes out, and there are some that fall down for awe of Allah. And Allah is not unaware of what you do."
        },
        {
            "verseNumber": 75,
            "verseString": "Do you wish that they would believe you, when some of them heard God’s word, then deliberately distorted it, even after they understood it?",
            "verseStringReplacedWithAllah": "Do you wish that they would believe you, when some of them heard Allah’s word, then deliberately distorted it, even after they understood it?"
        },
        {
            "verseNumber": 76,
            "verseString": "When they encounter those who believe, they say, “We believe.” But when alone, they question, “Will you disclose to them what God revealed to you so they can argue with you about it before your Lord? Don’t you understand?”",
            "verseStringReplacedWithAllah": "When they encounter those who believe, they say, “We believe.” But when alone, they question, “Will you disclose to them what Allah revealed to you so they can argue with you about it before your Lord? Don’t you understand?”"
        },
        {
            "verseNumber": 77,
            "verseString": "Don’t they know that God knows what they conceal and what they disclose?",
            "verseStringReplacedWithAllah": "Don’t they know that Allah knows what they conceal and what they disclose?"
        },
        {
            "verseNumber": 78,
            "verseString": "Among them are unlettered ones who don’t know the Scripture except in wishful thinking."
        },
        {
            "verseNumber": 79,
            "verseString": "Woe to those who, with their hands, write the Scripture and then claim, “This is from God,” to sell it for a paltry price. Woe to them for what their hands have written, and woe to them for what they’ve earned.",
            "verseStringReplacedWithAllah": "Woe to those who, with their hands, write the Scripture and then claim, “This is from Allah,” to sell it for a paltry price. Woe to them for what their hands have written, and woe to them for what they’ve earned."
        },
        {
            "verseNumber": 80,
            "verseString": "And they say, “The Fire won’t touch us except for a few days.” Say, “Did you receive a promise from God—God never breaks His promise—or are you saying what you don’t know about God?”",
            "verseStringReplacedWithAllah": "And they say, “The Fire won’t touch us except for a few days.” Say, “Did you receive a promise from Allah—Allah never breaks His promise—or are you saying what you don’t know about Allah?”"
        },
        {
            "verseNumber": 81,
            "verseString": "Those who commit sins and become besieged by their wrongdoings are the dwellers of the Fire, where they will remain forever."
        },
        {
            "verseNumber": 82,
            "verseString": "However, those who believe and perform righteous deeds are the inhabitants of Paradise, where they will remain forever."
        },
        {
            "verseNumber": 83,
            "verseString": "We made a covenant with the Children of Israel: “Worship none but God, honor your parents, relatives, orphans, and the needy. Speak kindly to people, observe the prayer, and give in charity.” Then you turned away, except for a few among you.",
            "verseStringReplacedWithAllah": "We made a covenant with the Children of Israel: “Worship none but Allah, honor your parents, relatives, orphans, and the needy. Speak kindly to people, observe the prayer, and give in charity.” Then you turned away, except for a few among you."
        },
        {
            "verseNumber": 84,
            "verseString": "We took your covenant not to shed each other’s blood, nor drive out one another from your homes. You agreed and attested."
        },
        {
            "verseNumber": 85,
            "verseString": "Yet, here you are, killing each other and expelling some of your own from their homes, assisting each other in sin and aggression. If they come to you as captives, you ransom them, even though it was forbidden for you to expel them. Do you believe in parts of the Scripture and reject others? What will be the reward for those among you who do so, except disgrace in this worldly life? And on Resurrection Day, they will be returned to the harshest punishment. God is not unaware of what you do.",
            "verseStringReplacedWithAllah": "Yet, here you are, killing each other and expelling some of your own from their homes, assisting each other in sin and aggression. If they come to you as captives, you ransom them, even though it was forbidden for you to expel them. Do you believe in parts of the Scripture and reject others? What will be the reward for those among you who do so, except disgrace in this worldly life? And on Resurrection Day, they will be returned to the harshest punishment. Allah is not unaware of what you do."
        },
        {
            "verseNumber": 86,
            "verseString": "These are the ones who trade the Hereafter for this worldly life. Their punishment won’t be lightened, nor will they be helped."
        },
        {
            "verseNumber": 87,
            "verseString": "We gave Moses the Scripture, and followed him up with the succession of messengers. And We gave Jesus, the son of Mary, the miracles, and We strengthened him with the Holy Spirit. Is it that whenever a messenger comes to you with something that doesn’t suit your desires, you respond with arrogance, denying some and murdering others?"
        },
        {
            "verseNumber": 88,
            "verseString": "They say, “Our hearts are sealed.” In fact, God cursed them for their disbelief; they have but little faith.",
            "verseStringReplacedWithAllah": "They say, “Our hearts are sealed.” In fact, Allah cursed them for their disbelief; they have but little faith."
        },
        {
            "verseNumber": 89,
            "verseString": "When a Scripture came to them from God, confirming what they already had—although before they were praying for victory against those who disbelieved—when what they recognized came to them, they rejected it. So, the curse of God is upon the unbelievers.",
            "verseStringReplacedWithAllah": "When a Scripture came to them from Allah, confirming what they already had—although before they were praying for victory against those who disbelieved—when what they recognized came to them, they rejected it. So, the curse of Allah is upon the unbelievers."
        },
        {
            "verseNumber": 90,
            "verseString": "How pitiful is what they sold their souls for—denying what God revealed, out of sheer resentment, that God should bestow His grace upon whom He wills of His servants. They incurred wrath upon wrath, and for the unbelievers, there is a humiliating punishment.",
            "verseStringReplacedWithAllah": "How pitiful is what they sold their souls for—denying what Allah revealed, out of sheer resentment, that Allah should bestow His grace upon whom He wills of His servants. They incurred wrath upon wrath, and for the unbelievers, there is a humiliating punishment."
        },
        {
            "verseNumber": 91,
            "verseString": "When they are told, “Believe in what God revealed,” they respond, “We believe in what was revealed to us.” Yet they deny what came after it, even though it’s the truth confirming what they have. Say, “Why, then, did you kill God’s prophets previously, if you are believers?”",
            "verseStringReplacedWithAllah": "When they are told, “Believe in what Allah revealed,” they respond, “We believe in what was revealed to us.” Yet they deny what came after it, even though it’s the truth confirming what they have. Say, “Why, then, did you kill Allah’s prophets previously, if you are believers?”"
        },
        {
            "verseNumber": 92,
            "verseString": "Moses came to you with clear signs, yet you chose to worship the calf in his absence, while you were wrongdoers."
        },
        {
            "verseNumber": 93,
            "verseString": "We made a covenant with you, as We raised the Mount above you, commanding, “Hold firmly to what We’ve given you, and listen.” Yet, they responded, “We hear, and we disobey.” Their hearts were soaked with the love of the calf because of their disbelief. Say, “How pitiful is what your faith compels you to do, if you are believers.”"
        },
        {
            "verseNumber": 94,
            "verseString": "Say, “If the Final Home with God is exclusively yours, with no one else included, then wish for death, if you are truthful.”",
            "verseStringReplacedWithAllah": "Say, “If the Final Home with Allah is exclusively yours, with no one else included, then wish for death, if you are truthful.”"
        },
        {
            "verseNumber": 95,
            "verseString": "But they will never wish for it, because of what their hands have done. God is fully aware of the wrongdoers.",
            "verseStringReplacedWithAllah": "But they will never wish for it, because of what their hands have done. Allah is fully aware of the wrongdoers."
        },
        {
            "verseNumber": 96,
            "verseString": "Of all people, you’ll find them most eager for life, even more so than the idolaters. Each one of them aspires to live a thousand years. Yet, a long life won’t nudge him from the punishment. God sees everything they do.",
            "verseStringReplacedWithAllah": "Of all people, you’ll find them most eager for life, even more so than the idolaters. Each one of them aspires to live a thousand years. Yet, a long life won’t nudge him from the punishment. Allah sees everything they do."
        },
        {
            "verseNumber": 97,
            "verseString": "Say, “Whoever is an enemy to Gabriel—it was he who, by God’s will, brought it down upon your heart, confirming what preceded it, and providing guidance and good news for the believers.”",
            "verseStringReplacedWithAllah": "Say, “Whoever is an enemy to Gabriel—it was he who, by Allah’s will, brought it down upon your heart, confirming what preceded it, and providing guidance and good news for the believers.”"
        },
        {
            "verseNumber": 98,
            "verseString": "Whoever is an enemy to God, His angels, His messengers, Gabriel, and Michael—God is the enemy of the unbelievers.",
            "verseStringReplacedWithAllah": "Whoever is an enemy to Allah, His angels, His messengers, Gabriel, and Michael—Allah is the enemy of the unbelievers."
        },
        {
            "verseNumber": 99,
            "verseString": "We revealed to you clear verses, but none deny them except the sinners."
        },
        {
            "verseNumber": 100,
            "verseString": "Isn’t it true that whenever they enter into a covenant, a faction among them discards it? Indeed, most of them don’t believe."
        },
        {
            "verseNumber": 101,
            "verseString": "And when there came to them a Messenger from God, confirming what was with them, a faction of those who were given the Scripture threw the Scripture of God behind their backs, as though they didn’t know.",
            "verseStringReplacedWithAllah": "And when there came to them a Messenger from Allah, confirming what was with them, a faction of those who were given the Scripture threw the Scripture of Allah behind their backs, as though they didn’t know."
        },
        {
            "verseNumber": 102,
            "verseString": "They followed what the devils attributed during Solomon’s reign. Solomon didn’t disbelieve, but the devils did. They taught people magic, and what was revealed to the two angels, Harut and Marut, in Babylon. They didn’t teach anyone without first cautioning, “We’re a test, so don’t lose faith.” They learned from them how to sow discord between a man and his wife. Yet, they can’t harm anyone without God’s permission. They learned what harms them and doesn’t benefit them, knowing well that whoever practices it will have no share in the Hereafter. How terrible is what they sold their souls for—if only they understood.",
            "verseStringReplacedWithAllah": "They followed what the devils attributed during Solomon’s reign. Solomon didn’t disbelieve, but the devils did. They taught people magic, and what was revealed to the two angels, Harut and Marut, in Babylon. They didn’t teach anyone without first cautioning, “We’re a test, so don’t lose faith.” They learned from them how to sow discord between a man and his wife. Yet, they can’t harm anyone without Allah’s permission. They learned what harms them and doesn’t benefit them, knowing well that whoever practices it will have no share in the Hereafter. How terrible is what they sold their souls for—if only they understood."
        },
        {
            "verseNumber": 103,
            "verseString": "If they had remained faithful and righteous, a reward from God would’ve been far better—if only they knew.",
            "verseStringReplacedWithAllah": "If they had remained faithful and righteous, a reward from Allah would’ve been far better—if only they knew."
        },
        {
            "verseNumber": 104,
            "verseString": "O you who believe, don’t use words of disrespect, but speak in a manner that is honest, and listen carefully. The unbelievers will face severe punishment."
        },
        {
            "verseNumber": 105,
            "verseString": "Neither the unbelievers among the People of the Scripture nor the polytheists desire any blessings for you from your Lord. However, God selects for His mercy whom He wills, for God is of boundless grace.",
            "verseStringReplacedWithAllah": "Neither the unbelievers among the People of the Scripture nor the polytheists desire any blessings for you from your Lord. However, Allah selects for His mercy whom He wills, for Allah is of boundless grace."
        },
        {
            "verseNumber": 106,
            "verseString": "Whatever a verse We abrogate or cause to be forgotten, We bring a better one or similar to it. Don’t you know that God is capable of everything?",
            "verseStringReplacedWithAllah": "Whatever a verse We abrogate or cause to be forgotten, We bring a better one or similar to it. Don’t you know that Allah is capable of everything?"
        },
        {
            "verseNumber": 107,
            "verseString": "Don’t you know that God reigns over the heavens and the earth? Apart from Him, you have neither guardian nor ally.",
            "verseStringReplacedWithAllah": "Don’t you know that Allah reigns over the heavens and the earth? Apart from Him, you have neither guardian nor ally."
        },
        {
            "verseNumber": 108,
            "verseString": "Would you question your Messenger as Moses was questioned before? Whoever exchanges faith for disbelief has strayed from the right way."
        },
        {
            "verseNumber": 109,
            "verseString": "Many among the People of the Scripture, out of envy, wish to turn you back into unbelievers after you have believed, even after the truth has become clear to them. Nevertheless, forgive and overlook until God brings His command. God has power over all things.",
            "verseStringReplacedWithAllah": "Many among the People of the Scripture, out of envy, wish to turn you back into unbelievers after you have believed, even after the truth has become clear to them. Nevertheless, forgive and overlook until Allah brings His command. Allah has power over all things."
        },
        {
            "verseNumber": 110,
            "verseString": "Establish prayer and give the purifying charity. Whatever good you put forward for yourselves, you’ll find it with God. God sees what you do.",
            "verseStringReplacedWithAllah": "Establish prayer and give the purifying charity. Whatever good you put forward for yourselves, you’ll find it with Allah. Allah sees what you do."
        },
        {
            "verseNumber": 111,
            "verseString": "They say, “Only Jews and Christians will enter Paradise.” These are their wishes. Say, “Present your proof, if you are truthful.”"
        },
        {
            "verseNumber": 112,
            "verseString": "In fact, whoever submits himself to God and is a doer of good will have his reward with his Lord. They will neither fear nor grieve.",
            "verseStringReplacedWithAllah": "In fact, whoever submits himself to Allah and is a doer of good will have his reward with his Lord. They will neither fear nor grieve."
        },
        {
            "verseNumber": 113,
            "verseString": "The Jews say, “The Christians have no basis,” and the Christians say, “The Jews have no basis,” although they read the Scripture. Similarly, those who lack knowledge say the same. God will arbitrate between them on Resurrection Day concerning their disputes.",
            "verseStringReplacedWithAllah": "The Jews say, “The Christians have no basis,” and the Christians say, “The Jews have no basis,” although they read the Scripture. Similarly, those who lack knowledge say the same. Allah will arbitrate between them on Resurrection Day concerning their disputes."
        },
        {
            "verseNumber": 114,
            "verseString": "And who are more unjust than those who prevent God’s name from being mentioned in His mosques and strive toward their ruin? Such individuals should enter them only in fear. For them, there is disgrace in this life, and they will have a severe punishment in the Hereafter.",
            "verseStringReplacedWithAllah": "And who are more unjust than those who prevent Allah’s name from being mentioned in His mosques and strive toward their ruin? Such individuals should enter them only in fear. For them, there is disgrace in this life, and they will have a severe punishment in the Hereafter."
        },
        {
            "verseNumber": 115,
            "verseString": "To God belong the East and the West. Wherever you turn, there is God’s presence. God is All-Encompassing, All-Knowing.",
            "verseStringReplacedWithAllah": "To Allah belong the East and the West. Wherever you turn, there is Allah’s presence. Allah is All-Encompassing, All-Knowing."
        },
        {
            "verseNumber": 116,
            "verseString": "They say, “God has begotten a son.” Glorified is He! Rather, everything in the heavens and the earth is His; all are obedient to Him.",
            "verseStringReplacedWithAllah": "They say, “Allah has begotten a son.” Glorified is He! Rather, everything in the heavens and the earth is His; all are obedient to Him."
        },
        {
            "verseNumber": 117,
            "verseString": "The Originator of the heavens and the earth; when He decrees a matter, He only says to it: ‘Be,’ and it is."
        },
        {
            "verseNumber": 118,
            "verseString": "Those who don’t know ask, “Why doesn’t God speak to us, or give us a sign?” Those before them made the same demands. Their hearts are similar. We made the signs clear for people who have certainty.",
            "verseStringReplacedWithAllah": "Those who don’t know ask, “Why doesn’t Allah speak to us, or give us a sign?” Those before them made the same demands. Their hearts are similar. We made the signs clear for people who have certainty."
        },
        {
            "verseNumber": 119,
            "verseString": "We sent you with the truth—as a bearer of good news and a warner. You won’t be asked about the inhabitants of Hellfire."
        },
        {
            "verseNumber": 120,
            "verseString": "Neither the Jews nor the Christians will approve of you until you follow their way. Say, “God’s guidance is the guidance.” If you were to follow their desires, after the knowledge that has come to you, you will have from God neither a protector nor a helper.",
            "verseStringReplacedWithAllah": "Neither the Jews nor the Christians will approve of you until you follow their way. Say, “Allah’s guidance is the guidance.” If you were to follow their desires, after the knowledge that has come to you, you will have from Allah neither a protector nor a helper."
        },
        {
            "verseNumber": 121,
            "verseString": "Those we have given the Scripture adhere to it, as it should be adhered to—these believe in it. Those who reject it are the losers."
        },
        {
            "verseNumber": 122,
            "verseString": "O Children of Israel, remember My favor which I bestowed upon you, and how I favored you above all the nations."
        },
        {
            "verseNumber": 123,
            "verseString": "Beware of a Day when no soul will avail another in any way, no ransom will be accepted from it, no intercession will benefit it, and they won’t be helped."
        },
        {
            "verseNumber": 124,
            "verseString": "And when Abraham was tested by his Lord with commands, and he fulfilled them. He said, “I will make you a leader for the people.” He asked, “What about my descendants?” He replied, “My covenant doesn’t extend to the wrongdoers.”"
        },
        {
            "verseNumber": 125,
            "verseString": "We made the House as a gathering place and a sanctuary for people. And take the station of Abraham as a place of prayer. We commanded Abraham and Ishmael, “Purify My House for those who circumambulate, those who meditate, and those who kneel and prostrate.”"
        },
        {
            "verseNumber": 126,
            "verseString": "Abraham prayed, “My Lord, make this a secure land, and provide its people with fruits—those among them who believe in God and the Last Day.” He replied, “As for those who disbelieve, I will let them enjoy a little, then I will compel them to the punishment of the Fire—a terrible destination.”",
            "verseStringReplacedWithAllah": "Abraham prayed, “My Lord, make this a secure land, and provide its people with fruits—those among them who believe in Allah and the Last Day.” He replied, “As for those who disbelieve, I will let them enjoy a little, then I will compel them to the punishment of the Fire—a terrible destination.”"
        },
        {
            "verseNumber": 127,
            "verseString": "When Abraham and Ishmael were raising the foundations of the House, they prayed, “Our Lord, accept this from us; You are the All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 128,
            "verseString": "Our Lord, make us submissive to You, and make from our descendants a nation submissive to You. Show us our rites, and accept our repentance; You are the Acceptor of Repentance, the Most Merciful."
        },
        {
            "verseNumber": 129,
            "verseString": "Our Lord, raise among them a messenger from themselves, who will convey to them Your verses, teach them the Scripture and wisdom, and purify them. You are the Almighty, the Wise.”"
        },
        {
            "verseNumber": 130,
            "verseString": "And who would turn away from the faith of Abraham but someone who fools his own soul? We chose him in this world, and in the Hereafter, he will be among the righteous."
        },
        {
            "verseNumber": 131,
            "verseString": "When his Lord said to him, “Submit,” he said, “I have submitted to the Lord of the worlds.”"
        },
        {
            "verseNumber": 132,
            "verseString": "Abraham instructed his sons, as did Jacob, “O my sons, God chose this religion for you, so don’t die except as Submitters.”",
            "verseStringReplacedWithAllah": "Abraham instructed his sons, as did Jacob, “O my sons, Allah chose this religion for you, so don’t die except as Submitters.”"
        },
        {
            "verseNumber": 133,
            "verseString": "Were you witnesses when death came to Jacob, when he asked his sons, “Whom will you worship after me?” They replied, “We will worship your God and the God of your fathers, Abraham, Ishmael, and Isaac—the One God. To Him we are submitters.”"
        },
        {
            "verseNumber": 134,
            "verseString": "That was a community that has passed on. They will reap what they sowed, and you will reap what you sowed. You won’t be questioned about their deeds."
        },
        {
            "verseNumber": 135,
            "verseString": "They say, “Be Jews or Christians, and you will be guided.” Say, “Rather, the faith of Abraham, the Monotheist, and he was not of the polytheists.”"
        },
        {
            "verseNumber": 136,
            "verseString": "Say, “We believe in God, and in what was revealed to us, and in what was revealed to Abraham, Ishmael, Isaac, Jacob, and the Tribes, and in what was given to Moses and Jesus, and in what was given to the prophets from their Lord. We make no distinction between any of them, and to Him we submit.”",
            "verseStringReplacedWithAllah": "Say, “We believe in Allah, and in what was revealed to us, and in what was revealed to Abraham, Ishmael, Isaac, Jacob, and the Tribes, and in what was given to Moses and Jesus, and in what was given to the prophets from their Lord. We make no distinction between any of them, and to Him we submit.”"
        },
        {
            "verseNumber": 137,
            "verseString": "If they believe as you believe, then they are guided. But if they turn away, they are in schism. God will be sufficient for you against them. He is the All-Hearing, the All-Knowing.",
            "verseStringReplacedWithAllah": "If they believe as you believe, then they are guided. But if they turn away, they are in schism. Allah will be sufficient for you against them. He is the All-Hearing, the All-Knowing."
        },
        {
            "verseNumber": 138,
            "verseString": "God’s coloring—what color could be superior to God’s? “We are worshipers of Him.”",
            "verseStringReplacedWithAllah": "Allah’s coloring—what color could be superior to Allah’s? “We are worshipers of Him.”"
        },
        {
            "verseNumber": 139,
            "verseString": "Say, “Will you dispute with us about God, when He is our Lord and your Lord, and we have our deeds, and you have yours, and we are sincere to Him?”",
            "verseStringReplacedWithAllah": "Say, “Will you dispute with us about Allah, when He is our Lord and your Lord, and we have our deeds, and you have yours, and we are sincere to Him?”"
        },
        {
            "verseNumber": 140,
            "verseString": "Do you assert that Abraham, Ishmael, Isaac, Jacob, and the Tribes were Jews or Christians? Say, “Are you more knowledgeable, or is God?” Who is more unjust than one who conceals a testimony he has from God? God is not unaware of what you do.",
            "verseStringReplacedWithAllah": "Do you assert that Abraham, Ishmael, Isaac, Jacob, and the Tribes were Jews or Christians? Say, “Are you more knowledgeable, or is Allah?” Who is more unjust than one who conceals a testimony he has from Allah? Allah is not unaware of what you do."
        },
        {
            "verseNumber": 141,
            "verseString": "That was a community that has passed on. They are responsible for their actions, and you are responsible for yours. You won’t be questioned about what they did."
        },
        {
            "verseNumber": 142,
            "verseString": "The foolish among the people will say, “Why did they change their prayer direction?” Say: “To God belong the East and the West, He guides whom He wills to a straight path.”",
            "verseStringReplacedWithAllah": "The foolish among the people will say, “Why did they change their prayer direction?” Say: “To Allah belong the East and the West, He guides whom He wills to a straight path.”"
        },
        {
            "verseNumber": 143,
            "verseString": "We made you a balanced community, so that you may be witnesses over humanity, and the Messenger may be a witness over you. We established your former prayer direction to differentiate those who follow the Messenger from those who turn back on their heels. It was indeed significant, except for those whom God has guided. God won’t let your faith be wasted. Indeed, God is, to the people, Kind and Merciful.",
            "verseStringReplacedWithAllah": "We made you a balanced community, so that you may be witnesses over humanity, and the Messenger may be a witness over you. We established your former prayer direction to differentiate those who follow the Messenger from those who turn back on their heels. It was indeed significant, except for those whom Allah has guided. Allah won’t let your faith be wasted. Indeed, Allah is, to the people, Kind and Merciful."
        },
        {
            "verseNumber": 144,
            "verseString": "We observed you turning your face towards the heavens, so We will guide you to a direction that will please you. Turn your face towards the Sacred Mosque, and wherever you may be, face it. Those given the Scripture know this to be the truth from their Lord. God is not unaware of what they do.",
            "verseStringReplacedWithAllah": "We observed you turning your face towards the heavens, so We will guide you to a direction that will please you. Turn your face towards the Sacred Mosque, and wherever you may be, face it. Those given the Scripture know this to be the truth from their Lord. Allah is not unaware of what they do."
        },
        {
            "verseNumber": 145,
            "verseString": "Even if you were to bring to those who were given the Scripture every verse, they wouldn’t follow your direction, nor should you follow theirs. Nor do they follow one another’s direction. If you followed their desires, after the knowledge that has come to you, you would then be among the unjust."
        },
        {
            "verseNumber": 146,
            "verseString": "Those to whom We gave the Scripture recognize it as they recognize their own children. But some of them knowingly conceal the truth."
        },
        {
            "verseNumber": 147,
            "verseString": "The truth is from your Lord, so don’t be among the doubters."
        },
        {
            "verseNumber": 148,
            "verseString": "For each, there is a direction they turn to, so compete in doing good deeds. Wherever you may be, God will bring you all together. God has power over all things.",
            "verseStringReplacedWithAllah": "For each, there is a direction they turn to, so compete in doing good deeds. Wherever you may be, Allah will bring you all together. Allah has power over all things."
        },
        {
            "verseNumber": 149,
            "verseString": "And from wherever you go out, turn your face towards the Sacred Mosque. This is the truth from your Lord. God is not unaware of what you do.",
            "verseStringReplacedWithAllah": "And from wherever you go out, turn your face towards the Sacred Mosque. This is the truth from your Lord. Allah is not unaware of what you do."
        },
        {
            "verseNumber": 150,
            "verseString": "From wherever you set out, turn your face towards the Sacred Mosque. And wherever you are, face it, so that people will have no argument against you, except for the wrongdoers among them. So don’t fear them, but fear Me. I will then complete My favor upon you, so that you may be guided."
        },
        {
            "verseNumber": 151,
            "verseString": "Even as We sent to you a messenger from among you, who conveys Our verses to you, purifies you, teaches you the Scripture and wisdom, and teaches you what you didn’t know."
        },
        {
            "verseNumber": 152,
            "verseString": "So remember Me, and I will remember you. Be thankful to Me, and don’t reject faith."
        },
        {
            "verseNumber": 153,
            "verseString": "O you who believe, seek help through patience and prayer; indeed God is with those who are patient.",
            "verseStringReplacedWithAllah": "O you who believe, seek help through patience and prayer; indeed Allah is with those who are patient."
        },
        {
            "verseNumber": 154,
            "verseString": "Don’t say of those who are killed in God’s way, “They are dead.” Rather, they are alive, but you can’t perceive it.",
            "verseStringReplacedWithAllah": "Don’t say of those who are killed in Allah’s way, “They are dead.” Rather, they are alive, but you can’t perceive it."
        },
        {
            "verseNumber": 155,
            "verseString": "We will certainly test you with a measure of fear, hunger, loss of wealth, lives, and fruits. But give good news to the patient."
        },
        {
            "verseNumber": 156,
            "verseString": "Those who, when a disaster strikes them, say, “To God we belong, and to Him we will return.”",
            "verseStringReplacedWithAllah": "Those who, when a disaster strikes them, say, “To Allah we belong, and to Him we will return.”"
        },
        {
            "verseNumber": 157,
            "verseString": "Upon them are blessings and mercy from their Lord, and these are the guided ones."
        },
        {
            "verseNumber": 158,
            "verseString": "Safa and Marwa are among the symbols of God. Anyone who performs Hajj to the House or Umrah is not guilty if they circulate between them. Whoever volunteers goodness—God is Appreciative and All-Knowing.",
            "verseStringReplacedWithAllah": "Safa and Marwa are among the symbols of Allah. Anyone who performs Hajj to the House or Umrah is not guilty if they circulate between them. Whoever volunteers goodness—Allah is Appreciative and All-Knowing."
        },
        {
            "verseNumber": 159,
            "verseString": "Those who suppress the clear signs and guidance that We revealed, after We made them clear for people in the Scripture—on them is God’s curse and the curse of those who curse.",
            "verseStringReplacedWithAllah": "Those who suppress the clear signs and guidance that We revealed, after We made them clear for people in the Scripture—on them is Allah’s curse and the curse of those who curse."
        },
        {
            "verseNumber": 160,
            "verseString": "Except for those who repent, reform, and declare. These—I will accept their repentance. I am the Acceptor of Repentance, the Most Merciful."
        },
        {
            "verseNumber": 161,
            "verseString": "Those who disbelieve and die while they are unbelievers are cursed by God, the angels, and all people.",
            "verseStringReplacedWithAllah": "Those who disbelieve and die while they are unbelievers are cursed by Allah, the angels, and all people."
        },
        {
            "verseNumber": 162,
            "verseString": "They will remain under it forever, without relief or reprieve from the punishment."
        },
        {
            "verseNumber": 163,
            "verseString": "Your God is One God. There is no god but He, the Cracious, the Merciful."
        },
        {
            "verseNumber": 164,
            "verseString": "In the creation of the heavens and the earth, the alternation of night and day, the ships that traverse the seas for humanity’s benefit, the rain that God sends down from the skies to revive the earth after its death, the dispersal of all kinds of creatures, the shifting of the winds, and the clouds suspended between the sky and the earth, are signs for people who contemplate.",
            "verseStringReplacedWithAllah": "In the creation of the heavens and the earth, the alternation of night and day, the ships that traverse the seas for humanity’s benefit, the rain that Allah sends down from the skies to revive the earth after its death, the dispersal of all kinds of creatures, the shifting of the winds, and the clouds suspended between the sky and the earth, are signs for people who contemplate."
        },
        {
            "verseNumber": 165,
            "verseString": "Some among the people equate others with God, loving them as the love of God. But those who believe have a greater love for God. If only the wrongdoers could witness the punishment, they would realize that all power belongs to God and that God is severe in penalty.",
            "verseStringReplacedWithAllah": "Some among the people equate others with Allah, loving them as the love of Allah. But those who believe have a greater love for Allah. If only the wrongdoers could witness the punishment, they would realize that all power belongs to Allah and that Allah is severe in penalty."
        },
        {
            "verseNumber": 166,
            "verseString": "When they face the punishment, those who were followed will disown their followers, and all their ties will be severed."
        },
        {
            "verseNumber": 167,
            "verseString": "Those who followed will say, “If only we could return, we would disown them as they’ve disowned us.” Thus, God will show them their actions as a cause for regret, and they won’t escape the Fire.",
            "verseStringReplacedWithAllah": "Those who followed will say, “If only we could return, we would disown them as they’ve disowned us.” Thus, Allah will show them their actions as a cause for regret, and they won’t escape the Fire."
        },
        {
            "verseNumber": 168,
            "verseString": "O people, consume what’s lawful and wholesome on earth, and don’t follow Satan’s footsteps, for he is your declared enemy."
        },
        {
            "verseNumber": 169,
            "verseString": "He commands you to evil and indecency, and to say about God what you don’t know.",
            "verseStringReplacedWithAllah": "He commands you to evil and indecency, and to say about Allah what you don’t know."
        },
        {
            "verseNumber": 170,
            "verseString": "When it is said to them, “Follow what God revealed,” they respond, “We will follow what we found our ancestors following.” Even though their ancestors had no understanding or guidance?",
            "verseStringReplacedWithAllah": "When it is said to them, “Follow what Allah revealed,” they respond, “We will follow what we found our ancestors following.” Even though their ancestors had no understanding or guidance?"
        },
        {
            "verseNumber": 171,
            "verseString": "The likeness of those who disbelieve is that of someone who listens to shouting, without comprehension—deaf, dumb, and blind, they don’t understand."
        },
        {
            "verseNumber": 172,
            "verseString": "O you who believe, eat of the wholesome things We’ve provided you, and give thanks to God, if it’s Him you worship.",
            "verseStringReplacedWithAllah": "O you who believe, eat of the wholesome things We’ve provided you, and give thanks to Allah, if it’s Him you worship."
        },
        {
            "verseNumber": 173,
            "verseString": "He forbade you carrion, blood, pork, and food consecrated to anyone other than God. However, if anyone is compelled by necessity—without desire or transgression—there is no sin upon him. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "He forbade you carrion, blood, pork, and food consecrated to anyone other than Allah. However, if anyone is compelled by necessity—without desire or transgression—there is no sin upon him. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 174,
            "verseString": "Those who conceal what God revealed in the Scripture and exchange it for a trivial gain, those swallow into their bellies nothing but fire. On the Day of Resurrection, God will neither speak to them nor purify them; for them is a painful punishment.",
            "verseStringReplacedWithAllah": "Those who conceal what Allah revealed in the Scripture and exchange it for a trivial gain, those swallow into their bellies nothing but fire. On the Day of Resurrection, Allah will neither speak to them nor purify them; for them is a painful punishment."
        },
        {
            "verseNumber": 175,
            "verseString": "These are the ones who have purchased error at the price of guidance and punishment at the price of forgiveness. How will they withstand the Fire?"
        },
        {
            "verseNumber": 176,
            "verseString": "This is because God revealed the Scripture in truth. Those who dispute the Scripture are in extreme dissent.",
            "verseStringReplacedWithAllah": "This is because Allah revealed the Scripture in truth. Those who dispute the Scripture are in extreme dissent."
        },
        {
            "verseNumber": 177,
            "verseString": "Righteousness is not about turning your faces East or West. Righteousness is believing in God, the Last Day, the angels, the Scripture, and the Prophets; sharing wealth—despite love for it—with relatives, orphans, the needy, the homeless, those who ask; and freeing enslaved people; performing prayers, giving purifying charity, fulfilling promises when made, and enduring through illness, hardship, and times of strife. These are the truthful, and these are the righteous.",
            "verseStringReplacedWithAllah": "Righteousness is not about turning your faces East or West. Righteousness is believing in Allah, the Last Day, the angels, the Scripture, and the Prophets; sharing wealth—despite love for it—with relatives, orphans, the needy, the homeless, those who ask; and freeing enslaved people; performing prayers, giving purifying charity, fulfilling promises when made, and enduring through illness, hardship, and times of strife. These are the truthful, and these are the righteous."
        },
        {
            "verseNumber": 178,
            "verseString": "O you who believe, retribution is prescribed for you in cases of murder: the free for the free, the enslaved for the enslaved, and the female for the female. However, if one is pardoned by his counterpart, grant any reasonable demand and compensate him amicably. This is a leniency and a mercy from your Lord. Whoever transgresses after that will have a severe punishment."
        },
        {
            "verseNumber": 179,
            "verseString": "The principle of retribution serves to preserve life for you, O people of understanding, so you may exercise self-restraint."
        },
        {
            "verseNumber": 180,
            "verseString": "When death approaches any of you, if he leaves behind wealth, the will is a duty upon him, for parents and close relatives, in a fair manner—an obligation upon the righteous."
        },
        {
            "verseNumber": 181,
            "verseString": "If anyone alters it after hearing it, the sin is on those who change it. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "If anyone alters it after hearing it, the sin is on those who change it. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 182,
            "verseString": "If one fears wrongdoing or bias from a testator and mediates peace among them, he does not sin. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "If one fears wrongdoing or bias from a testator and mediates peace among them, he does not sin. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 183,
            "verseString": "O you who believe, fasting has been decreed for you, as it was for those before you, so that you may attain righteousness."
        },
        {
            "verseNumber": 184,
            "verseString": "For a set number of days. However, if any of you is ill or on a journey, then on other days. And upon those who are able—a ransom of feeding a poor person. If you voluntarily do good, it’s better for you. And if you fast, it is better for you, if only you knew."
        },
        {
            "verseNumber": 185,
            "verseString": "Ramadan is the month in which the Quran was revealed, as guidance for humanity, with clear signs of guidance, and the criterion. Whoever among you witnesses the month should fast it. But if anyone is ill or on a journey, then a number of other days. God intends ease for you, not difficulty. So complete the prescribed period, glorify God for guiding you, and express gratitude.",
            "verseStringReplacedWithAllah": "Ramadan is the month in which the Quran was revealed, as guidance for humanity, with clear signs of guidance, and the criterion. Whoever among you witnesses the month should fast it. But if anyone is ill or on a journey, then a number of other days. Allah intends ease for you, not difficulty. So complete the prescribed period, glorify Allah for guiding you, and express gratitude."
        },
        {
            "verseNumber": 186,
            "verseString": "When My servants ask you about Me, I am near, and I respond to the call of the caller when he calls upon Me. So, let them respond to Me and believe in Me, so that they may be guided."
        },
        {
            "verseNumber": 187,
            "verseString": "During the nights of fasting, it is permissible for you to be intimate with your wives. They are a garment for you, and you are a garment for them. God knew that you used to deceive yourselves, so He relented towards you and forgave you. Now, approach them and seek what God ordained for you. Eat and drink until the white thread of dawn becomes distinguishable from the black thread. Then, complete the fast until nightfall. But don’t approach them while you’re in seclusion at the mosques. These are the limits of God, so don’t approach them. Thus God makes clear His ordinances to people, so they may become righteous.",
            "verseStringReplacedWithAllah": "During the nights of fasting, it is permissible for you to be intimate with your wives. They are a garment for you, and you are a garment for them. Allah knew that you used to deceive yourselves, so He relented towards you and forgave you. Now, approach them and seek what Allah ordained for you. Eat and drink until the white thread of dawn becomes distinguishable from the black thread. Then, complete the fast until nightfall. But don’t approach them while you’re in seclusion at the mosques. These are the limits of Allah, so don’t approach them. Thus Allah makes clear His ordinances to people, so they may become righteous."
        },
        {
            "verseNumber": 188,
            "verseString": "Don’t consume each other’s wealth unjustly, nor offer it to the judges in order to wrongfully and knowingly consume a portion of the wealth of others."
        },
        {
            "verseNumber": 189,
            "verseString": "They ask you about the new moons. Say, “They are time markers for people and for the Hajj.” Virtue is not in entering homes from their backs, but virtue is in righteousness. So, enter homes through their doors, and be mindful of God, so you may succeed.",
            "verseStringReplacedWithAllah": "They ask you about the new moons. Say, “They are time markers for people and for the Hajj.” Virtue is not in entering homes from their backs, but virtue is in righteousness. So, enter homes through their doors, and be mindful of Allah, so you may succeed."
        },
        {
            "verseNumber": 190,
            "verseString": "Fight in the path of God those who fight you, but don’t commit aggression. God doesn’t love the aggressors.",
            "verseStringReplacedWithAllah": "Fight in the path of Allah those who fight you, but don’t commit aggression. Allah doesn’t love the aggressors."
        },
        {
            "verseNumber": 191,
            "verseString": "Kill them wherever you overtake them, and expel them from where they expelled you. Persecution is more severe than killing. Don’t fight them at the Sacred Mosque, unless they fight you there. If they fight you, then kill them—such is the penalty for the unbelievers."
        },
        {
            "verseNumber": 192,
            "verseString": "But if they cease, then God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "But if they cease, then Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 193,
            "verseString": "Fight them until there is no more persecution, and religion is solely for God. But if they cease, then there should be no aggression, except against the oppressors.",
            "verseStringReplacedWithAllah": "Fight them until there is no more persecution, and religion is solely for Allah. But if they cease, then there should be no aggression, except against the oppressors."
        },
        {
            "verseNumber": 194,
            "verseString": "The sacred month for the sacred month; any violation of sanctity invites retaliation. Whoever initiates aggression against you, respond in kind. Be mindful of God, and know that God is with the righteous.",
            "verseStringReplacedWithAllah": "The sacred month for the sacred month; any violation of sanctity invites retaliation. Whoever initiates aggression against you, respond in kind. Be mindful of Allah, and know that Allah is with the righteous."
        },
        {
            "verseNumber": 195,
            "verseString": "Spend in the way of God, but don’t throw yourselves into ruin. And do good; indeed, God loves the doers of good.",
            "verseStringReplacedWithAllah": "Spend in the way of Allah, but don’t throw yourselves into ruin. And do good; indeed, Allah loves the doers of good."
        },
        {
            "verseNumber": 196,
            "verseString": "Perform the Hajj and Umrah for God. If you are prevented, then make a feasible offering. Don’t shave your heads until the offering reaches its destination. Whoever among you is ill or has an ailment of the head must offer a ransom of fasting or charity or devotion. During times of peace, those who combine the Umrah and Hajj must make an offering they can afford. If unable, then fasting for three days during Hajj and seven upon your return, totaling ten. This applies to those whose families don’t reside near the Sacred Mosque. Be conscious of God, and know that God is stern in retribution.",
            "verseStringReplacedWithAllah": "Perform the Hajj and Umrah for Allah. If you are prevented, then make a feasible offering. Don’t shave your heads until the offering reaches its destination. Whoever among you is ill or has an ailment of the head must offer a ransom of fasting or charity or devotion. During times of peace, those who combine the Umrah and Hajj must make an offering they can afford. If unable, then fasting for three days during Hajj and seven upon your return, totaling ten. This applies to those whose families don’t reside near the Sacred Mosque. Be conscious of Allah, and know that Allah is stern in retribution."
        },
        {
            "verseNumber": 197,
            "verseString": "The Hajj is during the specified months. Anyone who commits to performing the Hajj must refrain from intimate relations, sinful behavior, and arguments during the Hajj. Whatever good you do, God knows it. Provision yourselves, but the best provision is piety. So fear Me, O people of understanding.",
            "verseStringReplacedWithAllah": "The Hajj is during the specified months. Anyone who commits to performing the Hajj must refrain from intimate relations, sinful behavior, and arguments during the Hajj. Whatever good you do, Allah knows it. Provision yourselves, but the best provision is piety. So fear Me, O people of understanding."
        },
        {
            "verseNumber": 198,
            "verseString": "You incur no sin by seeking the grace of your Lord. When you descend from Arafat, remember God at the Sacred Monument, and remember Him for having guided you, for before this you were astray.",
            "verseStringReplacedWithAllah": "You incur no sin by seeking the grace of your Lord. When you descend from Arafat, remember Allah at the Sacred Monument, and remember Him for having guided you, for before this you were astray."
        },
        {
            "verseNumber": 199,
            "verseString": "Then disperse from where the people disperse, and ask for God’s forgiveness. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "Then disperse from where the people disperse, and ask for Allah’s forgiveness. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 200,
            "verseString": "When you have completed your rites, remember God as you remember your parents, or even more so. Some people say, “Our Lord, give us in this world,” but they will have no share in the Hereafter.",
            "verseStringReplacedWithAllah": "When you have completed your rites, remember Allah as you remember your parents, or even more so. Some people say, “Our Lord, give us in this world,” but they will have no share in the Hereafter."
        },
        {
            "verseNumber": 201,
            "verseString": "Others say, “Our Lord, give us good in this world and good in the Hereafter, and protect us from the suffering of the Fire.”"
        },
        {
            "verseNumber": 202,
            "verseString": "These will have a share of what they’ve earned. God is swift in accounting.",
            "verseStringReplacedWithAllah": "These will have a share of what they’ve earned. Allah is swift in accounting."
        },
        {
            "verseNumber": 203,
            "verseString": "Remember God during the appointed days. If someone is in a hurry to return in two days, there is no sin on him; if someone stays on, there is no sin on him either—provided they maintain righteousness. Be conscious of God, and know you will be gathered to Him.",
            "verseStringReplacedWithAllah": "Remember Allah during the appointed days. If someone is in a hurry to return in two days, there is no sin on him; if someone stays on, there is no sin on him either—provided they maintain righteousness. Be conscious of Allah, and know you will be gathered to Him."
        },
        {
            "verseNumber": 204,
            "verseString": "There is a type of person whose speech in this worldly life may impress you, and he calls God to witness what’s in his heart, yet he is the fiercest of opponents.",
            "verseStringReplacedWithAllah": "There is a type of person whose speech in this worldly life may impress you, and he calls Allah to witness what’s in his heart, yet he is the fiercest of opponents."
        },
        {
            "verseNumber": 205,
            "verseString": "Once he gains power, he aims to wreak havoc on earth and ruin its crops and lineage. God doesn’t like corruption.",
            "verseStringReplacedWithAllah": "Once he gains power, he aims to wreak havoc on earth and ruin its crops and lineage. Allah doesn’t like corruption."
        },
        {
            "verseNumber": 206,
            "verseString": "When told, “Fear God,” pride leads him to further sin. Hell will suffice him—and what a wretched destination.",
            "verseStringReplacedWithAllah": "When told, “Fear Allah,” pride leads him to further sin. Hell will suffice him—and what a wretched destination."
        },
        {
            "verseNumber": 207,
            "verseString": "And there are those who sell themselves seeking approval of God; God is Kind to the servants.",
            "verseStringReplacedWithAllah": "And there are those who sell themselves seeking approval of Allah; Allah is Kind to the servants."
        },
        {
            "verseNumber": 208,
            "verseString": "O you who have believed, enter into submission completely, and don’t follow Satan’s footsteps; he is a clear enemy to you."
        },
        {
            "verseNumber": 209,
            "verseString": "If you relapse after the clear signs have come to you, then know that God is Powerful and Wise.",
            "verseStringReplacedWithAllah": "If you relapse after the clear signs have come to you, then know that Allah is Powerful and Wise."
        },
        {
            "verseNumber": 210,
            "verseString": "Are they awaiting the arrival of God Himself amidst the clouds, escorted by the angels? The matter would have already been resolved by then. All matters ultimately return to God.",
            "verseStringReplacedWithAllah": "Are they awaiting the arrival of Allah Himself amidst the clouds, escorted by the angels? The matter would have already been resolved by then. All matters ultimately return to Allah."
        },
        {
            "verseNumber": 211,
            "verseString": "Ask the Children of Israel how many clear signs We’ve given them. Anyone who substitutes a blessing he has from God—God is stern in retribution.",
            "verseStringReplacedWithAllah": "Ask the Children of Israel how many clear signs We’ve given them. Anyone who substitutes a blessing he has from Allah—Allah is stern in retribution."
        },
        {
            "verseNumber": 212,
            "verseString": "The worldly life is made alluring to those who disbelieve, and they ridicule those who believe. but the righteous will be above them on Resurrection Day. God provides for whom He wills, without measure.",
            "verseStringReplacedWithAllah": "The worldly life is made alluring to those who disbelieve, and they ridicule those who believe. but the righteous will be above them on Resurrection Day. Allah provides for whom He wills, without measure."
        },
        {
            "verseNumber": 213,
            "verseString": "Mankind was a single community, then God sent Messengers with good news and warnings. Alongside them, He revealed the Scripture with the truth, to judge between people in their disputes. It was only after receiving clear proofs that they began to differ, due to mutual envy. By His will, God guided the believers to the truth about which they had disputed. God guides whom He wills onto a straight path.",
            "verseStringReplacedWithAllah": "Mankind was a single community, then Allah sent Messengers with good news and warnings. Alongside them, He revealed the Scripture with the truth, to judge between people in their disputes. It was only after receiving clear proofs that they began to differ, due to mutual envy. By His will, Allah guided the believers to the truth about which they had disputed. Allah guides whom He wills onto a straight path."
        },
        {
            "verseNumber": 214,
            "verseString": "Or do you think you will enter Paradise, without undergoing the trials faced by those before you? They were afflicted with hardship and adversity, and were so shaken up, that the Messenger and those who believed with him said, “When will God’s help come?” Surely, God’s help is near.",
            "verseStringReplacedWithAllah": "Or do you think you will enter Paradise, without undergoing the trials faced by those before you? They were afflicted with hardship and adversity, and were so shaken up, that the Messenger and those who believed with him said, “When will Allah’s help come?” Surely, Allah’s help is near."
        },
        {
            "verseNumber": 215,
            "verseString": "They ask you about what they should spend. Respond, “Whatever you spend should be for parents, relatives, orphans, the poor, and the person on the path. Whatever good you do, God is fully aware of it.”",
            "verseStringReplacedWithAllah": "They ask you about what they should spend. Respond, “Whatever you spend should be for parents, relatives, orphans, the poor, and the person on the path. Whatever good you do, Allah is fully aware of it.”"
        },
        {
            "verseNumber": 216,
            "verseString": "Fighting has been ordained for you, even though you dislike it. It is possible that you dislike something which is good for you, and that you like something which is bad for you. God knows, and you don’t.",
            "verseStringReplacedWithAllah": "Fighting has been ordained for you, even though you dislike it. It is possible that you dislike something which is good for you, and that you like something which is bad for you. Allah knows, and you don’t."
        },
        {
            "verseNumber": 217,
            "verseString": "They ask you about fighting during the Sacred Month. Say, “Fighting during it is a great sin. But to divert from the path of God, and disbelieve in Him, and prevent access to the Sacred Mosque, and expel its inhabitants, is more serious with God. And strife is worse than killing.” They won’t cease fighting you until they make you renounce your faith, if they can. Whoever among you turns back from his religion and dies as a disbeliever, their deeds will come to nothing in this world and the Hereafter. These are the dwellers of the Fire, where they will remain forever.",
            "verseStringReplacedWithAllah": "They ask you about fighting during the Sacred Month. Say, “Fighting during it is a great sin. But to divert from the path of Allah, and disbelieve in Him, and prevent access to the Sacred Mosque, and expel its inhabitants, is more serious with Allah. And strife is worse than killing.” They won’t cease fighting you until they make you renounce your faith, if they can. Whoever among you turns back from his religion and dies as a disbeliever, their deeds will come to nothing in this world and the Hereafter. These are the dwellers of the Fire, where they will remain forever."
        },
        {
            "verseNumber": 218,
            "verseString": "However, those who have faith, emigrate and strive in God’s path can hope for God’s mercy. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "However, those who have faith, emigrate and strive in Allah’s path can hope for Allah’s mercy. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 219,
            "verseString": "They ask you about wine and gambling. Say, “In both is great sin as well as some benefits for people. But their sin outweighs their benefits.” They ask you what they should spend. Say, “The excess.” Thus, God makes His verses clear to you, so that you may reflect.",
            "verseStringReplacedWithAllah": "They ask you about wine and gambling. Say, “In both is great sin as well as some benefits for people. But their sin outweighs their benefits.” They ask you what they should spend. Say, “The excess.” Thus, Allah makes His verses clear to you, so that you may reflect."
        },
        {
            "verseNumber": 220,
            "verseString": "Concerning this world and the Hereafter. They ask you about orphans. Say, “Acting in their best interests is good. But if you mix with them, consider them your brothers.” God knows the corruptor from the reformer. Had God willed, He could’ve imposed hardship on you. God is Mighty and Wise.",
            "verseStringReplacedWithAllah": "Concerning this world and the Hereafter. They ask you about orphans. Say, “Acting in their best interests is good. But if you mix with them, consider them your brothers.” Allah knows the corruptor from the reformer. Had Allah willed, He could’ve imposed hardship on you. Allah is Mighty and Wise."
        },
        {
            "verseNumber": 221,
            "verseString": "Don’t marry polytheistic women until they believe. A believing maid is better than a polytheist, even if she appeals to you. Likewise, don’t marry polytheistic men until they believe. A believing servant is better than a polytheist, even if he appeals to you. These invite to the Fire, while God invites to Paradise and to forgiveness, by His leave. He makes His verses clear for people, so they may reflect.",
            "verseStringReplacedWithAllah": "Don’t marry polytheistic women until they believe. A believing maid is better than a polytheist, even if she appeals to you. Likewise, don’t marry polytheistic men until they believe. A believing servant is better than a polytheist, even if he appeals to you. These invite to the Fire, while Allah invites to Paradise and to forgiveness, by His leave. He makes His verses clear for people, so they may reflect."
        },
        {
            "verseNumber": 222,
            "verseString": "They ask you about menstruation. Respond, “It is harmful; so keep away from women during menstruation, and don’t approach them until they are pure. Once they are pure, approach them as God has directed you.” God loves those who repent and those who purify themselves.",
            "verseStringReplacedWithAllah": "They ask you about menstruation. Respond, “It is harmful; so keep away from women during menstruation, and don’t approach them until they are pure. Once they are pure, approach them as Allah has directed you.” Allah loves those who repent and those who purify themselves."
        },
        {
            "verseNumber": 223,
            "verseString": "Your wives are your culture, so approach your culture as you desire. Prepare for yourselves, fear God, and know you will encounter Him. Give good news to the believers.",
            "verseStringReplacedWithAllah": "Your wives are your culture, so approach your culture as you desire. Prepare for yourselves, fear Allah, and know you will encounter Him. Give good news to the believers."
        },
        {
            "verseNumber": 224,
            "verseString": "And don’t make God, because of your oaths, an obstruction preventing you from doing good and acting rightly and making peace among people. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "And don’t make Allah, because of your oaths, an obstruction preventing you from doing good and acting rightly and making peace among people. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 225,
            "verseString": "God won’t hold you accountable for unintentional oaths, but He will hold you responsible for what your hearts intend. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "Allah won’t hold you accountable for unintentional oaths, but He will hold you responsible for what your hearts intend. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 226,
            "verseString": "Those who vow to abstain from their wives have a waiting period of four months. If they reconcile, then indeed, God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "Those who vow to abstain from their wives have a waiting period of four months. If they reconcile, then indeed, Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 227,
            "verseString": "If they are resolved for divorce—God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "If they are resolved for divorce—Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 228,
            "verseString": "Divorced women should wait by themselves for three cycles. It’s not permissible for them to hide what God has created in their wombs—if they believe in God and the Last Day. Their husbands have more right to take them back, if they desire reconciliation. Women have rights similar to their obligations, according to what’s fair, but men have a degree over them. God is Mighty and Wise.",
            "verseStringReplacedWithAllah": "Divorced women should wait by themselves for three cycles. It’s not permissible for them to hide what Allah has created in their wombs—if they believe in Allah and the Last Day. Their husbands have more right to take them back, if they desire reconciliation. Women have rights similar to their obligations, according to what’s fair, but men have a degree over them. Allah is Mighty and Wise."
        },
        {
            "verseNumber": 229,
            "verseString": "Divorce is twice. Either retain them with kindness or release them in a good manner. It’s not lawful for you to take back what you’ve given them, unless both fear they can’t uphold God’s limits. If you fear they can’t uphold God’s limits, they are not blamed for reaching a mutual agreement. These are God’s boundaries, so don’t overstep them. Those who overstep God’s boundaries are the wrongdoers.",
            "verseStringReplacedWithAllah": "Divorce is twice. Either retain them with kindness or release them in a good manner. It’s not lawful for you to take back what you’ve given them, unless both fear they can’t uphold Allah’s limits. If you fear they can’t uphold Allah’s limits, they are not blamed for reaching a mutual agreement. These are Allah’s boundaries, so don’t overstep them. Those who overstep Allah’s boundaries are the wrongdoers."
        },
        {
            "verseNumber": 230,
            "verseString": "If he divorces her, she’s not lawful for him until she marries a husband other than him. If he divorces her, there is no fault in them for returning, if they think they can maintain the boundaries set by God. These are God’s limits, which He makes clear for those who know.",
            "verseStringReplacedWithAllah": "If he divorces her, she’s not lawful for him until she marries a husband other than him. If he divorces her, there is no fault in them for returning, if they think they can maintain the boundaries set by Allah. These are Allah’s limits, which He makes clear for those who know."
        },
        {
            "verseNumber": 231,
            "verseString": "When you divorce women, and they reach their term, either retain them with kindness or part with them with dignity. Don’t retain them to cause harm or to transgress. Whoever does so wrongs his soul. Don’t make a mockery of God’s revelations, and remember God’s favor upon you, and the Scripture and wisdom He revealed to instruct you. Be conscious of God, and know that God is aware of everything.",
            "verseStringReplacedWithAllah": "When you divorce women, and they reach their term, either retain them with kindness or part with them with dignity. Don’t retain them to cause harm or to transgress. Whoever does so wrongs his soul. Don’t make a mockery of Allah’s revelations, and remember Allah’s favor upon you, and the Scripture and wisdom He revealed to instruct you. Be conscious of Allah, and know that Allah is aware of everything."
        },
        {
            "verseNumber": 232,
            "verseString": "When you divorce women, and they fulfill their terms, don’t prevent them from remarrying if they agree on reasonable terms. This advice is for those who believe in God and the Last Day. This is purer and more honorable for you. God knows, while you don’t.",
            "verseStringReplacedWithAllah": "When you divorce women, and they fulfill their terms, don’t prevent them from remarrying if they agree on reasonable terms. This advice is for those who believe in Allah and the Last Day. This is purer and more honorable for you. Allah knows, while you don’t."
        },
        {
            "verseNumber": 233,
            "verseString": "Mothers should nurse their children for two complete years if they wish to complete the nursing period. The father must provide sustenance and clothing for them in a reasonable manner. No soul should be burdened beyond its capacity. Neither mother nor father should suffer due to their child. The same duty rests upon the heir. If both parents decide to wean by mutual consent and consultation, there is no blame upon them. You are not at fault for hiring wet nurses, provided you pay them fairly. Fear God, and know that God sees all that you do.",
            "verseStringReplacedWithAllah": "Mothers should nurse their children for two complete years if they wish to complete the nursing period. The father must provide sustenance and clothing for them in a reasonable manner. No soul should be burdened beyond its capacity. Neither mother nor father should suffer due to their child. The same duty rests upon the heir. If both parents decide to wean by mutual consent and consultation, there is no blame upon them. You are not at fault for hiring wet nurses, provided you pay them fairly. Fear Allah, and know that Allah sees all that you do."
        },
        {
            "verseNumber": 234,
            "verseString": "Those of you who pass away and leave wives, they should wait alone for four months and ten days. Once they have completed their term, you bear no responsibility for their reasonable decisions. God is fully aware of what you do.",
            "verseStringReplacedWithAllah": "Those of you who pass away and leave wives, they should wait alone for four months and ten days. Once they have completed their term, you bear no responsibility for their reasonable decisions. Allah is fully aware of what you do."
        },
        {
            "verseNumber": 235,
            "verseString": "You commit no error by announcing your engagement to the women, or keeping it secret. God knows that you will eventually propose to them. However, don’t meet them secretly unless you have a legitimate matter to discuss. Don’t finalize the marriage until the writing is fulfilled. Be aware that God knows what’s in your hearts, so be cautious of Him, and know that God is Most Forgiving, Most Forbearing.",
            "verseStringReplacedWithAllah": "You commit no error by announcing your engagement to the women, or keeping it secret. Allah knows that you will eventually propose to them. However, don’t meet them secretly unless you have a legitimate matter to discuss. Don’t finalize the marriage until the writing is fulfilled. Be aware that Allah knows what’s in your hearts, so be cautious of Him, and know that Allah is Most Forgiving, Most Forbearing."
        },
        {
            "verseNumber": 236,
            "verseString": "There is no blame on you for divorcing women before you have touched them or specified a dowry for them. Nevertheless, give them a provision—the wealthy according to his means and the poor according to his—this is a duty upon the virtuous."
        },
        {
            "verseNumber": 237,
            "verseString": "If you divorce them before touching them, but after specifying a dowry for them, then give them half of what you specified, unless they waive it or the one who holds the marriage contract waives it. To waive is closer to righteousness. Don’t forget to treat each other with kindness. God sees all that you do.",
            "verseStringReplacedWithAllah": "If you divorce them before touching them, but after specifying a dowry for them, then give them half of what you specified, unless they waive it or the one who holds the marriage contract waives it. To waive is closer to righteousness. Don’t forget to treat each other with kindness. Allah sees all that you do."
        },
        {
            "verseNumber": 238,
            "verseString": "Guard your prayers, and the middle prayer, and stand before God in devotion.",
            "verseStringReplacedWithAllah": "Guard your prayers, and the middle prayer, and stand before Allah in devotion."
        },
        {
            "verseNumber": 239,
            "verseString": "If you’re in fear, then on foot or riding. But when you’re secure, remember God, as He taught you what you didn’t previously know.",
            "verseStringReplacedWithAllah": "If you’re in fear, then on foot or riding. But when you’re secure, remember Allah, as He taught you what you didn’t previously know."
        },
        {
            "verseNumber": 240,
            "verseString": "Those of you who die and leave behind wives should leave a will providing one year’s maintenance without forcing them to leave. However, if they choose to leave, there is no blame on you for what they decide for themselves. God is All-Powerful, All-Wise.",
            "verseStringReplacedWithAllah": "Those of you who die and leave behind wives should leave a will providing one year’s maintenance without forcing them to leave. However, if they choose to leave, there is no blame on you for what they decide for themselves. Allah is All-Powerful, All-Wise."
        },
        {
            "verseNumber": 241,
            "verseString": "Divorced women should receive sustenance according to what’s fair—an obligation on the righteous."
        },
        {
            "verseNumber": 242,
            "verseString": "Thus does God clarify His verses for you, so you may use your reason.",
            "verseStringReplacedWithAllah": "Thus does Allah clarify His verses for you, so you may use your reason."
        },
        {
            "verseNumber": 243,
            "verseString": "Didn’t you consider those who fled their homes in the thousands, fearing death? God said to them, “Die,” and then He revived them. God is full of grace towards people, but most people are not appreciative.",
            "verseStringReplacedWithAllah": "Didn’t you consider those who fled their homes in the thousands, fearing death? Allah said to them, “Die,” and then He revived them. Allah is full of grace towards people, but most people are not appreciative."
        },
        {
            "verseNumber": 244,
            "verseString": "Fight in the cause of God, and know that God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "Fight in the cause of Allah, and know that Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 245,
            "verseString": "Who will offer God a loan of righteousness, which He will multiply for him manifold? God constricts and expands, and to Him, you will be returned.",
            "verseStringReplacedWithAllah": "Who will offer Allah a loan of righteousness, which He will multiply for him manifold? Allah constricts and expands, and to Him, you will be returned."
        },
        {
            "verseNumber": 246,
            "verseString": "Didn’t you consider the leaders of the Children of Israel after Moses? When they said to a prophet of theirs, “Appoint for us a king, and we will fight in God’s path.” He questioned, “Would you perhaps refrain from fighting if it were prescribed for you?” They replied, “Why wouldn’t we fight in God’s path, when we were expelled from our homes and separated from our children?” However, when fighting was prescribed for them, they turned away, all except a few of them. And God is fully aware of the unjust.",
            "verseStringReplacedWithAllah": "Didn’t you consider the leaders of the Children of Israel after Moses? When they said to a prophet of theirs, “Appoint for us a king, and we will fight in Allah’s path.” He questioned, “Would you perhaps refrain from fighting if it were prescribed for you?” They replied, “Why wouldn’t we fight in Allah’s path, when we were expelled from our homes and separated from our children?” However, when fighting was prescribed for them, they turned away, all except a few of them. And Allah is fully aware of the unjust."
        },
        {
            "verseNumber": 247,
            "verseString": "Their prophet told them, “God appointed Saul as a king.” They objected, “How can he have authority over us, when we’re more deserving of authority than he, and he wasn’t given ample wealth?” He replied, “God chose him over you and increased him abundantly in knowledge and physique.” And God gives His kingship to whom He wills. And God is Boundless, All-Knowing.”",
            "verseStringReplacedWithAllah": "Their prophet told them, “Allah appointed Saul as a king.” They objected, “How can he have authority over us, when we’re more deserving of authority than he, and he wasn’t given ample wealth?” He replied, “Allah chose him over you and increased him abundantly in knowledge and physique.” And Allah gives His kingship to whom He wills. And Allah is Boundless, All-Knowing.”"
        },
        {
            "verseNumber": 248,
            "verseString": "Their prophet further told them, “The sign of his kingship is the restoration of the Ark to you, containing reassurance from your Lord, and legacy of the family of Moses and the family of Aaron, carried by the angels. In this lies a sign for you, if you are believers.”"
        },
        {
            "verseNumber": 249,
            "verseString": "When Saul set out with the troops, he said, “God will test you with a river. Whoever drinks from it isn’t of me, and whoever doesn’t drink from it is of me, except for one who sips a handful with his hand.” Yet, they drank from it, except a few of them. When he and the faithful with him crossed it, they said, “We have no power today against Goliath and his warriors.” However, those sure that they would meet God said, “How often did a small group overcome a large group with God’s permission? God is with the patient.”",
            "verseStringReplacedWithAllah": "When Saul set out with the troops, he said, “Allah will test you with a river. Whoever drinks from it isn’t of me, and whoever doesn’t drink from it is of me, except for one who sips a handful with his hand.” Yet, they drank from it, except a few of them. When he and the faithful with him crossed it, they said, “We have no power today against Goliath and his warriors.” However, those sure that they would meet Allah said, “How often did a small group overcome a large group with Allah’s permission? Allah is with the patient.”"
        },
        {
            "verseNumber": 250,
            "verseString": "And when they confronted Goliath and his warriors, they prayed, “Our Lord, fill us with patience, strengthen our foothold, and help us against the disbelieving people.”"
        },
        {
            "verseNumber": 251,
            "verseString": "With God’s permission, they defeated them. David killed Goliath, God gave him kingship and wisdom, and He taught him what He willed. If God didn’t repel some people through others, the earth would be corrupted. God is gracious to all the world.",
            "verseStringReplacedWithAllah": "With Allah’s permission, they defeated them. David killed Goliath, Allah gave him kingship and wisdom, and He taught him what He willed. If Allah didn’t repel some people through others, the earth would be corrupted. Allah is gracious to all the world."
        },
        {
            "verseNumber": 252,
            "verseString": "These are God’s verses, which We convey to you in truth. Surely, you are one of the messengers.",
            "verseStringReplacedWithAllah": "These are Allah’s verses, which We convey to you in truth. Surely, you are one of the messengers."
        },
        {
            "verseNumber": 253,
            "verseString": "Among the messengers, We favored some over others. To some, God spoke directly, while others, He raised high in degrees. We gave Jesus, the son of Mary, clear miracles, and We supported him with the Holy Spirit. Had God willed, those after them wouldn’t have fought each other, after the clear signs had come to them. Yet they differed; some of them believed, while others disbelieved. Had God willed, they wouldn’t have fought, but God does what He wills.",
            "verseStringReplacedWithAllah": "Among the messengers, We favored some over others. To some, Allah spoke directly, while others, He raised high in degrees. We gave Jesus, the son of Mary, clear miracles, and We supported him with the Holy Spirit. Had Allah willed, those after them wouldn’t have fought each other, after the clear signs had come to them. Yet they differed; some of them believed, while others disbelieved. Had Allah willed, they wouldn’t have fought, but Allah does what He wills."
        },
        {
            "verseNumber": 254,
            "verseString": "O you who believe, spend from what We provided for you before a Day arrives when there is no trading, friendship, or intercession. The unbelievers are the unjust."
        },
        {
            "verseNumber": 255,
            "verseString": "God—there is no god except Him, the Ever-Living, the Sustainer of all existence. Neither drowsiness overtakes Him, nor sleep. To Him belongs everything in the heavens and the earth. Who can intercede with Him, except with His permission? He knows what lies before and behind them. They can only grasp a portion of His knowledge that He permits. His throne extends over the heavens and the earth, and their preservation tires Him not. He is the Most High, the Supreme.",
            "verseStringReplacedWithAllah": "Allah—there is no god except Him, the Ever-Living, the Sustainer of all existence. Neither drowsiness overtakes Him, nor sleep. To Him belongs everything in the heavens and the earth. Who can intercede with Him, except with His permission? He knows what lies before and behind them. They can only grasp a portion of His knowledge that He permits. His throne extends over the heavens and the earth, and their preservation tires Him not. He is the Most High, the Supreme."
        },
        {
            "verseNumber": 256,
            "verseString": "There is no coercion in matters of faith; the right way has become distinct from the erroneous one. Whoever rejects evil and believes in God has grasped the firmest handhold, which never breaks. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "There is no coercion in matters of faith; the right way has become distinct from the erroneous one. Whoever rejects evil and believes in Allah has grasped the firmest handhold, which never breaks. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 257,
            "verseString": "God is the ally of those who believe, He guides them from darkness into light. However, those who disbelieve have the oppressors as their allies, they lead them from light into darkness. These are the inhabitants of the Fire, where they will remain eternally.",
            "verseStringReplacedWithAllah": "Allah is the ally of those who believe, He guides them from darkness into light. However, those who disbelieve have the oppressors as their allies, they lead them from light into darkness. These are the inhabitants of the Fire, where they will remain eternally."
        },
        {
            "verseNumber": 258,
            "verseString": "Haven’t you considered him who argued with Abraham about his Lord, simply because God had given him authority. Abraham said, “My Lord gives life and causes death.” He replied, “I give life and cause death.” Abraham countered, “God brings the sun from the east; now bring it from the west.” The disbeliever was confounded. God does not guide the wrongdoing people.",
            "verseStringReplacedWithAllah": "Haven’t you considered him who argued with Abraham about his Lord, simply because Allah had given him authority. Abraham said, “My Lord gives life and causes death.” He replied, “I give life and cause death.” Abraham countered, “Allah brings the sun from the east; now bring it from the west.” The disbeliever was confounded. Allah does not guide the wrongdoing people."
        },
        {
            "verseNumber": 259,
            "verseString": "Consider the man who came upon a ruined village and wondered, “How can God revive this after its death?” Then God caused him to die for a century and then resurrected him. He asked, “How long did you remain?” He replied, “I remained for a day or part of a day.” He said, “No, you remained for a hundred years. Look at your food and drink; they haven’t spoiled. And look at your donkey. We will make you a sign for people. Look at the bones, how We reconstruct them and then clothe them with flesh.” When it was made clear to him, he said, “I know that God is capable of everything.”",
            "verseStringReplacedWithAllah": "Consider the man who came upon a ruined village and wondered, “How can Allah revive this after its death?” Then Allah caused him to die for a century and then resurrected him. He asked, “How long did you remain?” He replied, “I remained for a day or part of a day.” He said, “No, you remained for a hundred years. Look at your food and drink; they haven’t spoiled. And look at your donkey. We will make you a sign for people. Look at the bones, how We reconstruct them and then clothe them with flesh.” When it was made clear to him, he said, “I know that Allah is capable of everything.”"
        },
        {
            "verseNumber": 260,
            "verseString": "When Abraham asked, “My Lord, show me how You bring the dead to life,” He replied, “Didn’t you believe?” He responded, “Yes, but just to reassure my heart.” He instructed, “Take four birds, train them to come to you, then place a portion of them on each hill, then call them—they will come to you swiftly. And know that God is Mighty and Wise.”",
            "verseStringReplacedWithAllah": "When Abraham asked, “My Lord, show me how You bring the dead to life,” He replied, “Didn’t you believe?” He responded, “Yes, but just to reassure my heart.” He instructed, “Take four birds, train them to come to you, then place a portion of them on each hill, then call them—they will come to you swiftly. And know that Allah is Mighty and Wise.”"
        },
        {
            "verseNumber": 261,
            "verseString": "The likeness of those who spend their wealth in God’s path is like a seed that sprouts seven spikes, in each spike is a hundred grains. God multiplies to whom He wills. God is All-Encompassing, All-Knowing.",
            "verseStringReplacedWithAllah": "The likeness of those who spend their wealth in Allah’s path is like a seed that sprouts seven spikes, in each spike is a hundred grains. Allah multiplies to whom He wills. Allah is All-Encompassing, All-Knowing."
        },
        {
            "verseNumber": 262,
            "verseString": "Those who spend their wealth in God’s way, and don’t follow their gifts with reminders or with harm, will have their reward with their Lord. They shall not fear, nor shall they grieve.",
            "verseStringReplacedWithAllah": "Those who spend their wealth in Allah’s way, and don’t follow their gifts with reminders or with harm, will have their reward with their Lord. They shall not fear, nor shall they grieve."
        },
        {
            "verseNumber": 263,
            "verseString": "Kind words and forgiveness are better than charity followed by harm. God is Rich, Forbearing.",
            "verseStringReplacedWithAllah": "Kind words and forgiveness are better than charity followed by harm. Allah is Rich, Forbearing."
        },
        {
            "verseNumber": 264,
            "verseString": "O you who believe, don’t invalidate your charitable deeds with reminders or harm, like the one who spends his wealth to be seen by people, and doesn’t believe in God or the Last Day. His example is like a hard, barren rock covered with dust; a downpour strikes it and leaves it bare. They gain nothing from their efforts. God does not guide the disbelieving people.",
            "verseStringReplacedWithAllah": "O you who believe, don’t invalidate your charitable deeds with reminders or harm, like the one who spends his wealth to be seen by people, and doesn’t believe in Allah or the Last Day. His example is like a hard, barren rock covered with dust; a downpour strikes it and leaves it bare. They gain nothing from their efforts. Allah does not guide the disbelieving people."
        },
        {
            "verseNumber": 265,
            "verseString": "Those who spend their wealth seeking God’s approval, and out of self-affirmation, are like a garden on a height. When heavy rain falls on it, it doubles its yield. If no heavy rain falls, a drizzle suffices. God sees all that you do.",
            "verseStringReplacedWithAllah": "Those who spend their wealth seeking Allah’s approval, and out of self-affirmation, are like a garden on a height. When heavy rain falls on it, it doubles its yield. If no heavy rain falls, a drizzle suffices. Allah sees all that you do."
        },
        {
            "verseNumber": 266,
            "verseString": "Would any of you wish to have a garden of date palms and vines, with rivers flowing through it, and all kinds of fruits for him therein, while he is stricken with old age, and has weak children, and a whirlwind carrying fire strikes it, and it burns? Thus, God clarifies His lessons to you—so you may reflect.",
            "verseStringReplacedWithAllah": "Would any of you wish to have a garden of date palms and vines, with rivers flowing through it, and all kinds of fruits for him therein, while he is stricken with old age, and has weak children, and a whirlwind carrying fire strikes it, and it burns? Thus, Allah clarifies His lessons to you—so you may reflect."
        },
        {
            "verseNumber": 267,
            "verseString": "O you who believe, spend from the good things you’ve earned, and from what We’ve produced for you from the earth. Don’t aim to give the worst of it, the things you yourselves would only accept with closed eyes. And know that God is Self-Sufficient and Praiseworthy.",
            "verseStringReplacedWithAllah": "O you who believe, spend from the good things you’ve earned, and from what We’ve produced for you from the earth. Don’t aim to give the worst of it, the things you yourselves would only accept with closed eyes. And know that Allah is Self-Sufficient and Praiseworthy."
        },
        {
            "verseNumber": 268,
            "verseString": "Satan threatens you with poverty and orders you to commit indecent acts, while God promises you forgiveness from Him and bounty. God is All-Encompassing, All-Knowing.",
            "verseStringReplacedWithAllah": "Satan threatens you with poverty and orders you to commit indecent acts, while Allah promises you forgiveness from Him and bounty. Allah is All-Encompassing, All-Knowing."
        },
        {
            "verseNumber": 269,
            "verseString": "He grants wisdom to whom He wills, and whoever has been given wisdom has been given much good. Yet none will remember except those of understanding."
        },
        {
            "verseNumber": 270,
            "verseString": "Whatever charity you give or vow you make, God knows it well. The wrongdoers will have no helpers.",
            "verseStringReplacedWithAllah": "Whatever charity you give or vow you make, Allah knows it well. The wrongdoers will have no helpers."
        },
        {
            "verseNumber": 271,
            "verseString": "It is good if you disclose your charitable expenditures, but if you conceal them and give them to the poor, it’s better for you and will erase some of your misdeeds. God is fully aware of what you do.",
            "verseStringReplacedWithAllah": "It is good if you disclose your charitable expenditures, but if you conceal them and give them to the poor, it’s better for you and will erase some of your misdeeds. Allah is fully aware of what you do."
        },
        {
            "verseNumber": 272,
            "verseString": "Their guidance isn’t your responsibility, but God guides whom He wills. What you spend of good is for yourselves. All acts of charity should be done seeking God’s favor. Whatever good you give will be returned to you in full, and you won’t be wronged.",
            "verseStringReplacedWithAllah": "Their guidance isn’t your responsibility, but Allah guides whom He wills. What you spend of good is for yourselves. All acts of charity should be done seeking Allah’s favor. Whatever good you give will be returned to you in full, and you won’t be wronged."
        },
        {
            "verseNumber": 273,
            "verseString": "For the poor who are restrained in God’s path, unable to work in the land. The ignorant person thinks, because of their modesty, that they are free from want. You can identify them by their marks. They don’t ask people persistently. Whatever good you give, God is fully aware of it.",
            "verseStringReplacedWithAllah": "For the poor who are restrained in Allah’s path, unable to work in the land. The ignorant person thinks, because of their modesty, that they are free from want. You can identify them by their marks. They don’t ask people persistently. Whatever good you give, Allah is fully aware of it."
        },
        {
            "verseNumber": 274,
            "verseString": "Those who spend their wealth, night and day, secretly and publicly, will have their reward with their Lord. They will neither fear nor grieve."
        },
        {
            "verseNumber": 275,
            "verseString": "Those who consume usury won’t rise, except as one whom Satan has driven to madness by his touch. This is because they say, “Commerce is just like usury.” However, God permitted commerce and prohibited usury. Whoever abstains after receiving a warning from his Lord, may keep his past earnings, and his case rests with God. However, those who persist are the residents of the Fire, where they will remain forever.",
            "verseStringReplacedWithAllah": "Those who consume usury won’t rise, except as one whom Satan has driven to madness by his touch. This is because they say, “Commerce is just like usury.” However, Allah permitted commerce and prohibited usury. Whoever abstains after receiving a warning from his Lord, may keep his past earnings, and his case rests with Allah. However, those who persist are the residents of the Fire, where they will remain forever."
        },
        {
            "verseNumber": 276,
            "verseString": "God wipes out usury and nurtures charitable deeds. God doesn’t love every ungrateful sinner.",
            "verseStringReplacedWithAllah": "Allah wipes out usury and nurtures charitable deeds. Allah doesn’t love every ungrateful sinner."
        },
        {
            "verseNumber": 277,
            "verseString": "Those who believe, perform good deeds, establish prayer, and give charity, their reward is with their Lord. They will neither fear nor grieve."
        },
        {
            "verseNumber": 278,
            "verseString": "O you who believe, fear God and give up what remains of usury, if you are believers.",
            "verseStringReplacedWithAllah": "O you who believe, fear Allah and give up what remains of usury, if you are believers."
        },
        {
            "verseNumber": 279,
            "verseString": "If you don’t, then take notice of a war from God and His Messenger. But if you repent, you may keep your principal. You won’t be wronged, and you won’t wrong.",
            "verseStringReplacedWithAllah": "If you don’t, then take notice of a war from Allah and His Messenger. But if you repent, you may keep your principal. You won’t be wronged, and you won’t wrong."
        },
        {
            "verseNumber": 280,
            "verseString": "If he is in difficulty, then grant a postponement until a time of ease. But if you waive it as charity, it would be better for you—if only you knew."
        },
        {
            "verseNumber": 281,
            "verseString": "Beware of the Day when you will be returned to God, then every soul will be compensated what it has earned, and they won’t be treated unjustly.",
            "verseStringReplacedWithAllah": "Beware of the Day when you will be returned to Allah, then every soul will be compensated what it has earned, and they won’t be treated unjustly."
        },
        {
            "verseNumber": 282,
            "verseString": "O you who believe, when you contract a debt for a fixed term, put it in writing. Let a scribe write it down justly. No scribe should refuse to write as God has taught him. He should write, and it should be dictated, fearing God, his Lord, and not diminish anything from it. If the debtor is intellectually incapable, weak, or unable to dictate, then his guardian should dictate with fairness. Call upon two witnesses from among your men, and if two men are not available, then a man and two women acceptable to you as witnesses, so that if one of them errs, the other can remind her. Witnesses shouldn’t refuse when called upon. Don’t deem it insignificant to write it down, whether small or large, along with its due date. This is more just in the sight of God, provides stronger evidence, and is more likely to prevent doubts, unless it’s an immediate transaction conducted between you, in which case, there is no blame on you for not recording it. However, do ensure witnesses are present whenever you perform a trading transaction. Neither scribe nor witness should be harmed. If you do so, it would be a transgression on your part. So fear God, for it is God who educates you. God has full knowledge of everything.",
            "verseStringReplacedWithAllah": "O you who believe, when you contract a debt for a fixed term, put it in writing. Let a scribe write it down justly. No scribe should refuse to write as Allah has taught him. He should write, and it should be dictated, fearing Allah, his Lord, and not diminish anything from it. If the debtor is intellectually incapable, weak, or unable to dictate, then his guardian should dictate with fairness. Call upon two witnesses from among your men, and if two men are not available, then a man and two women acceptable to you as witnesses, so that if one of them errs, the other can remind her. Witnesses shouldn’t refuse when called upon. Don’t deem it insignificant to write it down, whether small or large, along with its due date. This is more just in the sight of Allah, provides stronger evidence, and is more likely to prevent doubts, unless it’s an immediate transaction conducted between you, in which case, there is no blame on you for not recording it. However, do ensure witnesses are present whenever you perform a trading transaction. Neither scribe nor witness should be harmed. If you do so, it would be a transgression on your part. So fear Allah, for it is Allah who educates you. Allah has full knowledge of everything."
        },
        {
            "verseNumber": 283,
            "verseString": "If you are traveling and can’t find a scribe, a security deposit should be received. If you trust one another, let the one entrusted fulfill his trust, and let him fear God, his Lord. Don’t conceal the testimony, for whoever conceals it, his heart is sinful. God is fully aware of what you do.",
            "verseStringReplacedWithAllah": "If you are traveling and can’t find a scribe, a security deposit should be received. If you trust one another, let the one entrusted fulfill his trust, and let him fear Allah, his Lord. Don’t conceal the testimony, for whoever conceals it, his heart is sinful. Allah is fully aware of what you do."
        },
        {
            "verseNumber": 284,
            "verseString": "Everything that exists in the heavens and the earth belongs to God. Whether you disclose what’s within yourselves, or conceal it, God will call you to account for it. He forgives whom He wills and punishes whom He wills. God is capable of all things.",
            "verseStringReplacedWithAllah": "Everything that exists in the heavens and the earth belongs to Allah. Whether you disclose what’s within yourselves, or conceal it, Allah will call you to account for it. He forgives whom He wills and punishes whom He wills. Allah is capable of all things."
        },
        {
            "verseNumber": 285,
            "verseString": "The Messenger has believed in what was revealed to him from his Lord, and so have the believers. All of them believe in God, His angels, His scriptures, and His messengers: “We make no distinction between any of His messengers.” And they say, “We listen, and we obey. Your forgiveness, our Lord, and to You is the final destination.”",
            "verseStringReplacedWithAllah": "The Messenger has believed in what was revealed to him from his Lord, and so have the believers. All of them believe in Allah, His angels, His scriptures, and His messengers: “We make no distinction between any of His messengers.” And they say, “We listen, and we obey. Your forgiveness, our Lord, and to You is the final destination.”"
        },
        {
            "verseNumber": 286,
            "verseString": "God does not burden any soul beyond its capacity. It will reap the benefits of what it earns, and bear the consequences of its misdeeds. “Our Lord, don’t hold us accountable if we forget or make mistakes. Our Lord, don’t burden us as You’ve burdened those before us. Our Lord, don’t burden us with more than we have strength for. Pardon us, forgive us, and have mercy on us. You are our Master, so help us over the disbelieving people.”",
            "verseStringReplacedWithAllah": "Allah does not burden any soul beyond its capacity. It will reap the benefits of what it earns, and bear the consequences of its misdeeds. “Our Lord, don’t hold us accountable if we forget or make mistakes. Our Lord, don’t burden us as You’ve burdened those before us. Our Lord, don’t burden us with more than we have strength for. Pardon us, forgive us, and have mercy on us. You are our Master, so help us over the disbelieving people.”"
        }
    ],
    "chapterNumber": 2,
    "nameInEnglish": "The Cow",
    "nameInTransliteration": "Al Baqarah",
    "nameInArabic": "البقرة",
    "numberOfVerses": 286
}