{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Everything in the heavens and the earth glorifies God. Sovereignty is His, and to Him praise is due, and He is capable of all things.",
            "verseStringReplacedWithAllah": "Everything in the heavens and the earth glorifies Allah. Sovereignty is His, and to Him praise is due, and He is capable of all things."
        },
        {
            "verseNumber": 2,
            "verseString": "It is He who created you; among you are disbelievers, and among you are believers. God sees all that you do.",
            "verseStringReplacedWithAllah": "It is He who created you; among you are disbelievers, and among you are believers. Allah sees all that you do."
        },
        {
            "verseNumber": 3,
            "verseString": "He created the heavens and the earth with truth. And He designed you, and He perfected your shapes. To Him is the final return."
        },
        {
            "verseNumber": 4,
            "verseString": "He knows everything in the heavens and the earth, and He knows what you conceal and declare. And God knows what’s in the hearts.",
            "verseStringReplacedWithAllah": "He knows everything in the heavens and the earth, and He knows what you conceal and declare. And Allah knows what’s in the hearts."
        },
        {
            "verseNumber": 5,
            "verseString": "Didn’t the stories of those who disbelieved before you reach you? They tasted the affliction of their actions; for them awaits a painful punishment."
        },
        {
            "verseNumber": 6,
            "verseString": "This is because their messengers came to them with clear signs, but they said, “Are humans to guide us?” So, they disbelieved and turned away. Yet God is Self-Sufficient, Worthy of all praise.",
            "verseStringReplacedWithAllah": "This is because their messengers came to them with clear signs, but they said, “Are humans to guide us?” So, they disbelieved and turned away. Yet Allah is Self-Sufficient, Worthy of all praise."
        },
        {
            "verseNumber": 7,
            "verseString": "Those who disbelieve claim, “they won’t be resurrected”. Say, “Yes, by my Lord, you will surely be resurrected, then you will be informed of what you did—and that is easy for God.”",
            "verseStringReplacedWithAllah": "Those who disbelieve claim, “they won’t be resurrected”. Say, “Yes, by my Lord, you will surely be resurrected, then you will be informed of what you did—and that is easy for Allah.”"
        },
        {
            "verseNumber": 8,
            "verseString": "So believe in God, His Messenger, and the light We revealed. God is fully aware of what you do.",
            "verseStringReplacedWithAllah": "So believe in Allah, His Messenger, and the light We revealed. Allah is fully aware of what you do."
        },
        {
            "verseNumber": 9,
            "verseString": "The Day He gathers you for the Day of Assembly—that is the Day of loss and gain. Whoever believes in God and performs righteous deeds, He will absolve him of his sins and admit him into Gardens through which rivers flow, to abide therein eternally. That’s the supreme victory.",
            "verseStringReplacedWithAllah": "The Day He gathers you for the Day of Assembly—that is the Day of loss and gain. Whoever believes in Allah and performs righteous deeds, He will absolve him of his sins and admit him into Gardens through which rivers flow, to abide therein eternally. That’s the supreme victory."
        },
        {
            "verseNumber": 10,
            "verseString": "However, those who disbelieve and deny Our signs will be the inhabitants of the Fire, to remain therein forever. And what a wretched destination!"
        },
        {
            "verseNumber": 11,
            "verseString": "No disaster strikes except by God’s permission. Whoever believes in God, He will guide his heart. God is aware of everything.",
            "verseStringReplacedWithAllah": "No disaster strikes except by Allah’s permission. Whoever believes in Allah, He will guide his heart. Allah is aware of everything."
        },
        {
            "verseNumber": 12,
            "verseString": "So obey God and obey the Messenger. But if you turn away, Our Messenger is only responsible for clear delivery.",
            "verseStringReplacedWithAllah": "So obey Allah and obey the Messenger. But if you turn away, Our Messenger is only responsible for clear delivery."
        },
        {
            "verseNumber": 13,
            "verseString": "God—there is no deity except Him. In God should the believers place their trust.",
            "verseStringReplacedWithAllah": "Allah—there is no deity except Him. In Allah should the believers place their trust."
        },
        {
            "verseNumber": 14,
            "verseString": "O you who believe, among your spouses and your children, there are adversaries to you, so beware of them. And if you pardon, overlook, and forgive, then God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "O you who believe, among your spouses and your children, there are adversaries to you, so beware of them. And if you pardon, overlook, and forgive, then Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 15,
            "verseString": "Your wealth and your children are a test, and with God is a great reward.",
            "verseStringReplacedWithAllah": "Your wealth and your children are a test, and with Allah is a great reward."
        },
        {
            "verseNumber": 16,
            "verseString": "Be conscious of God as much as you are capable, and listen, and obey, and give for your own good. Whoever is protected from the greed of his own soul—these are the successful.",
            "verseStringReplacedWithAllah": "Be conscious of Allah as much as you are capable, and listen, and obey, and give for your own good. Whoever is protected from the greed of his own soul—these are the successful."
        },
        {
            "verseNumber": 17,
            "verseString": "If you lend to God a good loan, He will multiply it for you and forgive you. God is Appreciative and Forbearing.",
            "verseStringReplacedWithAllah": "If you lend to Allah a good loan, He will multiply it for you and forgive you. Allah is Appreciative and Forbearing."
        },
        {
            "verseNumber": 18,
            "verseString": "He is the Knower of the unseen and the seen, the Mighty and Wise."
        }
    ],
    "chapterNumber": 64,
    "nameInEnglish": "Loss and Gain",
    "nameInTransliteration": "At Taghabun",
    "nameInArabic": "الـتغابن",
    "numberOfVerses": 18
}