{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "O you who believe, don’t place your opinions above those of God and His Messenger. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "O you who believe, don’t place your opinions above those of Allah and His Messenger. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 2,
            "verseString": "O you who have faith, don’t raise your voices above the Prophet’s, and don’t speak to him in a loud voice as you speak loudly to one another, lest your deeds become nullified without your awareness."
        },
        {
            "verseNumber": 3,
            "verseString": "Those who lower their voices in God’s Messenger’s presence are the ones whose hearts have been tested for piety. For them, it is forgiveness and a substantial reward.",
            "verseStringReplacedWithAllah": "Those who lower their voices in Allah’s Messenger’s presence are the ones whose hearts have been tested for piety. For them, it is forgiveness and a substantial reward."
        },
        {
            "verseNumber": 4,
            "verseString": "Those who call you from behind the private apartments—most of them don’t understand."
        },
        {
            "verseNumber": 5,
            "verseString": "If they had waited patiently until you could come out to them, it would’ve been better for them. But God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "If they had waited patiently until you could come out to them, it would’ve been better for them. But Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 6,
            "verseString": "O you who believe, if a sinner brings you information, verify it, lest you harm people out of ignorance and later regret your actions."
        },
        {
            "verseNumber": 7,
            "verseString": "Know that the Messenger of God is among you. If he were to obey you in many matters, you would face difficulty. But God has endeared faith to you and beautified it in your hearts. And He made disbelief, wickedness, and disobedience hateful to you. These are the rightly guided.",
            "verseStringReplacedWithAllah": "Know that the Messenger of Allah is among you. If he were to obey you in many matters, you would face difficulty. But Allah has endeared faith to you and beautified it in your hearts. And He made disbelief, wickedness, and disobedience hateful to you. These are the rightly guided."
        },
        {
            "verseNumber": 8,
            "verseString": "This is God’s grace and favor. God is All-Knowing, Most Wise.",
            "verseStringReplacedWithAllah": "This is Allah’s grace and favor. Allah is All-Knowing, Most Wise."
        },
        {
            "verseNumber": 9,
            "verseString": "If two groups of believers quarrel, reconcile them. But if one transgresses against the other, fight the one which oppresses until it complies with God’s command. Once it does, reconcile them justly and impartially. God loves those who are just.",
            "verseStringReplacedWithAllah": "If two groups of believers quarrel, reconcile them. But if one transgresses against the other, fight the one which oppresses until it complies with Allah’s command. Once it does, reconcile them justly and impartially. Allah loves those who are just."
        },
        {
            "verseNumber": 10,
            "verseString": "The believers are brethren, make peace among your brethren, and fear God, so that you may receive mercy.",
            "verseStringReplacedWithAllah": "The believers are brethren, make peace among your brethren, and fear Allah, so that you may receive mercy."
        },
        {
            "verseNumber": 11,
            "verseString": "O you who believe, let no group mock another; they may be better than them. Nor let women mock other women; they may be better than them. Don’t defame each other or use offensive nicknames. It is wrong to act defiantly after having faith. Those who don’t repent are the wrongdoers."
        },
        {
            "verseNumber": 12,
            "verseString": "O you who believe, avoid most suspicion, for some suspicions are sinful. Don’t spy or backbite each other. Would any of you like to eat the flesh of his dead brother? Surely, you would hate it. Fear God. God is Accepting of repentance, Most Merciful.",
            "verseStringReplacedWithAllah": "O you who believe, avoid most suspicion, for some suspicions are sinful. Don’t spy or backbite each other. Would any of you like to eat the flesh of his dead brother? Surely, you would hate it. Fear Allah. Allah is Accepting of repentance, Most Merciful."
        },
        {
            "verseNumber": 13,
            "verseString": "O people, We created you from a male and a female, and We made you into nations and cultures, so you may learn from each other. The most noble among you in the sight of God is the most righteous. God is All-Knowing, Expert.",
            "verseStringReplacedWithAllah": "O people, We created you from a male and a female, and We made you into nations and cultures, so you may learn from each other. The most noble among you in the sight of Allah is the most righteous. Allah is All-Knowing, Expert."
        },
        {
            "verseNumber": 14,
            "verseString": "The Desert Arabs say, “We have believed.” Say, “You haven’t yet believed, but say instead, ‘We have submitted,’ for faith has not yet entered your hearts. If you obey God and His Messenger, He won’t diminish anything from your deeds. God is Forgiving and Merciful.”",
            "verseStringReplacedWithAllah": "The Desert Arabs say, “We have believed.” Say, “You haven’t yet believed, but say instead, ‘We have submitted,’ for faith has not yet entered your hearts. If you obey Allah and His Messenger, He won’t diminish anything from your deeds. Allah is Forgiving and Merciful.”"
        },
        {
            "verseNumber": 15,
            "verseString": "The believers are those who believe in God and His Messenger, who harbor no doubt, and strive with their possessions and their selves in God’s cause. These are the truthful ones.",
            "verseStringReplacedWithAllah": "The believers are those who believe in Allah and His Messenger, who harbor no doubt, and strive with their possessions and their selves in Allah’s cause. These are the truthful ones."
        },
        {
            "verseNumber": 16,
            "verseString": "Say, “Do you presume to instruct God about your religion, when God knows everything in the heavens and on earth, and God is aware of all things?”",
            "verseStringReplacedWithAllah": "Say, “Do you presume to instruct Allah about your religion, when Allah knows everything in the heavens and on earth, and Allah is aware of all things?”"
        },
        {
            "verseNumber": 17,
            "verseString": "They regard their submission as a favor to you. Say, “Don’t regard your submission as a favor to me. Rather, it is God who granted you a favor by guiding you to the faith, if you are truthful.”",
            "verseStringReplacedWithAllah": "They regard their submission as a favor to you. Say, “Don’t regard your submission as a favor to me. Rather, it is Allah who granted you a favor by guiding you to the faith, if you are truthful.”"
        },
        {
            "verseNumber": 18,
            "verseString": "God knows the unseen realities of the heavens and the earth. God is All-Seeing of everything you do.",
            "verseStringReplacedWithAllah": "Allah knows the unseen realities of the heavens and the earth. Allah is All-Seeing of everything you do."
        }
    ],
    "chapterNumber": 49,
    "nameInEnglish": "The Apartments",
    "nameInTransliteration": "Al Hujurat",
    "nameInArabic": "الحـجـرات",
    "numberOfVerses": 18
}