{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Praise be to God, who created the heavens and the earth, and made darkness and light. Yet those who disbelieve ascribe equals to their Lord.",
            "verseStringReplacedWithAllah": "Praise be to Allah, who created the heavens and the earth, and made darkness and light. Yet those who disbelieve ascribe equals to their Lord."
        },
        {
            "verseNumber": 2,
            "verseString": "It is He who created you from clay, then determined a term—a lifespan known only to Him. Yet, you doubt."
        },
        {
            "verseNumber": 3,
            "verseString": "He is God in the heavens and on earth. He knows your private and public affairs, and He knows what you earn.",
            "verseStringReplacedWithAllah": "He is Allah in the heavens and on earth. He knows your private and public affairs, and He knows what you earn."
        },
        {
            "verseNumber": 4,
            "verseString": "No revelation from their Lord ever reaches them without them turning away from it."
        },
        {
            "verseNumber": 5,
            "verseString": "They denied the truth when it came to them, but the news of what they mocked will soon befall them."
        },
        {
            "verseNumber": 6,
            "verseString": "Don’t they see how many generations We destroyed before them? We had established them on earth more firmly than you, and showered them with abundant blessings from the sky, and made rivers flow beneath them. Then, We destroyed them due to their sins and raised new generations after them."
        },
        {
            "verseNumber": 7,
            "verseString": "Even if We had revealed to them a scripture inscribed on paper, and they had touched it with their own hands, those who disbelieve would say, “This is nothing but clear magic”."
        },
        {
            "verseNumber": 8,
            "verseString": "They even ask, “Why has not an angel been sent down to him?” If we had sent down an angel, the matter would’ve been determined, and they would’ve been given no respite."
        },
        {
            "verseNumber": 9,
            "verseString": "And even if We had made him an angel, We would’ve made him in the form of a man, further confusing them."
        },
        {
            "verseNumber": 10,
            "verseString": "Messengers before you were also ridiculed, but those who mocked were surrounded by what they used to ridicule."
        },
        {
            "verseNumber": 11,
            "verseString": "Say, “Travel the earth and observe the fate of the deniers.”"
        },
        {
            "verseNumber": 12,
            "verseString": "Say, “To whom belongs all that’s in the heavens and the earth?” Say, “To God.” He made mercy incumbent upon Himself. He will gather you on Resurrection Day, which is beyond doubt. Those who lost their souls won’t believe.",
            "verseStringReplacedWithAllah": "Say, “To whom belongs all that’s in the heavens and the earth?” Say, “To Allah.” He made mercy incumbent upon Himself. He will gather you on Resurrection Day, which is beyond doubt. Those who lost their souls won’t believe."
        },
        {
            "verseNumber": 13,
            "verseString": "To Him belongs whatever rests in the night and the day. He is the All-Hearing, the All-Knowing."
        },
        {
            "verseNumber": 14,
            "verseString": "Say, “Should I take a protector other than God, the Originator of the heavens and the earth, who feeds and is not fed?” Say, “I am instructed to be the first who submits.” And don’t be among the polytheists.",
            "verseStringReplacedWithAllah": "Say, “Should I take a protector other than Allah, the Originator of the heavens and the earth, who feeds and is not fed?” Say, “I am instructed to be the first who submits.” And don’t be among the polytheists."
        },
        {
            "verseNumber": 15,
            "verseString": "Say, “I fear the punishment of a tremendous Day if I were to disobey my Lord.”"
        },
        {
            "verseNumber": 16,
            "verseString": "Whoever is spared from it on that Day, He will indeed have shown mercy to him; and that’s the clear success."
        },
        {
            "verseNumber": 17,
            "verseString": "If God touches you with adversity, no one can remove it but Him. And if He touches you with good, He is capable of everything.",
            "verseStringReplacedWithAllah": "If Allah touches you with adversity, no one can remove it but Him. And if He touches you with good, He is capable of everything."
        },
        {
            "verseNumber": 18,
            "verseString": "He is the Dominant over His beings. He is the All-Wise, the Expert."
        },
        {
            "verseNumber": 19,
            "verseString": "Ask them, “What is greater in testimony?” Say, “God is the Witness between me and you. This Quran has been revealed to me, to warn you by it and anyone it reaches. Do you bear witness that there are other gods besides God?” Say, “I don’t bear witness.” Say, “He is, but One God, and I am innocent of whatever you associate with Him.”",
            "verseStringReplacedWithAllah": "Ask them, “What is greater in testimony?” Say, “Allah is the Witness between me and you. This Quran has been revealed to me, to warn you by it and anyone it reaches. Do you bear witness that there are other gods besides Allah?” Say, “I don’t bear witness.” Say, “He is, but One God, and I am innocent of whatever you associate with Him.”"
        },
        {
            "verseNumber": 20,
            "verseString": "Those to whom We gave the Scripture recognize it as they recognize their own children. Yet, those who lost their souls don’t believe."
        },
        {
            "verseNumber": 21,
            "verseString": "Who is more unjust than one who fabricates lies about God or rejects His revelations? The wrongdoers won’t succeed.",
            "verseStringReplacedWithAllah": "Who is more unjust than one who fabricates lies about Allah or rejects His revelations? The wrongdoers won’t succeed."
        },
        {
            "verseNumber": 22,
            "verseString": "On the Day We gather them all together, We will ask those who associated partners with God, “Where are those partners you claimed?”",
            "verseStringReplacedWithAllah": "On the Day We gather them all together, We will ask those who associated partners with Allah, “Where are those partners you claimed?”"
        },
        {
            "verseNumber": 23,
            "verseString": "Their only response will be, “By God, our Lord, we were not polytheists.”",
            "verseStringReplacedWithAllah": "Their only response will be, “By Allah, our Lord, we were not polytheists.”"
        },
        {
            "verseNumber": 24,
            "verseString": "See how they lie to themselves, and how the falsehoods they invented have forsaken them."
        },
        {
            "verseNumber": 25,
            "verseString": "Some of them listen to you, but We placed veils over their hearts, preventing them from understanding it, and deafness in their ears. Even if they witnessed every sign, they wouldn’t believe in it. When they come to argue with you, the disbelievers say, “This is nothing but legends of the ancients.”"
        },
        {
            "verseNumber": 26,
            "verseString": "They deter others from it and avoid it themselves. They destroy nothing but themselves, yet they don’t perceive it."
        },
        {
            "verseNumber": 27,
            "verseString": "If only you could see, when they’re made to stand before the Fire. They will plead, “If only we could return, not reject our Lord’s revelations, and be among the believers.”"
        },
        {
            "verseNumber": 28,
            "verseString": "What they had concealed before will now appear to them; and even if they were sent back, they would certainly return to what they were forbidden, and most surely they are liars."
        },
        {
            "verseNumber": 29,
            "verseString": "They say, “There is nothing beyond our worldly life, and we won’t be resurrected.”"
        },
        {
            "verseNumber": 30,
            "verseString": "If only you could see when they are presented before their Lord. He will ask, “Isn’t this the truth?” They will reply, “Yes, by our Lord.” He will say, “Then taste the punishment for your disbelief.”"
        },
        {
            "verseNumber": 31,
            "verseString": "Those who deny the meeting with God have lost. When the Hour suddenly overtakes them, they will exclaim, “Woe to us for neglecting this!” And they will bear their burdens on their backs—what a terrible load they bear!",
            "verseStringReplacedWithAllah": "Those who deny the meeting with Allah have lost. When the Hour suddenly overtakes them, they will exclaim, “Woe to us for neglecting this!” And they will bear their burdens on their backs—what a terrible load they bear!"
        },
        {
            "verseNumber": 32,
            "verseString": "The life of this world is but a game and a diversion. The Home in the Hereafter is far superior for the righteous. Don’t you understand?"
        },
        {
            "verseNumber": 33,
            "verseString": "We know that what they say grieves you. It’s not you they reject, but it is God’s verses that the wrongdoers deny.",
            "verseStringReplacedWithAllah": "We know that what they say grieves you. It’s not you they reject, but it is Allah’s verses that the wrongdoers deny."
        },
        {
            "verseNumber": 34,
            "verseString": "Messengers before you were also rejected, but they patiently endured rejection and persecution until Our help arrived. And there is no change to the words of God. There has already come to you news about the messengers.",
            "verseStringReplacedWithAllah": "Messengers before you were also rejected, but they patiently endured rejection and persecution until Our help arrived. And there is no change to the words of Allah. There has already come to you news about the messengers."
        },
        {
            "verseNumber": 35,
            "verseString": "If their denial becomes unbearable for you, then if you can, seek a tunnel through the earth or a ladder into heaven to bring them a sign. If God had willed, He could’ve guided them all. So, don’t be of the ignorant.",
            "verseStringReplacedWithAllah": "If their denial becomes unbearable for you, then if you can, seek a tunnel through the earth or a ladder into heaven to bring them a sign. If Allah had willed, He could’ve guided them all. So, don’t be of the ignorant."
        },
        {
            "verseNumber": 36,
            "verseString": "Only those who listen will respond. As for the dead, God will resurrect them. Then they will be returned to Him.",
            "verseStringReplacedWithAllah": "Only those who listen will respond. As for the dead, Allah will resurrect them. Then they will be returned to Him."
        },
        {
            "verseNumber": 37,
            "verseString": "They question, “Why has no sign been sent down to him from his Lord?” Say, “God has the power to send down a miracle, but most of them don’t know.”",
            "verseStringReplacedWithAllah": "They question, “Why has no sign been sent down to him from his Lord?” Say, “Allah has the power to send down a miracle, but most of them don’t know.”"
        },
        {
            "verseNumber": 38,
            "verseString": "There is no creature on earth nor bird that flies with its wings, but they are communities like you. We’ve not neglected anything in the Book. Then to their Lord they will be gathered."
        },
        {
            "verseNumber": 39,
            "verseString": "Those who reject Our signs are deaf and mute, in darkness. Whomever God wills, He leaves to stray, and whomever He wills, He sets on a straight path.",
            "verseStringReplacedWithAllah": "Those who reject Our signs are deaf and mute, in darkness. Whomever Allah wills, He leaves to stray, and whomever He wills, He sets on a straight path."
        },
        {
            "verseNumber": 40,
            "verseString": "Say, “Consider if God’s punishment were to befall you, or the Hour were to arrive, would you call upon anyone other than God, if you are truthful?”",
            "verseStringReplacedWithAllah": "Say, “Consider if Allah’s punishment were to befall you, or the Hour were to arrive, would you call upon anyone other than Allah, if you are truthful?”"
        },
        {
            "verseNumber": 41,
            "verseString": "Only Him you would call upon, and if He wills, He could remove what you implored Him for, and you would forget what you associated."
        },
        {
            "verseNumber": 42,
            "verseString": "We sent messengers to communities before you, and We seized them with hardship and distress, so they might humble themselves."
        },
        {
            "verseNumber": 43,
            "verseString": "But when Our might came upon them, they didn’t humble themselves. But their hearts became hard, Satan beautified their deeds for them."
        },
        {
            "verseNumber": 44,
            "verseString": "When they dismissed the reminders given to them, We opened for them the gates of everything. But just as they were rejoicing in what they received, We seized them abruptly, and they were left in despair."
        },
        {
            "verseNumber": 45,
            "verseString": "Thus, the wrongdoers were utterly cut off. Praise be to God, the Lord of the worlds.",
            "verseStringReplacedWithAllah": "Thus, the wrongdoers were utterly cut off. Praise be to Allah, the Lord of the worlds."
        },
        {
            "verseNumber": 46,
            "verseString": "Ask, “Imagine if God were to take away your hearing and sight, and seal upon your hearts; which god, other than God, could restore them to you?” See how We lay out the signs in detail, yet they still turn away.",
            "verseStringReplacedWithAllah": "Ask, “Imagine if Allah were to take away your hearing and sight, and seal upon your hearts; which god, other than Allah, could restore them to you?” See how We lay out the signs in detail, yet they still turn away."
        },
        {
            "verseNumber": 47,
            "verseString": "Ask, “Imagine if God’s punishment came upon you suddenly or predictably; would anyone be destroyed except the wrongdoers?”",
            "verseStringReplacedWithAllah": "Ask, “Imagine if Allah’s punishment came upon you suddenly or predictably; would anyone be destroyed except the wrongdoers?”"
        },
        {
            "verseNumber": 48,
            "verseString": "We send messengers only to bring good news and to warn. Those who believe and reform will have no fear, nor will they grieve."
        },
        {
            "verseNumber": 49,
            "verseString": "But those who deny Our messages will suffer torment for their defiant disobedience."
        },
        {
            "verseNumber": 50,
            "verseString": "Say, “I don’t claim to hold God’s treasures or to know the unseen. I don’t claim to be an angel either. I only follow what’s revealed to me.” Say, “Can the blind and the seeing be equal? Don’t you reflect?”",
            "verseStringReplacedWithAllah": "Say, “I don’t claim to hold Allah’s treasures or to know the unseen. I don’t claim to be an angel either. I only follow what’s revealed to me.” Say, “Can the blind and the seeing be equal? Don’t you reflect?”"
        },
        {
            "verseNumber": 51,
            "verseString": "Warn with it those who fear being gathered before their Lord—they have no protector or intercessor besides Him—so that they may become righteous."
        },
        {
            "verseNumber": 52,
            "verseString": "Don’t dismiss those who call upon their Lord morning and evening, desiring His countenance. You are not responsible for their judgment, nor are they responsible for yours. If you dismiss them, you will be among the wrongdoers."
        },
        {
            "verseNumber": 53,
            "verseString": "We test some people through others, so they may ask, “Are these the ones God favored among us?” Doesn’t God know best those who are thankful?",
            "verseStringReplacedWithAllah": "We test some people through others, so they may ask, “Are these the ones Allah favored among us?” Doesn’t Allah know best those who are thankful?"
        },
        {
            "verseNumber": 54,
            "verseString": "When those who believe in Our revelations come to you, say, “Peace be upon you. Your Lord has mandated mercy on Himself. If anyone among you commits wrong out of ignorance, and then repents and reforms his ways, then He is Forgiving and Merciful.”"
        },
        {
            "verseNumber": 55,
            "verseString": "In this way, We detail the verses, so that the way of the wicked may become fully apparent."
        },
        {
            "verseNumber": 56,
            "verseString": "Say, “I am forbidden to worship those you invoke besides God.” Say, “I won’t follow your whims, for then I would stray and not be among the guided ones.”",
            "verseStringReplacedWithAllah": "Say, “I am forbidden to worship those you invoke besides Allah.” Say, “I won’t follow your whims, for then I would stray and not be among the guided ones.”"
        },
        {
            "verseNumber": 57,
            "verseString": "Say, “I am reliant on clear evidence from my Lord, yet you deny it. I don’t have what you eagerly demand. Judgment rests solely with God. He states the truth, and He is the best of judges.”",
            "verseStringReplacedWithAllah": "Say, “I am reliant on clear evidence from my Lord, yet you deny it. I don’t have what you eagerly demand. Judgment rests solely with Allah. He states the truth, and He is the best of judges.”"
        },
        {
            "verseNumber": 58,
            "verseString": "Say, “If I had control over what you eagerly demand, the matter between us would’ve been settled. But God knows the wrongdoers best.",
            "verseStringReplacedWithAllah": "Say, “If I had control over what you eagerly demand, the matter between us would’ve been settled. But Allah knows the wrongdoers best."
        },
        {
            "verseNumber": 59,
            "verseString": "With Him are the keys to the unseen; none knows them but He. He knows everything on land and in the sea. Not a leaf falls without His knowledge, nor is there a grain in the darkness of the earth, or anything fresh or dry, but it is recorded in a clear book."
        },
        {
            "verseNumber": 60,
            "verseString": "It is He who retrieves your souls at night and knows what you’ve accomplished by day. Then He revives you therein to complete a designated term. Then, to Him will be your return, and He will inform you about your deeds."
        },
        {
            "verseNumber": 61,
            "verseString": "He is the Conqueror over His beings, and He dispatches guardians over you, until, when death approaches one of you, Our messengers retrieve their souls, never neglecting in their duty."
        },
        {
            "verseNumber": 62,
            "verseString": "Then, they are returned to God, their true Master. His is the judgment, and He is the fastest of accountants.",
            "verseStringReplacedWithAllah": "Then, they are returned to Allah, their true Master. His is the judgment, and He is the fastest of accountants."
        },
        {
            "verseNumber": 63,
            "verseString": "Say, “Who rescues you from the darkness of land and sea when you call upon Him, humbly and privately, ‘If He rescues us from this, we will surely be among the thankful?”"
        },
        {
            "verseNumber": 64,
            "verseString": "Say, “It is God who saves you from it and from every distress, you still associate others with Him.”",
            "verseStringReplacedWithAllah": "Say, “It is Allah who saves you from it and from every distress, you still associate others with Him.”"
        },
        {
            "verseNumber": 65,
            "verseString": "Say, “He is capable of sending a punishment upon you from above or beneath your feet, or dividing you into factions and making you experience each other’s brutality. See how We diversify the verses, so they might understand.”"
        },
        {
            "verseNumber": 66,
            "verseString": "Your people have denied it, even though it’s the truth. Say, “I’m not a manager over you.”"
        },
        {
            "verseNumber": 67,
            "verseString": "For every prophecy there is a fixed time, and you will soon come to know."
        },
        {
            "verseNumber": 68,
            "verseString": "When you see those who engage in offensive discussions about Our verses, turn away from them until they engage in a different topic. Should Satan cause you to forget, then once you remember, don’t sit in the company of the unjust people."
        },
        {
            "verseNumber": 69,
            "verseString": "The righteous bear no responsibility for them, but a reminder might assist them in becoming conscious."
        },
        {
            "verseNumber": 70,
            "verseString": "Leave those who treat their religion as amusement and distraction, and whom the worldly life has deceived. However, remind with it, lest a soul be ruined by what it earned, it will have no protector or intercessor besides God. Even if it should offer every compensation, it won’t be accepted from it. These are the ones who are doomed by their actions. For them is a drink of boiling water and a severe punishment due to their disbelief.",
            "verseStringReplacedWithAllah": "Leave those who treat their religion as amusement and distraction, and whom the worldly life has deceived. However, remind with it, lest a soul be ruined by what it earned, it will have no protector or intercessor besides Allah. Even if it should offer every compensation, it won’t be accepted from it. These are the ones who are doomed by their actions. For them is a drink of boiling water and a severe punishment due to their disbelief."
        },
        {
            "verseNumber": 71,
            "verseString": "Say, “Should we call upon, instead of God, those who can neither benefit nor harm us, and turn backward after God has guided us? Like one whom the devils have led astray on the earth, bewildered in the wilderness, confused, while his friends call him to guidance, saying, ‘Come to us’.” Say, “God’s guidance is the guidance, and we’ve been commanded to submit to the Lord of the universes.”",
            "verseStringReplacedWithAllah": "Say, “Should we call upon, instead of Allah, those who can neither benefit nor harm us, and turn backward after Allah has guided us? Like one whom the devils have led astray on the earth, bewildered in the wilderness, confused, while his friends call him to guidance, saying, ‘Come to us’.” Say, “Allah’s guidance is the guidance, and we’ve been commanded to submit to the Lord of the universes.”"
        },
        {
            "verseNumber": 72,
            "verseString": "“And to establish prayer and revere Him. It is to Him that you will be gathered.”"
        },
        {
            "verseNumber": 73,
            "verseString": "It is He who created the heavens and the earth with truth. The Day He says, “Be,” it becomes. His word is the ultimate truth. His is the dominion on the Day when the trumpet is blown; the Knower of the unseen and the seen; He is the Wise, the Expert."
        },
        {
            "verseNumber": 74,
            "verseString": "Abraham told his father, Azar, “Do you take idols as gods? I see you and your people are clearly astrayed.”"
        },
        {
            "verseNumber": 75,
            "verseString": "We showed Abraham the empire of the heavens and the earth, so that he could have certainty."
        },
        {
            "verseNumber": 76,
            "verseString": "When the night covered him, he saw a star and said, “This is my lord.” But once it set, he said, “I don’t love things that set.”"
        },
        {
            "verseNumber": 77,
            "verseString": "When he saw the moon rising, he said, “This is my lord.” But once it set, he said, “Unless my Lord guides me, I would surely be among the misguided.”"
        },
        {
            "verseNumber": 78,
            "verseString": "And when he saw the sun rising, he said, “This is my lord; this is greater.” But once it set, he said, “O my people, I am free from what you associate with Him."
        },
        {
            "verseNumber": 79,
            "verseString": "I have turned my face towards the One who originated the heavens and the earth, as a monotheist, and I’m not of the polytheists.”"
        },
        {
            "verseNumber": 80,
            "verseString": "His people debated with him, and he said, “Are you arguing with me about God after He has guided me? I don’t fear what you associate with Him, unless my Lord should will something. My Lord encompasses all things in knowledge. Won’t you then remember?",
            "verseStringReplacedWithAllah": "His people debated with him, and he said, “Are you arguing with me about Allah after He has guided me? I don’t fear what you associate with Him, unless my Lord should will something. My Lord encompasses all things in knowledge. Won’t you then remember?"
        },
        {
            "verseNumber": 81,
            "verseString": "How can I fear what you associate with Him? Instead, you should fear, for you associate with God what He never authorized. So which of the two parties has more right to security, if you know?”",
            "verseStringReplacedWithAllah": "How can I fear what you associate with Him? Instead, you should fear, for you associate with Allah what He never authorized. So which of the two parties has more right to security, if you know?”"
        },
        {
            "verseNumber": 82,
            "verseString": "Those who believe and don’t pollute their faith with injustice—these will have security, and they are guided."
        },
        {
            "verseNumber": 83,
            "verseString": "We gave this reasoning to Abraham against his people. We raise in rank whom We will. Your Lord is Wise and Knowing."
        },
        {
            "verseNumber": 84,
            "verseString": "We granted him Isaac and Jacob; each one We guided. We also guided Noah before. And from his offspring, David, Solomon, Job, Joseph, Moses, and Aaron. We thus reward the good-doers."
        },
        {
            "verseNumber": 85,
            "verseString": "Also, Zechariah, John, Jesus, and Elias—all of the virtuous."
        },
        {
            "verseNumber": 86,
            "verseString": "And Ishmael, Elisha, Jonah, and Lot—and each, we preferred over the worlds."
        },
        {
            "verseNumber": 87,
            "verseString": "And among their ancestors, descendants, and brothers—We chose them, and We guided them to a straight path."
        },
        {
            "verseNumber": 88,
            "verseString": "This is God’s guidance; with it, He guides whomever He wills among His servants. If they were to associate others with Him, then all their deeds would be nullified.",
            "verseStringReplacedWithAllah": "This is Allah’s guidance; with it, He guides whomever He wills among His servants. If they were to associate others with Him, then all their deeds would be nullified."
        },
        {
            "verseNumber": 89,
            "verseString": "These are the ones to whom We gave the Scripture, wisdom, and prophethood. If these people reject it, We’ve already entrusted it to a people who won’t reject it."
        },
        {
            "verseNumber": 90,
            "verseString": "These are the ones whom God has guided, so emulate their guidance. Say, “I ask for no compensation for it. This is but a reminder to all mankind.”",
            "verseStringReplacedWithAllah": "These are the ones whom Allah has guided, so emulate their guidance. Say, “I ask for no compensation for it. This is but a reminder to all mankind.”"
        },
        {
            "verseNumber": 91,
            "verseString": "They don’t appraise God with true appraisal when they say, “God didn’t reveal anything to any human.” Say, “Then, who revealed the Scripture which Moses brought, a light and guidance for humanity? You treat it as mere sheets of paper, showing some and concealing much. You were taught things that neither you nor your ancestors knew before.” Say, “God.” Then, leave them playing in their vain discussions.",
            "verseStringReplacedWithAllah": "They don’t appraise Allah with true appraisal when they say, “Allah didn’t reveal anything to any human.” Say, “Then, who revealed the Scripture which Moses brought, a light and guidance for humanity? You treat it as mere sheets of paper, showing some and concealing much. You were taught things that neither you nor your ancestors knew before.” Say, “Allah.” Then, leave them playing in their vain discussions."
        },
        {
            "verseNumber": 92,
            "verseString": "We revealed this blessed Scripture, confirming what preceded it, that you may warn the Mother of Cities and those around it. Those who believe in the Hereafter believe in it, and are constant in their prayers."
        },
        {
            "verseNumber": 93,
            "verseString": "Who is more unjust than one who fabricates lies against God or says, “A revelation was given to me,” when nothing was revealed to him, or who says, “I can reveal the like of what God has revealed?” If only you could see the wrongdoers in the throes of death, with the angels extending their hands, saying, “Yield up your souls! Today, are you being repaid with a punishment of humiliation for the lies you spoke against God, and for your being scornful to His signs.”",
            "verseStringReplacedWithAllah": "Who is more unjust than one who fabricates lies against Allah or says, “A revelation was given to me,” when nothing was revealed to him, or who says, “I can reveal the like of what Allah has revealed?” If only you could see the wrongdoers in the throes of death, with the angels extending their hands, saying, “Yield up your souls! Today, are you being repaid with a punishment of humiliation for the lies you spoke against Allah, and for your being scornful to His signs.”"
        },
        {
            "verseNumber": 94,
            "verseString": "“You’ve come to Us alone, as We created you the first time, leaving behind everything We had bestowed upon you. We don’t see your supposed intercessors with you. The links between you and them have been severed, and all you presumed has let you down.”"
        },
        {
            "verseNumber": 95,
            "verseString": "God is the splitter of the grain and the kernel, bringing out the living from the dead, and the dead from the living. This is God. So, how are you deluded?",
            "verseStringReplacedWithAllah": "Allah is the splitter of the grain and the kernel, bringing out the living from the dead, and the dead from the living. This is Allah. So, how are you deluded?"
        },
        {
            "verseNumber": 96,
            "verseString": "He is the One who breaks the dawn, and has made the night for you to rest, and the sun and moon according to calculations. Such is the design of the Almighty, the All-Knowing."
        },
        {
            "verseNumber": 97,
            "verseString": "It is He who set the stars for you, so you may be guided by them in the darknesses of land and sea. We detailed the signs for people who know."
        },
        {
            "verseNumber": 98,
            "verseString": "It is He who initiated you from a single soul, then from a repository, and then from a depository. We detail the signs for people who understand."
        },
        {
            "verseNumber": 99,
            "verseString": "It is He who sends down rain from the sky. With it, We produce diverse kinds of vegetation: lush greenery, from which We produce clustered grain, and date palms with hanging clusters, vineyards, olives, and pomegranates, similar and dissimilar. Observe their fruits as they grow and ripen. In these are signs for people who believe."
        },
        {
            "verseNumber": 100,
            "verseString": "Yet, they attribute partners to God—the jinn—even though He created them. They pierce for Him sons and daughters, without any knowledge. Exalted is He, and high above what they attribute to Him.",
            "verseStringReplacedWithAllah": "Yet, they attribute partners to Allah—the jinn—even though He created them. They pierce for Him sons and daughters, without any knowledge. Exalted is He, and high above what they attribute to Him."
        },
        {
            "verseNumber": 101,
            "verseString": "The Originator of the heavens and the earth. How could He have a child when He has no female companion? He created all things and is fully aware of everything."
        },
        {
            "verseNumber": 102,
            "verseString": "Such is God, your Lord. There is no deity except He, the Creator of all things. Worship Him alone, for He is in charge of all things.",
            "verseStringReplacedWithAllah": "Such is Allah, your Lord. There is no deity except He, the Creator of all things. Worship Him alone, for He is in charge of all things."
        },
        {
            "verseNumber": 103,
            "verseString": "No vision can grasp Him, yet He grasps all vision. He is the Subtle, the Expert."
        },
        {
            "verseNumber": 104,
            "verseString": "Clear proofs have come to you from your Lord. Whoever sees, does so for his good; and whoever remains blind, does so to his detriment. “I am not a keeper over you.”"
        },
        {
            "verseNumber": 105,
            "verseString": "Thus, We vary the verses, so that they may say, “You have studied,” and that We may make clear for a people who know."
        },
        {
            "verseNumber": 106,
            "verseString": "Follow what has been revealed to you from your Lord, for there is no god but Him, and turn away from the associators."
        },
        {
            "verseNumber": 107,
            "verseString": "If God had willed, they wouldn’t have associated. We didn’t make you a guardian over them, nor are you a manager over them.",
            "verseStringReplacedWithAllah": "If Allah had willed, they wouldn’t have associated. We didn’t make you a guardian over them, nor are you a manager over them."
        },
        {
            "verseNumber": 108,
            "verseString": "Don’t insult those they invoke besides God, lest they insult God out of hostility and ignorance. We made each community’s deeds seem appealing to them. Eventually, they will return to their Lord, who will inform them of everything they did.",
            "verseStringReplacedWithAllah": "Don’t insult those they invoke besides Allah, lest they insult Allah out of hostility and ignorance. We made each community’s deeds seem appealing to them. Eventually, they will return to their Lord, who will inform them of everything they did."
        },
        {
            "verseNumber": 109,
            "verseString": "They swear their strongest oaths by God that if a miracle came to them, they would believe in it. Say, “The signs are only with God.” And how could you tell, when if it did come, they still wouldn’t believe.",
            "verseStringReplacedWithAllah": "They swear their strongest oaths by Allah that if a miracle came to them, they would believe in it. Say, “The signs are only with Allah.” And how could you tell, when if it did come, they still wouldn’t believe."
        },
        {
            "verseNumber": 110,
            "verseString": "We will turn their hearts and eyes away, just as they refused to believe in it the first time, leaving them wandering aimlessly in their transgression."
        },
        {
            "verseNumber": 111,
            "verseString": "Even if We sent down the angels to them, made the dead speak to them, and gathered all things before them, they would still not believe, unless God wills it. But most of them don’t know.",
            "verseStringReplacedWithAllah": "Even if We sent down the angels to them, made the dead speak to them, and gathered all things before them, they would still not believe, unless Allah wills it. But most of them don’t know."
        },
        {
            "verseNumber": 112,
            "verseString": "Similarly, We’ve assigned enemies for every prophet—human and jinn devils—who inspire each other with embellished, deceitful speech. If your Lord had willed, they wouldn’t have done it. So, leave them and their fabrication."
        },
        {
            "verseNumber": 113,
            "verseString": "This allows the hearts of those who don’t believe in the Hereafter to incline towards it, find satisfaction in it, and persist in their sinful pursuits."
        },
        {
            "verseNumber": 114,
            "verseString": "“Should I seek a judge other than God, when it is He who revealed the Scripture to you in detail?” Those to whom We gave the Scripture recognize it as the truth from your Lord, so don’t be of those who doubt.",
            "verseStringReplacedWithAllah": "“Should I seek a judge other than Allah, when it is He who revealed the Scripture to you in detail?” Those to whom We gave the Scripture recognize it as the truth from your Lord, so don’t be of those who doubt."
        },
        {
            "verseNumber": 115,
            "verseString": "The Word of your Lord is perfected in its truth and justice. None can alter His words. He is the All-Hearing, the All-Knowing."
        },
        {
            "verseNumber": 116,
            "verseString": "If you were to obey the majority of those on earth, they would lead you astray from God’s path. They follow only conjecture, and they are only guessing.",
            "verseStringReplacedWithAllah": "If you were to obey the majority of those on earth, they would lead you astray from Allah’s path. They follow only conjecture, and they are only guessing."
        },
        {
            "verseNumber": 117,
            "verseString": "Your Lord is the most knowledgeable of those who deviate from His path, and He is fully aware of those who are guided."
        },
        {
            "verseNumber": 118,
            "verseString": "Eat of what God’s name was pronounced, if you are believers in His revelations.",
            "verseStringReplacedWithAllah": "Eat of what Allah’s name was pronounced, if you are believers in His revelations."
        },
        {
            "verseNumber": 119,
            "verseString": "Why shouldn’t you not eat that over which God’s name was pronounced, when He has already explained to you what He has forbidden to you, except when you are compelled? Many lead astray by their desires, due to their lack of knowledge. Your Lord is fully aware of the transgressors.",
            "verseStringReplacedWithAllah": "Why shouldn’t you not eat that over which Allah’s name was pronounced, when He has already explained to you what He has forbidden to you, except when you are compelled? Many lead astray by their desires, due to their lack of knowledge. Your Lord is fully aware of the transgressors."
        },
        {
            "verseNumber": 120,
            "verseString": "And abandon all sin, whether open or secret. Those who commit sins will be reimbursed for what they’ve done."
        },
        {
            "verseNumber": 121,
            "verseString": "Don’t eat from what God’s name hasn’t been mentioned upon, for it’s sinful. The devils inspire their allies to argue with you. If you were to obey them, you would be polytheists.",
            "verseStringReplacedWithAllah": "Don’t eat from what Allah’s name hasn’t been mentioned upon, for it’s sinful. The devils inspire their allies to argue with you. If you were to obey them, you would be polytheists."
        },
        {
            "verseNumber": 122,
            "verseString": "Is one who was dead, to whom We gave life and a light by which he can walk among people, be like the one who is in deep darkness, from which he can’t emerge? Thus, the deeds of the unbelievers have been made appealing to them."
        },
        {
            "verseNumber": 123,
            "verseString": "In every community, We’ve placed its most notorious criminals, to conspire within it. However, they only conspire against themselves, without realizing it."
        },
        {
            "verseNumber": 124,
            "verseString": "When a verse comes to them, they say, “We won’t believe unless we receive the same revelations as God’s messengers.” God knows best where to place His message. Humiliation from God and severe punishment will afflict the criminals for their scheming.",
            "verseStringReplacedWithAllah": "When a verse comes to them, they say, “We won’t believe unless we receive the same revelations as Allah’s messengers.” Allah knows best where to place His message. Humiliation from Allah and severe punishment will afflict the criminals for their scheming."
        },
        {
            "verseNumber": 125,
            "verseString": "Whomever God wills to guide, He expands his heart to submission. And whomever He wills to misguide, He makes his heart tight and constricted, as if he were ascending into the sky. In this way, God lays defilement on those who don’t believe.",
            "verseStringReplacedWithAllah": "Whomever Allah wills to guide, He expands his heart to submission. And whomever He wills to misguide, He makes his heart tight and constricted, as if he were ascending into the sky. In this way, Allah lays defilement on those who don’t believe."
        },
        {
            "verseNumber": 126,
            "verseString": "This is the path of your Lord, straight. We detailed the signs for those who pay heed."
        },
        {
            "verseNumber": 127,
            "verseString": "For them is the Home of Peace with their Lord, and He is their Protector as a result of their deeds."
        },
        {
            "verseNumber": 128,
            "verseString": "On the Day when He will gather them all: “O assembly of jinn, you’ve exploited many humans.” Their human allies will say, “Our Lord, we’ve benefited from each other, but we’ve now reached the term that You’ve appointed for us.” He will say, “The Fire is your residence, where you will remain forever, except as God wills.” Your Lord is Wise and All-Knowing.",
            "verseStringReplacedWithAllah": "On the Day when He will gather them all: “O assembly of jinn, you’ve exploited many humans.” Their human allies will say, “Our Lord, we’ve benefited from each other, but we’ve now reached the term that You’ve appointed for us.” He will say, “The Fire is your residence, where you will remain forever, except as Allah wills.” Your Lord is Wise and All-Knowing."
        },
        {
            "verseNumber": 129,
            "verseString": "Thus, We let some wrongdoers befriend each other due to what they used to earn."
        },
        {
            "verseNumber": 130,
            "verseString": "“O community of jinn and humans, didn’t there come to you messengers from among you, relating to you My verses and warning you of the meeting of this Day of yours?” They will respond, “We bear witness against ourselves.” The worldly life deceived them, and they will testify against themselves that they were unbelievers."
        },
        {
            "verseNumber": 131,
            "verseString": "That is because your Lord would not unjustly destroy communities while their people are unaware."
        },
        {
            "verseNumber": 132,
            "verseString": "Every soul will be ranked according to its deeds. Your Lord is not unaware of what they do."
        },
        {
            "verseNumber": 133,
            "verseString": "Your Lord is the Self-Sufficient, full of mercy. If He wills, He can remove you and replace you with anyone He wills, just as He raised you from the descendants of another people."
        },
        {
            "verseNumber": 134,
            "verseString": "What you are promised is coming, and you can’t prevent it."
        },
        {
            "verseNumber": 135,
            "verseString": "Say, “O my people, act according to your ability, and so will I. Soon, you will know who will attain the ultimate Home.” The wrongdoers won’t succeed."
        },
        {
            "verseNumber": 136,
            "verseString": "They assign for God a portion of the crops and livestock that He originated, saying, “This is for God,” so they claim, and “This is for our partners.” But what’s designated for their partners doesn’t reach God, while what’s designated for God does reach their partners. Bad indeed is their judgment.",
            "verseStringReplacedWithAllah": "They assign for Allah a portion of the crops and livestock that He originated, saying, “This is for Allah,” so they claim, and “This is for our partners.” But what’s designated for their partners doesn’t reach Allah, while what’s designated for Allah does reach their partners. Bad indeed is their judgment."
        },
        {
            "verseNumber": 137,
            "verseString": "And thus, many of the idolaters have been led by their partners to kill their children, bringing about their ruin and causing confusion in their religion. If God had willed, they wouldn’t have done it. So leave them and what they fabricate.",
            "verseStringReplacedWithAllah": "And thus, many of the idolaters have been led by their partners to kill their children, bringing about their ruin and causing confusion in their religion. If Allah had willed, they wouldn’t have done it. So leave them and what they fabricate."
        },
        {
            "verseNumber": 138,
            "verseString": "They also assert, “These livestock and crops are sanctified; none may eat from except those we allow,” so they claim, and certain animals they deem forbidden to ride. And some animals on which they don’t pronounce the name of God, inventing falsehood against Him—He will recompense them for what they’ve been inventing.",
            "verseStringReplacedWithAllah": "They also assert, “These livestock and crops are sanctified; none may eat from except those we allow,” so they claim, and certain animals they deem forbidden to ride. And some animals on which they don’t pronounce the name of Allah, inventing falsehood against Him—He will recompense them for what they’ve been inventing."
        },
        {
            "verseNumber": 139,
            "verseString": "They further allege, “What’s in the womb of these animals is exclusively for our males and is forbidden to our wives.” However, if it’s stillborn, they all share in it. He will recompense them for their allegation. He is All-Wise, All-Knowing."
        },
        {
            "verseNumber": 140,
            "verseString": "Those who killed their children have suffered loss, without knowledge, and forbid what God provided for them, fabricating lies against God. They strayed and weren’t guided.",
            "verseStringReplacedWithAllah": "Those who killed their children have suffered loss, without knowledge, and forbid what Allah provided for them, fabricating lies against Allah. They strayed and weren’t guided."
        },
        {
            "verseNumber": 141,
            "verseString": "It is He who produced gardens, both trellised and untrellised, and date palms, various crops with different flavors, and olives and pomegranates, similar and dissimilar. Eat from their fruit when it ripens, give its due on the day of its harvest, and don’t be wasteful. He doesn’t like the extravagant."
        },
        {
            "verseNumber": 142,
            "verseString": "Livestock serves as a means of transportation and a source of materials. Consume what God provided for you, and don’t follow Satan’s footsteps; he is a clear enemy to you.",
            "verseStringReplacedWithAllah": "Livestock serves as a means of transportation and a source of materials. Consume what Allah provided for you, and don’t follow Satan’s footsteps; he is a clear enemy to you."
        },
        {
            "verseNumber": 143,
            "verseString": "Eight pairs: two of sheep and two of goats. Ask, “Did He prohibit the two males, the two females, or what’s carried in the wombs of the two females? Tell me with knowledge, if you are truthful.”"
        },
        {
            "verseNumber": 144,
            "verseString": "And of camels and cattle, two pairs. Ask, “Did He forbid the two males, the two females, or what the wombs of the two females contain? Were you present when God issued these prohibitions?” So who is more unjust than one who invents a lie against God, to lead people astray without knowledge? God doesn’t guide the unjust people.",
            "verseStringReplacedWithAllah": "And of camels and cattle, two pairs. Ask, “Did He forbid the two males, the two females, or what the wombs of the two females contain? Were you present when Allah issued these prohibitions?” So who is more unjust than one who invents a lie against Allah, to lead people astray without knowledge? Allah doesn’t guide the unjust people."
        },
        {
            "verseNumber": 145,
            "verseString": "Say, “In what was revealed to me, I find no food forbidden for consumption, except for carrion, spilled blood, pork—which is unclean—or a sinful offering dedicated to anyone other than God. However, if anyone is compelled by necessity, without willful disobedience or transgression, your Lord is Forgiving and Merciful.”",
            "verseStringReplacedWithAllah": "Say, “In what was revealed to me, I find no food forbidden for consumption, except for carrion, spilled blood, pork—which is unclean—or a sinful offering dedicated to anyone other than Allah. However, if anyone is compelled by necessity, without willful disobedience or transgression, your Lord is Forgiving and Merciful.”"
        },
        {
            "verseNumber": 146,
            "verseString": "To those who are Jewish, We prohibited every animal with uncloven hooves; and of the cattle and the sheep We prohibited to them their fat, except what adheres to their backs or the entrails, or what’s mixed with bone. Thus, We penalized them for their rebelliousness. We are truthful."
        },
        {
            "verseNumber": 147,
            "verseString": "If they accuse you of lying, say, “Your Lord is the possessor of vast mercy, but His punishment won’t be averted from guilty people.”"
        },
        {
            "verseNumber": 148,
            "verseString": "Those who associate others will say, “If God had willed, we wouldn’t have associated anything with Him, nor would our forefathers, nor would we have prohibited anything.” Likewise, those who came before them also denied until they tasted Our punishment. Say, “Do you have any knowledge you can present to us? You are just following speculation, and you do nothing but lie.”",
            "verseStringReplacedWithAllah": "Those who associate others will say, “If Allah had willed, we wouldn’t have associated anything with Him, nor would our forefathers, nor would we have prohibited anything.” Likewise, those who came before them also denied until they tasted Our punishment. Say, “Do you have any knowledge you can present to us? You are just following speculation, and you do nothing but lie.”"
        },
        {
            "verseNumber": 149,
            "verseString": "Say, ”With God lies the decisive argument. Had He willed, He would have guided you all.”",
            "verseStringReplacedWithAllah": "Say, ”With Allah lies the decisive argument. Had He willed, He would have guided you all.”"
        },
        {
            "verseNumber": 150,
            "verseString": "Say, “Bring forth your witnesses who can testify that God has forbidden this.” If they do testify, don’t testify with them. And don’t follow the inclinations of those who deny Our signs, those who don’t believe in the Hereafter, those who equate others with their Lord.",
            "verseStringReplacedWithAllah": "Say, “Bring forth your witnesses who can testify that Allah has forbidden this.” If they do testify, don’t testify with them. And don’t follow the inclinations of those who deny Our signs, those who don’t believe in the Hereafter, those who equate others with their Lord."
        },
        {
            "verseNumber": 151,
            "verseString": "Say, “Come, I will recite what your Lord prohibited for you: don’t associate anything with Him; honor your parents; don’t kill your children from fear of poverty—We provide for you and them; don’t approach immoralities, whether open or secret; and don’t take a life that God deemed sacred, except in the course of justice. These are His commandments to you, so you may know.”",
            "verseStringReplacedWithAllah": "Say, “Come, I will recite what your Lord prohibited for you: don’t associate anything with Him; honor your parents; don’t kill your children from fear of poverty—We provide for you and them; don’t approach immoralities, whether open or secret; and don’t take a life that Allah deemed sacred, except in the course of justice. These are His commandments to you, so you may know.”"
        },
        {
            "verseNumber": 152,
            "verseString": "And don’t come near the wealth of the orphan, except in the best manner, until he reaches maturity. Give full measure and weight in justice. We never burden a soul beyond its capacity. And when you speak, be just, even if it concerns a close relative. And fulfill your covenant with God. This, He has commanded you, so you may avoid wrongdoing.",
            "verseStringReplacedWithAllah": "And don’t come near the wealth of the orphan, except in the best manner, until he reaches maturity. Give full measure and weight in justice. We never burden a soul beyond its capacity. And when you speak, be just, even if it concerns a close relative. And fulfill your covenant with Allah. This, He has commanded you, so you may avoid wrongdoing."
        },
        {
            "verseNumber": 153,
            "verseString": "This is My path, straight, so follow it. Don’t follow other paths, for they will lead you astray from His path. God has commanded this to you, so you may refrain from wrongdoing.",
            "verseStringReplacedWithAllah": "This is My path, straight, so follow it. Don’t follow other paths, for they will lead you astray from His path. Allah has commanded this to you, so you may refrain from wrongdoing."
        },
        {
            "verseNumber": 154,
            "verseString": "We gave Moses the Scripture, complete for those who do good, explaining all things, as guidance and mercy, so they may believe in the encounter with their Lord."
        },
        {
            "verseNumber": 155,
            "verseString": "And this is a blessed Scripture that We revealed. Follow it and be righteous, so you may receive mercy."
        },
        {
            "verseNumber": 156,
            "verseString": "Lest you say, “The Scripture was revealed to two communities before us, and we were unaware of their teachings.”"
        },
        {
            "verseNumber": 157,
            "verseString": "Or perhaps you might say, “Had the Scripture been revealed to us, we would’ve been more rightly guided than they.” Now, clear evidence, guidance, and mercy have come to you from your Lord. Who is more unjust than one who denies God’s messages and turns away from them? We will repay those who turn away from Our revelations with the severest punishment, because of their turning away.",
            "verseStringReplacedWithAllah": "Or perhaps you might say, “Had the Scripture been revealed to us, we would’ve been more rightly guided than they.” Now, clear evidence, guidance, and mercy have come to you from your Lord. Who is more unjust than one who denies Allah’s messages and turns away from them? We will repay those who turn away from Our revelations with the severest punishment, because of their turning away."
        },
        {
            "verseNumber": 158,
            "verseString": "Are they awaiting the descent of the angels, the arrival of your Lord Himself, or the manifestation of some of your Lord’s signs? On the day when some of these signs from your Lord do appear, faith won’t benefit any soul which didn’t believe before, or which didn’t earn any good by its faith. Say, “Wait; we, too, are waiting.”"
        },
        {
            "verseNumber": 159,
            "verseString": "As for those who divided their religion and became denominations, you have no association with them. Their case rests with God, and He will then inform them about their deeds.",
            "verseStringReplacedWithAllah": "As for those who divided their religion and became denominations, you have no association with them. Their case rests with Allah, and He will then inform them about their deeds."
        },
        {
            "verseNumber": 160,
            "verseString": "Whoever presents a good deed will receive a tenfold equivalent. But whoever commits evil acts will only be repaid equivalently and won’t be wronged."
        },
        {
            "verseNumber": 161,
            "verseString": "Say, “My Lord has guided me to a straight path, an upright religion, the community of Abraham the Monotheist, who wasn’t among the polytheists.”"
        },
        {
            "verseNumber": 162,
            "verseString": "Say, “My prayers, my devotion, my living, and my dying are all for God, the Lord of the worlds.",
            "verseStringReplacedWithAllah": "Say, “My prayers, my devotion, my living, and my dying are all for Allah, the Lord of the worlds."
        },
        {
            "verseNumber": 163,
            "verseString": "There is no partner for Him. To this I have been commanded, and I am the first of the Submitters.”"
        },
        {
            "verseNumber": 164,
            "verseString": "Say, “Should I seek a lord other than God, when He is the Lord of all things?” No soul earns except against itself, and no bearer of burdens will bear the burdens of another. Then to your Lord is your return, and He will inform you about your disagreements.",
            "verseStringReplacedWithAllah": "Say, “Should I seek a lord other than Allah, when He is the Lord of all things?” No soul earns except against itself, and no bearer of burdens will bear the burdens of another. Then to your Lord is your return, and He will inform you about your disagreements."
        },
        {
            "verseNumber": 165,
            "verseString": "It is He who made you successors on earth and elevated some of you above others in ranks—to test you through what He gave you. Your Lord is swift in retribution, and He is Forgiving and Merciful."
        }
    ],
    "chapterNumber": 6,
    "nameInEnglish": "Livestock",
    "nameInTransliteration": "Al Anam",
    "nameInArabic": "الأنعام",
    "numberOfVerses": 165
}