{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Ha. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "The revelation of the Scripture is from God, the Almighty, the All-Knowing.",
            "verseStringReplacedWithAllah": "The revelation of the Scripture is from Allah, the Almighty, the All-Knowing."
        },
        {
            "verseNumber": 3,
            "verseString": "He is the forgiver of sins, acceptor of repentance, severe in retribution, and of infinite forbearance. There is no god except Him; to Him is the ultimate return."
        },
        {
            "verseNumber": 4,
            "verseString": "None dispute God’s revelations except those who disbelieve. Let not their activities in the lands deceive you.",
            "verseStringReplacedWithAllah": "None dispute Allah’s revelations except those who disbelieve. Let not their activities in the lands deceive you."
        },
        {
            "verseNumber": 5,
            "verseString": "The people of Noah denied the truth before them, as did the factions after them. Every community plotted against their own messenger, to seize him. They argued with falsehood to invalidate the truth. Yet, I seized them, and how severe was My retribution!"
        },
        {
            "verseNumber": 6,
            "verseString": "The decree of your Lord against those who disbelieve is just: “They are the occupants of the Fire.”"
        },
        {
            "verseNumber": 7,
            "verseString": "Those who carry the Throne, and those around it, glorify their Lord with praises, believe in Him, and plead for forgiveness for those who believe: “Our Lord, You encompass all things in mercy and knowledge; forgive those who have repented and followed Your path, and shield them from the torment of the Inferno."
        },
        {
            "verseNumber": 8,
            "verseString": "Admit them, Our Lord, into the Gardens of Eternity, which You’ve promised them, along with the righteous among their parents, spouses, and offspring. You are the All-Powerful, the All-Wise."
        },
        {
            "verseNumber": 9,
            "verseString": "And shield them from evil deeds. Whomever You shield from evil deeds on that Day has received Your mercy, and that’s the ultimate triumph.”"
        },
        {
            "verseNumber": 10,
            "verseString": "The disbelievers will be told, “God’s abhorrence of you is greater than your self-loathing, for when you were invited to faith, you refused.”",
            "verseStringReplacedWithAllah": "The disbelievers will be told, “Allah’s abhorrence of you is greater than your self-loathing, for when you were invited to faith, you refused.”"
        },
        {
            "verseNumber": 11,
            "verseString": "They will plead, “Our Lord, You’ve caused us to die twice, and You’ve given us life twice. Now we admit our sins; is there an escape?”"
        },
        {
            "verseNumber": 12,
            "verseString": "This is because when God alone was called upon, you disbelieved, but when partners were associated with Him, you believed. Judgment belongs to God, the Most High, the Supreme.",
            "verseStringReplacedWithAllah": "This is because when Allah alone was called upon, you disbelieved, but when partners were associated with Him, you believed. Judgment belongs to Allah, the Most High, the Supreme."
        },
        {
            "verseNumber": 13,
            "verseString": "It is He who shows you His marvels and sends down sustenance from the sky for you. Only those who turn to Him will truly understand."
        },
        {
            "verseNumber": 14,
            "verseString": "Invoke God, dedicating your devotion to Him, even though the unbelievers may detest it.",
            "verseStringReplacedWithAllah": "Invoke Allah, dedicating your devotion to Him, even though the unbelievers may detest it."
        },
        {
            "verseNumber": 15,
            "verseString": "He is of the highest rank, the Master of all sovereignty. He sends down the Spirit by His command to whichever of His servants He wills, to warn of the Day of Encounter."
        },
        {
            "verseNumber": 16,
            "verseString": "On that Day, they will emerge, with nothing about them will be hidden from God. To whom does sovereignty belong today? To God, the One, the Irresistible.",
            "verseStringReplacedWithAllah": "On that Day, they will emerge, with nothing about them will be hidden from Allah. To whom does sovereignty belong today? To Allah, the One, the Irresistible."
        },
        {
            "verseNumber": 17,
            "verseString": "On that Day, every soul will be recompensed for what it has earned. There will be no injustice on that Day. God is swift in taking account.",
            "verseStringReplacedWithAllah": "On that Day, every soul will be recompensed for what it has earned. There will be no injustice on that Day. Allah is swift in taking account."
        },
        {
            "verseNumber": 18,
            "verseString": "Warn them of the approaching Day, when hearts are at throats, choked with fear. The wrongdoers will have no comforting friend, nor any intercessor who might be obeyed."
        },
        {
            "verseNumber": 19,
            "verseString": "He knows the treachery of the eyes and what the hearts conceal."
        },
        {
            "verseNumber": 20,
            "verseString": "God judges with the truth, while those they call upon other than Him can’t judge at all. God is the All-Hearing, the All-Seeing.",
            "verseStringReplacedWithAllah": "Allah judges with the truth, while those they call upon other than Him can’t judge at all. Allah is the All-Hearing, the All-Seeing."
        },
        {
            "verseNumber": 21,
            "verseString": "Didn’t they journey through the earth and see what was the end of those before them? They were stronger than them, and had more impact on the earth. Yet, God seized them for their sins, and they had no protector against God.",
            "verseStringReplacedWithAllah": "Didn’t they journey through the earth and see what was the end of those before them? They were stronger than them, and had more impact on the earth. Yet, Allah seized them for their sins, and they had no protector against Allah."
        },
        {
            "verseNumber": 22,
            "verseString": "Their messengers came to them with clear signs, yet they disbelieved. So, God seized them. He is powerful and severe in retribution.",
            "verseStringReplacedWithAllah": "Their messengers came to them with clear signs, yet they disbelieved. So, Allah seized them. He is powerful and severe in retribution."
        },
        {
            "verseNumber": 23,
            "verseString": "We sent Moses with Our signs and a manifest authority."
        },
        {
            "verseNumber": 24,
            "verseString": "To Pharaoh, Haman, and Korah, but they said, “A magician, a liar”."
        },
        {
            "verseNumber": 25,
            "verseString": "When he brought them the truth from Us, they said, “Kill the sons of those who believe with him, and spare their women.” Yet, the plots of the unbelievers are destined to fail."
        },
        {
            "verseNumber": 26,
            "verseString": "Pharaoh declared, “Leave me to kill Moses, and let him appeal to his Lord. I fear he may change your religion or spread disorder in the land.”"
        },
        {
            "verseNumber": 27,
            "verseString": "Moses responded, “I seek refuge in my Lord and your Lord from every arrogant one who doesn’t believe in the Day of Reckoning.”"
        },
        {
            "verseNumber": 28,
            "verseString": "A believing man from Pharaoh’s family, who had concealed his faith, said, “Would you kill a man just because he says, ‘My Lord is God,’ and he brought you clear proofs from your Lord? If he is lying, his lie will be upon him, but if he’s truthful, then some of what he promises you will befall you. Surely, God doesn’t guide the extravagant liar.",
            "verseStringReplacedWithAllah": "A believing man from Pharaoh’s family, who had concealed his faith, said, “Would you kill a man just because he says, ‘My Lord is Allah,’ and he brought you clear proofs from your Lord? If he is lying, his lie will be upon him, but if he’s truthful, then some of what he promises you will befall you. Surely, Allah doesn’t guide the extravagant liar."
        },
        {
            "verseNumber": 29,
            "verseString": "O my people, you have the kingdom today and you are dominant in the land. But who will save us from God’s wrath, if it were to befall us?” Pharaoh said, “I only show you what I see and guide you to the path of right conduct.”",
            "verseStringReplacedWithAllah": "O my people, you have the kingdom today and you are dominant in the land. But who will save us from Allah’s wrath, if it were to befall us?” Pharaoh said, “I only show you what I see and guide you to the path of right conduct.”"
        },
        {
            "verseNumber": 30,
            "verseString": "The believer continued, “O my people, I fear for you a fate like that of the day of the confederates."
        },
        {
            "verseNumber": 31,
            "verseString": "Like the fate of the people of Noah, Aad, Thamud, and those after them. God doesn’t intend any injustice for the beings.",
            "verseStringReplacedWithAllah": "Like the fate of the people of Noah, Aad, Thamud, and those after them. Allah doesn’t intend any injustice for the beings."
        },
        {
            "verseNumber": 32,
            "verseString": "O my people, I fear for you the Day of Calling Out."
        },
        {
            "verseNumber": 33,
            "verseString": "The Day when you will turn around and retreat, having no defender against God. Whomever God sends astray will have no guide.”",
            "verseStringReplacedWithAllah": "The Day when you will turn around and retreat, having no defender against Allah. Whomever Allah sends astray will have no guide.”"
        },
        {
            "verseNumber": 34,
            "verseString": "Joseph had previously come to you with clear proofs, but you remained doubtful about what he brought you. So when he died, you said, “God won’t send a messenger after him.” Thus, God misguides the transgressors and doubtful.",
            "verseStringReplacedWithAllah": "Joseph had previously come to you with clear proofs, but you remained doubtful about what he brought you. So when he died, you said, “Allah won’t send a messenger after him.” Thus, Allah misguides the transgressors and doubtful."
        },
        {
            "verseNumber": 35,
            "verseString": "Those who dispute God’s verses, without any authority given to them, are greatly despised by God and those who believe. Thus, God seals the heart of every arrogant tyrant.",
            "verseStringReplacedWithAllah": "Those who dispute Allah’s verses, without any authority given to them, are greatly despised by Allah and those who believe. Thus, Allah seals the heart of every arrogant tyrant."
        },
        {
            "verseNumber": 36,
            "verseString": "Pharaoh commanded, “O Haman, build me a tower, that I may reach the pathways."
        },
        {
            "verseNumber": 37,
            "verseString": "The pathways into the heavens, so I may look at the God of Moses, but I think he’s a liar.” Thus, Pharaoh’s evil deeds were made appealing to him, and he was barred from the path. Pharaoh’s scheming led only to ruin."
        },
        {
            "verseNumber": 38,
            "verseString": "The believer pleaded, “O my people, follow me, and I will guide you to the path of righteousness.”"
        },
        {
            "verseNumber": 39,
            "verseString": "“O my people, this worldly life is fleeting enjoyment, while the Hereafter is the home of permanence.”"
        },
        {
            "verseNumber": 40,
            "verseString": "He who does an evil deed will only be repaid with its equivalent. However, whoever acts righteously, whether male or female, while being a believer, will enter Paradise, where they will be provided for without measure."
        },
        {
            "verseNumber": 41,
            "verseString": "“O my people! How is it that I invite you to salvation while you invite me to the Fire?"
        },
        {
            "verseNumber": 42,
            "verseString": "You urge me to disbelieve in God and to associate with Him what I don’t know, while I invite you to the Almighty, the Forgiving.",
            "verseStringReplacedWithAllah": "You urge me to disbelieve in Allah and to associate with Him what I don’t know, while I invite you to the Almighty, the Forgiving."
        },
        {
            "verseNumber": 43,
            "verseString": "No doubt, what you invite me to has no calling in this world, nor in the Hereafter. Our return is to God, and the transgressors will be the inhabitants of the Fire.",
            "verseStringReplacedWithAllah": "No doubt, what you invite me to has no calling in this world, nor in the Hereafter. Our return is to Allah, and the transgressors will be the inhabitants of the Fire."
        },
        {
            "verseNumber": 44,
            "verseString": "You will soon remember what I say to you. I commit my affairs to God. Truly, God is Seeing of the beings.”",
            "verseStringReplacedWithAllah": "You will soon remember what I say to you. I commit my affairs to Allah. Truly, Allah is Seeing of the beings.”"
        },
        {
            "verseNumber": 45,
            "verseString": "So God protected him from the evil schemes they plotted, while a terrible punishment engulfed Pharaoh’s people.",
            "verseStringReplacedWithAllah": "So Allah protected him from the evil schemes they plotted, while a terrible punishment engulfed Pharaoh’s people."
        },
        {
            "verseNumber": 46,
            "verseString": "The Fire! They will be exposed to it morning and evening, and on the Day when the Hour sets in: “Admit Pharaoh’s family into the severest of punishment.”"
        },
        {
            "verseNumber": 47,
            "verseString": "As they quarrel in the Fire, the weak will say to those who were arrogant, “We were your followers; can you then relieve us of a portion of the Fire?”"
        },
        {
            "verseNumber": 48,
            "verseString": "The arrogant will reply, “We are all in it —God has already judged among the beings.”",
            "verseStringReplacedWithAllah": "The arrogant will reply, “We are all in it —Allah has already judged among the beings.”"
        },
        {
            "verseNumber": 49,
            "verseString": "Those in the Fire will beg the keepers of Hell, “Implore your Lord to lessen our suffering for just one day.”"
        },
        {
            "verseNumber": 50,
            "verseString": "They will respond, “Didn’t your messengers come to you with clear signs?” They will reply, “Yes.” They will say, “Then pray, but the prayers of the unbelievers are only in vain.”"
        },
        {
            "verseNumber": 51,
            "verseString": "We will surely aid Our messengers and those who believe, in the worldly life and on the Day when the witnesses arise."
        },
        {
            "verseNumber": 52,
            "verseString": "The Day when their excuses won’t benefit the wrongdoers. For them is a curse, and they will have the worst dwelling."
        },
        {
            "verseNumber": 53,
            "verseString": "We gave Moses the guidance, and We made the Children of Israel inherit the Scripture."
        },
        {
            "verseNumber": 54,
            "verseString": "A guide and a reminder for people of understanding."
        },
        {
            "verseNumber": 55,
            "verseString": "So be patient, the promise of God is truth. So ask forgiveness for your sin, and glorify your Lord with praise, morning and evening.",
            "verseStringReplacedWithAllah": "So be patient, the promise of Allah is truth. So ask forgiveness for your sin, and glorify your Lord with praise, morning and evening."
        },
        {
            "verseNumber": 56,
            "verseString": "Those who dispute God’s revelations without any authority given to them, nothing resides in their breasts but vainglory which they will never achieve. So, seek refuge in God. He is the All-Hearing, the All-Seeing.",
            "verseStringReplacedWithAllah": "Those who dispute Allah’s revelations without any authority given to them, nothing resides in their breasts but vainglory which they will never achieve. So, seek refuge in Allah. He is the All-Hearing, the All-Seeing."
        },
        {
            "verseNumber": 57,
            "verseString": "The creation of the heavens and the earth is greater than the creation of humankind, but most people don’t know."
        },
        {
            "verseNumber": 58,
            "verseString": "Not equal are the blind and the seeing, nor are those who believe and perform good deeds and the wrongdoers. How little you reflect."
        },
        {
            "verseNumber": 59,
            "verseString": "The Hour is coming, there is no doubt about it, yet most people don’t believe."
        },
        {
            "verseNumber": 60,
            "verseString": "Your Lord says, “Pray to Me, and I will respond to you. Those who are too arrogant to worship Me will enter Hell humiliated.”"
        },
        {
            "verseNumber": 61,
            "verseString": "It is God who made the night for your rest and the day for visibility. God is full of Bounty to mankind, but most of them don’t give thanks.",
            "verseStringReplacedWithAllah": "It is Allah who made the night for your rest and the day for visibility. Allah is full of Bounty to mankind, but most of them don’t give thanks."
        },
        {
            "verseNumber": 62,
            "verseString": "That is God, your Lord, the Creator of all things; there is no deity but Him. So how are you deluded?",
            "verseStringReplacedWithAllah": "That is Allah, your Lord, the Creator of all things; there is no deity but Him. So how are you deluded?"
        },
        {
            "verseNumber": 63,
            "verseString": "So it is that those who deny God’s signs deviate.",
            "verseStringReplacedWithAllah": "So it is that those who deny Allah’s signs deviate."
        },
        {
            "verseNumber": 64,
            "verseString": "It is God who made the earth a dwelling for you, and the sky a structure. He formed you and perfected your forms, and provided you with good things. Such is God, your Lord. Blessed is God, the Lord of the realms.",
            "verseStringReplacedWithAllah": "It is Allah who made the earth a dwelling for you, and the sky a structure. He formed you and perfected your forms, and provided you with good things. Such is Allah, your Lord. Blessed is Allah, the Lord of the realms."
        },
        {
            "verseNumber": 65,
            "verseString": "He is the Living; there is no deity except Him. Call upon Him, dedicating your faith exclusively to Him. Praise be to God, the Lord of the worlds.",
            "verseStringReplacedWithAllah": "He is the Living; there is no deity except Him. Call upon Him, dedicating your faith exclusively to Him. Praise be to Allah, the Lord of the worlds."
        },
        {
            "verseNumber": 66,
            "verseString": "Say, “I have been forbidden to worship those you invoke apart from God, as clear proofs have come to me from my Lord, and I am commanded to submit to the Lord of the universes.”",
            "verseStringReplacedWithAllah": "Say, “I have been forbidden to worship those you invoke apart from Allah, as clear proofs have come to me from my Lord, and I am commanded to submit to the Lord of the universes.”"
        },
        {
            "verseNumber": 67,
            "verseString": "It is He who created you from dust, then from a drop, then from a clot, and then He brings you out as infants. Then, you reach your full strength. Then, you become elderly—although some of you die earlier—that you may reach a appointed term and gain understanding."
        },
        {
            "verseNumber": 68,
            "verseString": "It is He who gives life and causes death. When He decrees an affair, He says to it, “Be,” and it becomes."
        },
        {
            "verseNumber": 69,
            "verseString": "Didn’t you see how those who dispute concerning God’s verses—how are they averted?",
            "verseStringReplacedWithAllah": "Didn’t you see how those who dispute concerning Allah’s verses—how are they averted?"
        },
        {
            "verseNumber": 70,
            "verseString": "Those who deny the Scripture and what We sent Our messengers with, will indeed know."
        },
        {
            "verseNumber": 71,
            "verseString": "With shackles around their necks, and dragged by chains."
        },
        {
            "verseNumber": 72,
            "verseString": "In boiling water, then in the Fire they will be burnt."
        },
        {
            "verseNumber": 73,
            "verseString": "Then it will be said to them, “Where are those whom you used to associate?"
        },
        {
            "verseNumber": 74,
            "verseString": "Besides God?” They will reply, “They have deserted us. Actually, we were not calling upon anything before.” In this way, God lets the unbelievers go astray.",
            "verseStringReplacedWithAllah": "Besides Allah?” They will reply, “They have deserted us. Actually, we were not calling upon anything before.” In this way, Allah lets the unbelievers go astray."
        },
        {
            "verseNumber": 75,
            "verseString": "This is because you exulted in the earth baselessly, and because you were frolicking."
        },
        {
            "verseNumber": 76,
            "verseString": "Enter the gates of hell to stay therein forever—what a terrible abode for the arrogant!"
        },
        {
            "verseNumber": 77,
            "verseString": "Therefore, be patient; the promise of God is true. Whether We show you some of what We’ve promised them, or We cause you to pass away, to Us, they will be returned.",
            "verseStringReplacedWithAllah": "Therefore, be patient; the promise of Allah is true. Whether We show you some of what We’ve promised them, or We cause you to pass away, to Us, they will be returned."
        },
        {
            "verseNumber": 78,
            "verseString": "We sent messengers before you; some of their stories We’ve told you, and some We haven’t. No messenger can bring a sign except by God’s permission. When God’s decree comes, the matter will be settled in truth, and those who perpetuated falsehood will then lose.",
            "verseStringReplacedWithAllah": "We sent messengers before you; some of their stories We’ve told you, and some We haven’t. No messenger can bring a sign except by Allah’s permission. When Allah’s decree comes, the matter will be settled in truth, and those who perpetuated falsehood will then lose."
        },
        {
            "verseNumber": 79,
            "verseString": "It is God who made for you the livestock, that you may ride some of them and from some you eat.",
            "verseStringReplacedWithAllah": "It is Allah who made for you the livestock, that you may ride some of them and from some you eat."
        },
        {
            "verseNumber": 80,
            "verseString": "And you have in them other benefits too, and you fulfill your diverse needs through them. You are carried upon them, as well as on ships."
        },
        {
            "verseNumber": 81,
            "verseString": "And He shows you His signs: Which then of God’s signs will you deny?",
            "verseStringReplacedWithAllah": "And He shows you His signs: Which then of Allah’s signs will you deny?"
        },
        {
            "verseNumber": 82,
            "verseString": "Didn’t they travel through the earth and see the fate of those who preceded them? They were more numerous and powerful, having left more impressive marks on the earth, yet their achievements availed them not."
        },
        {
            "verseNumber": 83,
            "verseString": "So when their messengers came to them with clear evidence, they exulted in the knowledge they already possessed, but what they used to mock encompassed them."
        },
        {
            "verseNumber": 84,
            "verseString": "And when they saw Our wrath, they said, “We believe in God alone and reject what we were associating with Him.”",
            "verseStringReplacedWithAllah": "And when they saw Our wrath, they said, “We believe in Allah alone and reject what we were associating with Him.”"
        },
        {
            "verseNumber": 85,
            "verseString": "But their faith didn’t benefit them when they saw Our punishment. Such is God’s Law of dealing with His beings. And there, the unbelievers lost utterly.",
            "verseStringReplacedWithAllah": "But their faith didn’t benefit them when they saw Our punishment. Such is Allah’s Law of dealing with His beings. And there, the unbelievers lost utterly."
        }
    ],
    "chapterNumber": 40,
    "nameInEnglish": "Forgiver",
    "nameInTransliteration": "Ghafir",
    "nameInArabic": "غافر",
    "numberOfVerses": 85
}