{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "The Hour has drawn near, and the moon has split."
        },
        {
            "verseNumber": 2,
            "verseString": "Yet, when they witness a sign, they turn away and say, “Continuous magic.”"
        },
        {
            "verseNumber": 3,
            "verseString": "They deny and follow their whims, but all matters will be settled."
        },
        {
            "verseNumber": 4,
            "verseString": "Numerous warnings have come to them, with messages of deterrence."
        },
        {
            "verseNumber": 5,
            "verseString": "Profound wisdom, but the warnings are of no avail."
        },
        {
            "verseNumber": 6,
            "verseString": "So, withdraw from them. The Day the Caller calls to a terrible thing."
        },
        {
            "verseNumber": 7,
            "verseString": "Their eyes humbled, they will emerge from the graves, as if they were locusts spreading."
        },
        {
            "verseNumber": 8,
            "verseString": "Rushing towards the Caller. The unbelievers will say, “This is a difficult day.”"
        },
        {
            "verseNumber": 9,
            "verseString": "The people of Noah denied before them. They denied Our servant and said, “A madman,” and he was rebuked."
        },
        {
            "verseNumber": 10,
            "verseString": "So, he appealed to his Lord: “I am defeated, so help!”"
        },
        {
            "verseNumber": 11,
            "verseString": "Then We opened the doors of the sky with pouring water."
        },
        {
            "verseNumber": 12,
            "verseString": "And We burst the earth with springs, and the waters converged for a purpose predestined."
        },
        {
            "verseNumber": 13,
            "verseString": "And We carried him on a construction of planks and nails."
        },
        {
            "verseNumber": 14,
            "verseString": "Sailing under Our observation—a recompense for him who had been rejected."
        },
        {
            "verseNumber": 15,
            "verseString": "And We left it as a sign—is there anyone who will take notice?"
        },
        {
            "verseNumber": 16,
            "verseString": "So, how were My punishment and warnings?"
        },
        {
            "verseNumber": 17,
            "verseString": "We made the Quran easy to learn. Is there anyone who will learn?"
        },
        {
            "verseNumber": 18,
            "verseString": "Aad denied the truth. So, how were My punishment and warnings?"
        },
        {
            "verseNumber": 19,
            "verseString": "We unleashed upon them a screaming wind, on a day of continuous misfortune."
        },
        {
            "verseNumber": 20,
            "verseString": "Plucking people up, as if they were trunks of palm trees uprooted."
        },
        {
            "verseNumber": 21,
            "verseString": "So, how were My punishment and warnings?"
        },
        {
            "verseNumber": 22,
            "verseString": "We made the Quran easy to remember. Is there anyone who will remember?"
        },
        {
            "verseNumber": 23,
            "verseString": "Thamud rejected the warnings."
        },
        {
            "verseNumber": 24,
            "verseString": "They questioned, “Are we to follow one man from among us? Surely, we would then be in error and insanity."
        },
        {
            "verseNumber": 25,
            "verseString": "Was the message sent to him alone among us? He is a wicked liar.”"
        },
        {
            "verseNumber": 26,
            "verseString": "They will know tomorrow who the wicked liar is."
        },
        {
            "verseNumber": 27,
            "verseString": "We are sending the she-camel as a test for them. So, observe them and be patient."
        },
        {
            "verseNumber": 28,
            "verseString": "And inform them that the water is to be shared among them; each drink will be provided in turn."
        },
        {
            "verseNumber": 29,
            "verseString": "Yet, they called their companion, and he dared and hamstrung."
        },
        {
            "verseNumber": 30,
            "verseString": "So, how were My punishment and warnings?"
        },
        {
            "verseNumber": 31,
            "verseString": "We sent them a single shriek, and they became like crushed trampled straw."
        },
        {
            "verseNumber": 32,
            "verseString": "We made the Quran easy to understand. Is there anyone who will understand?"
        },
        {
            "verseNumber": 33,
            "verseString": "The people of Lot denied the warnings."
        },
        {
            "verseNumber": 34,
            "verseString": "We rained upon them a shower of stones, except for the family of Lot, We saved them early morning."
        },
        {
            "verseNumber": 35,
            "verseString": "As a blessing from Us. Thus, do We reward those who give thanks."
        },
        {
            "verseNumber": 36,
            "verseString": "He had warned them of Our onslaught, but they disputed the warnings."
        },
        {
            "verseNumber": 37,
            "verseString": "They even demanded his guests from him, so We obliterated their eyes. “Taste My punishment and warnings.”"
        },
        {
            "verseNumber": 38,
            "verseString": "Morning brought them unrelenting suffering."
        },
        {
            "verseNumber": 39,
            "verseString": "So taste My punishment and warnings."
        },
        {
            "verseNumber": 40,
            "verseString": "We made the Quran easy to memorize. Is there anyone who will memorize?"
        },
        {
            "verseNumber": 41,
            "verseString": "Warnings had come to the House of Pharaoh."
        },
        {
            "verseNumber": 42,
            "verseString": "They rejected all Our signs, so We seized them with the grip of an Almighty Omnipotent."
        },
        {
            "verseNumber": 43,
            "verseString": "Are your unbelievers better than those? Or do you have immunity in the Scriptures?"
        },
        {
            "verseNumber": 44,
            "verseString": "Or do they say, “We are a united multitude, bound for victory”?"
        },
        {
            "verseNumber": 45,
            "verseString": "The multitude will be defeated, and they will turn their backs and flee."
        },
        {
            "verseNumber": 46,
            "verseString": "Their appointed moment is the Hour. The Hour is most catastrophic and bitter."
        },
        {
            "verseNumber": 47,
            "verseString": "The criminals are in disarray and madness."
        },
        {
            "verseNumber": 48,
            "verseString": "On that Day, they will be pulled, face-down, into the Fire: “Taste the touch of Hell.”"
        },
        {
            "verseNumber": 49,
            "verseString": "We created everything according to a precise measure."
        },
        {
            "verseNumber": 50,
            "verseString": "Our command is but one, as the blink of an eye."
        },
        {
            "verseNumber": 51,
            "verseString": "We’ve destroyed the likes of you. Is there anyone who will reflect?"
        },
        {
            "verseNumber": 52,
            "verseString": "And everything they’ve done is in the records."
        },
        {
            "verseNumber": 53,
            "verseString": "Every minor and major detail is written down."
        },
        {
            "verseNumber": 54,
            "verseString": "The righteous will be in gardens and rivers."
        },
        {
            "verseNumber": 55,
            "verseString": "In a seat of truth, in the presence of an Omnipotent King."
        }
    ],
    "chapterNumber": 54,
    "nameInEnglish": "The Moon",
    "nameInTransliteration": "Al Qamar",
    "nameInArabic": "الـقمـر",
    "numberOfVerses": 55
}