{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Say, “It was revealed to me that a band of jinn listened, then declared, ‘We heard an amazing Quran."
        },
        {
            "verseNumber": 2,
            "verseString": "It guides towards righteousness, so we have believed in it, and we won’t associate anyone with our Lord."
        },
        {
            "verseNumber": 3,
            "verseString": "And exalted is the majesty of our Lord; He has not taken a female friend, nor a son."
        },
        {
            "verseNumber": 4,
            "verseString": "Yet, the foolish among us have spoken nonsense about God.",
            "verseStringReplacedWithAllah": "Yet, the foolish among us have spoken nonsense about Allah."
        },
        {
            "verseNumber": 5,
            "verseString": "We had thought that mankind and the jinn would never utter lies against God.",
            "verseStringReplacedWithAllah": "We had thought that mankind and the jinn would never utter lies against Allah."
        },
        {
            "verseNumber": 6,
            "verseString": "Certain humans used to seek help from the men of the jinn, which only exacerbated their fear and fatigue."
        },
        {
            "verseNumber": 7,
            "verseString": "And they had presumed, as you presumed, that God would not resurrect anyone.",
            "verseStringReplacedWithAllah": "And they had presumed, as you presumed, that Allah would not resurrect anyone."
        },
        {
            "verseNumber": 8,
            "verseString": "We probed the heavens and found them with stern guards and flaming meteors."
        },
        {
            "verseNumber": 9,
            "verseString": "We used to occupy places there to eavesdrop. But now, whoever attempts to listen finds a blazing meteor lying in wait for him."
        },
        {
            "verseNumber": 10,
            "verseString": "And we don’t know whether ill is intended for those on earth, or whether their Lord intends for them a right path."
        },
        {
            "verseNumber": 11,
            "verseString": "Among us are the righteous, and among us are less than that; we follow diverse paths."
        },
        {
            "verseNumber": 12,
            "verseString": "And we’ve realized that we can’t defeat God on earth, and that we can’t escape Him by flight.",
            "verseStringReplacedWithAllah": "And we’ve realized that we can’t defeat Allah on earth, and that we can’t escape Him by flight."
        },
        {
            "verseNumber": 13,
            "verseString": "Upon hearing the guidance, we believed in it. Whoever believes in his Lord fears neither loss nor oppression."
        },
        {
            "verseNumber": 14,
            "verseString": "Among us are the submitters, and among us are the deviants. Those who submit have found the path of righteousness."
        },
        {
            "verseNumber": 15,
            "verseString": "As for the deviants, they will be fuel for Hellfire.”"
        },
        {
            "verseNumber": 16,
            "verseString": "Had they remained on the path, We would have provided them with abundant water to drink."
        },
        {
            "verseNumber": 17,
            "verseString": "To test them thereby. Whoever turns away from his Lord’s remembrance, He will subject him to escalating suffering."
        },
        {
            "verseNumber": 18,
            "verseString": "The places of worship are for God. Don’t call upon anyone else alongside God.",
            "verseStringReplacedWithAllah": "The places of worship are for Allah. Don’t call upon anyone else alongside Allah."
        },
        {
            "verseNumber": 19,
            "verseString": "When God’s servant stood up, calling upon Him, they nearly mobbed him in aggression.",
            "verseStringReplacedWithAllah": "When Allah’s servant stood up, calling upon Him, they nearly mobbed him in aggression."
        },
        {
            "verseNumber": 20,
            "verseString": "Say, “I only pray to my Lord, and I associate none with Him.”"
        },
        {
            "verseNumber": 21,
            "verseString": "Say, “I hold no power over harm or righteousness for you.”"
        },
        {
            "verseNumber": 22,
            "verseString": "Say, “No one can protect me from God, nor can I find refuge apart from Him.",
            "verseStringReplacedWithAllah": "Say, “No one can protect me from Allah, nor can I find refuge apart from Him."
        },
        {
            "verseNumber": 23,
            "verseString": "My only duty is to convey God’s revelations. Whoever disobeys God and His Messenger will reside eternally in the blistering flames of Hell.”",
            "verseStringReplacedWithAllah": "My only duty is to convey Allah’s revelations. Whoever disobeys Allah and His Messenger will reside eternally in the blistering flames of Hell.”"
        },
        {
            "verseNumber": 24,
            "verseString": "Until, when they see what they were promised, they will realize who was weaker in helpers and lesser in number."
        },
        {
            "verseNumber": 25,
            "verseString": "Say, “I don’t know whether what you’ve been promised is near, or if my Lord has set a distant time for it.”"
        },
        {
            "verseNumber": 26,
            "verseString": "He is the Knower of the unseen, and He doesn’t disclose His unseen to anyone."
        },
        {
            "verseNumber": 27,
            "verseString": "Except to a messenger whom He approves of, then He posts sentinels before him and behind him."
        },
        {
            "verseNumber": 28,
            "verseString": "That He may ascertain that they delivered their Lord’s messages. He surrounds all that they have, and He keeps count of all things."
        }
    ],
    "chapterNumber": 72,
    "nameInEnglish": "The Jinn",
    "nameInTransliteration": "Al Jinn",
    "nameInArabic": "الجن",
    "numberOfVerses": 28
}