{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Saad. By the Quran abundant in reminders."
        },
        {
            "verseNumber": 2,
            "verseString": "But the unbelievers are steeped in arrogance and defiance."
        },
        {
            "verseNumber": 3,
            "verseString": "How many generations before them did We destroy? They screamed, but it was too late for escape."
        },
        {
            "verseNumber": 4,
            "verseString": "They marvel that a warner has come to them from amongst themselves. The unbelievers have said, “This is a magician, a liar.”"
        },
        {
            "verseNumber": 5,
            "verseString": "“Did he turn all the gods into one God? This is something strange.”"
        },
        {
            "verseNumber": 6,
            "verseString": "Their leaders set out, saying, “Walk away, and remain loyal to your gods. This is something which is designed."
        },
        {
            "verseNumber": 7,
            "verseString": "We’ve never heard of this in the previous religion. This is nothing but an invented tale."
        },
        {
            "verseNumber": 8,
            "verseString": "Was the message sent exclusively to him among us?” They are in doubt about My message. They haven’t yet tasted My punishment."
        },
        {
            "verseNumber": 9,
            "verseString": "Do they hold the keys to the treasures of your Lord’s mercy—the Majestic, the Giver?"
        },
        {
            "verseNumber": 10,
            "verseString": "Do they possess the heavens, the earth, and everything in between? Let them ascend through any means they can."
        },
        {
            "verseNumber": 11,
            "verseString": "An army of allies will be defeated there."
        },
        {
            "verseNumber": 12,
            "verseString": "Before them, the people of Noah, Aad, and Pharaoh of the Stakes, all denied the truth."
        },
        {
            "verseNumber": 13,
            "verseString": "So did Thamud, the people of Lot, and the dwellers of the woods—these were the alliances."
        },
        {
            "verseNumber": 14,
            "verseString": "All of them denied the messengers, so my retribution was justified."
        },
        {
            "verseNumber": 15,
            "verseString": "They await but a single blast, from which there is no recovery."
        },
        {
            "verseNumber": 16,
            "verseString": "They demand, “Our Lord, expedite our portion before the Day of Reckoning.”"
        },
        {
            "verseNumber": 17,
            "verseString": "Be patient over what they say, and remember Our servant David, the man of strength; he was devout."
        },
        {
            "verseNumber": 18,
            "verseString": "We subjected the mountains to him, praising at twilight and at dawn."
        },
        {
            "verseNumber": 19,
            "verseString": "And the birds gathered, all are attentive to him."
        },
        {
            "verseNumber": 20,
            "verseString": "We strengthened his kingdom and granted him wisdom and decisive speech."
        },
        {
            "verseNumber": 21,
            "verseString": "Did you hear of the litigants who scaled the sanctuary?"
        },
        {
            "verseNumber": 22,
            "verseString": "They startled David when they entered upon him. They said, “Fear not. We are two litigants; one has wronged the other. Judge justly between us, show no bias, and guide us to the right way.”"
        },
        {
            "verseNumber": 23,
            "verseString": "“My brother has ninety-nine ewes, while I have only one. Yet he insisted, ‘Entrust it to me,’ and he overpowered me in speech.”"
        },
        {
            "verseNumber": 24,
            "verseString": "He responded, “He wronged you by demanding your single ewe be added to his flock. Indeed, many associates wrong one another, except for those who believe and do righteous deeds, and they are few.” Then David realized that We were testing him, so he asked forgiveness from his Lord, fell prostrate, and he turned in repentance."
        },
        {
            "verseNumber": 25,
            "verseString": "We forgave him for that. He holds a position of closeness to Us and a beautiful destination."
        },
        {
            "verseNumber": 26,
            "verseString": "“O David, We made you a successor on earth, so judge between people with justice, and don’t follow desire, lest it diverts you from God’s way. Those who stray from God’s way will face a severe punishment for forgetting the Day of Account.”",
            "verseStringReplacedWithAllah": "“O David, We made you a successor on earth, so judge between people with justice, and don’t follow desire, lest it diverts you from Allah’s way. Those who stray from Allah’s way will face a severe punishment for forgetting the Day of Account.”"
        },
        {
            "verseNumber": 27,
            "verseString": "We didn’t create the heavens, the earth, and everything between them in vain. That’s the misconception of those who disbelieve—woe to the unbelievers from the Fire."
        },
        {
            "verseNumber": 28,
            "verseString": "Shall We treat those who believe and perform righteous deeds the same as those who spread corruption on earth? Or should We treat the devout as the wicked?"
        },
        {
            "verseNumber": 29,
            "verseString": "We revealed to you a blessed Book, so they may ponder its verses, and those with discernment may reflect."
        },
        {
            "verseNumber": 30,
            "verseString": "To David, We granted Solomon—a good servant, deeply devoted."
        },
        {
            "verseNumber": 31,
            "verseString": "One evening, fine horses were paraded before him."
        },
        {
            "verseNumber": 32,
            "verseString": "He said, “I have loved material wealth over the remembrance of my Lord—until they disappeared from sight."
        },
        {
            "verseNumber": 33,
            "verseString": "Bring them back to me.” And he began to stroke their legs and necks."
        },
        {
            "verseNumber": 34,
            "verseString": "We tested Solomon, and We placed a figure on his throne. Then he turned back."
        },
        {
            "verseNumber": 35,
            "verseString": "He prayed, “My Lord, forgive me, and grant me a kingdom that none after me can attain; You are the Bestower.”"
        },
        {
            "verseNumber": 36,
            "verseString": "So, We subjected the wind to his command, flowing gently at his discretion."
        },
        {
            "verseNumber": 37,
            "verseString": "And also the demons—every builder and diver."
        },
        {
            "verseNumber": 38,
            "verseString": "And others shackled in chains."
        },
        {
            "verseNumber": 39,
            "verseString": "“This is Our gift, so dispense or withhold, without account.”"
        },
        {
            "verseNumber": 40,
            "verseString": "He holds a position of proximity to Us, and a beautiful final destination."
        },
        {
            "verseNumber": 41,
            "verseString": "And remember Our servant Job, who appealed to his Lord: “Satan afflicted me with hardship and suffering.”"
        },
        {
            "verseNumber": 42,
            "verseString": "“Strike with your foot. Here is cool water for washing and drinking.”"
        },
        {
            "verseNumber": 43,
            "verseString": "We restored his family to him, and the same with them, as a mercy from Us, and a lesson for those with understanding."
        },
        {
            "verseNumber": 44,
            "verseString": "“And take in your hand a bundle and strike with it, and don’t break your oath.” We found him patient. What an excellent servant he was, always returning."
        },
        {
            "verseNumber": 45,
            "verseString": "And mention Our servants Abraham, Isaac, and Jacob, possessors of strength and insight."
        },
        {
            "verseNumber": 46,
            "verseString": "We granted them a unique favor—the remembrance of the Home."
        },
        {
            "verseNumber": 47,
            "verseString": "They are among Our chosen ones, the outstanding."
        },
        {
            "verseNumber": 48,
            "verseString": "Also remember Ishmael, Elisha, and Ezekiel. Each of them was among the excellent."
        },
        {
            "verseNumber": 49,
            "verseString": "This is a reminder. For the virtuous, there is a beautiful place of return."
        },
        {
            "verseNumber": 50,
            "verseString": "Gardens of Eternity, the gates of which will be open to them."
        },
        {
            "verseNumber": 51,
            "verseString": "Reclining therein, they will call for ample fruit and drink."
        },
        {
            "verseNumber": 52,
            "verseString": "Along with them will be chaste women with modest gaze, of equal age."
        },
        {
            "verseNumber": 53,
            "verseString": "This is what you are promised for the Day of Reckoning."
        },
        {
            "verseNumber": 54,
            "verseString": "This is Our provision, which has no end."
        },
        {
            "verseNumber": 55,
            "verseString": "But for the transgressors, there will be a dreadful place of return."
        },
        {
            "verseNumber": 56,
            "verseString": "Hell—where they will burn, a horrific resting place."
        },
        {
            "verseNumber": 57,
            "verseString": "Let them taste it—boiling water and bitter cold."
        },
        {
            "verseNumber": 58,
            "verseString": "And other torments of a similar kind."
        },
        {
            "verseNumber": 59,
            "verseString": "Here is a group rushing headlong with you. They shall roast in the Fire."
        },
        {
            "verseNumber": 60,
            "verseString": "They will cry out, “No, you are not welcome! It is you who prepared this for us. What a terrible destination!”"
        },
        {
            "verseNumber": 61,
            "verseString": "Then they will plead, “Our Lord, whoever led us to this, increase his suffering in the Fire.”"
        },
        {
            "verseNumber": 62,
            "verseString": "They will ask, “Why don’t we see those we considered evil?"
        },
        {
            "verseNumber": 63,
            "verseString": "Were we mistaken in mocking them, or did our eyes fail to recognize them?”"
        },
        {
            "verseNumber": 64,
            "verseString": "This is the quarrel among the dwellers of the Fire."
        },
        {
            "verseNumber": 65,
            "verseString": "Say, “I am only a warner, and there is no god except God, the Singular, the Prevailing.",
            "verseStringReplacedWithAllah": "Say, “I am only a warner, and there is no god except Allah, the Singular, the Prevailing."
        },
        {
            "verseNumber": 66,
            "verseString": "The Lord of the heavens and the earth, and whatever is between them, the Mighty, the Forgiving.”"
        },
        {
            "verseNumber": 67,
            "verseString": "Say, “This is a significant message."
        },
        {
            "verseNumber": 68,
            "verseString": "From which you are turning away."
        },
        {
            "verseNumber": 69,
            "verseString": "I have no knowledge of the Exalted Assembly when they argue."
        },
        {
            "verseNumber": 70,
            "verseString": "It has only been revealed to me that I am a clear warner.”"
        },
        {
            "verseNumber": 71,
            "verseString": "When your Lord told the angels, “I am creating a human being from clay."
        },
        {
            "verseNumber": 72,
            "verseString": "Once I have shaped him and breathed into him of My Spirit, prostrate before him.”"
        },
        {
            "verseNumber": 73,
            "verseString": "So the angels prostrated all of them together."
        },
        {
            "verseNumber": 74,
            "verseString": "Except for Iblis—he was arrogant and became one of the unbelievers."
        },
        {
            "verseNumber": 75,
            "verseString": "He questioned, “O Iblis, what prevented you from prostrating before the one I created with My hands? Are you too proud, or are you of high rank?”"
        },
        {
            "verseNumber": 76,
            "verseString": "He answered, “I am better than him. You created me from fire, while You created him from clay.”"
        },
        {
            "verseNumber": 77,
            "verseString": "He commanded, “Then get out of here, for you are an outcast, banished."
        },
        {
            "verseNumber": 78,
            "verseString": "And My curse will be upon you until Judgement Day.”"
        },
        {
            "verseNumber": 79,
            "verseString": "He said, “My Lord, allow me to remain until the Day they’re resurrected.”"
        },
        {
            "verseNumber": 80,
            "verseString": "He responded, “You are allowed to remain."
        },
        {
            "verseNumber": 81,
            "verseString": "Until the day of the well-known time.”"
        },
        {
            "verseNumber": 82,
            "verseString": "He vowed, “By Your might, I will surely seduce them all."
        },
        {
            "verseNumber": 83,
            "verseString": "Except for Your devoted servants among them.”"
        },
        {
            "verseNumber": 84,
            "verseString": "He said, “The truth and only the truth I speak."
        },
        {
            "verseNumber": 85,
            "verseString": "I will fill Hell with you and with those of them who follow you—all together.”"
        },
        {
            "verseNumber": 86,
            "verseString": "Say, “I ask no reward from you for this, nor am I a pretender."
        },
        {
            "verseNumber": 87,
            "verseString": "It is but a reminder for the world."
        },
        {
            "verseNumber": 88,
            "verseString": "And you will know its news after a while.”"
        }
    ],
    "chapterNumber": 38,
    "nameInEnglish": "Saad",
    "nameInTransliteration": "Saad",
    "nameInArabic": "ص",
    "numberOfVerses": 88
}