{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "O Prophet, be aware of God, and don’t obey the unbelievers and the hypocrites. God is All-Knowing, Most Wise.",
            "verseStringReplacedWithAllah": "O Prophet, be aware of Allah, and don’t obey the unbelievers and the hypocrites. Allah is All-Knowing, Most Wise."
        },
        {
            "verseNumber": 2,
            "verseString": "Follow what has been revealed to you from your Lord, for God is fully aware of what you do.",
            "verseStringReplacedWithAllah": "Follow what has been revealed to you from your Lord, for Allah is fully aware of what you do."
        },
        {
            "verseNumber": 3,
            "verseString": "And trust in God; and sufficient is God as Disposer of affairs.",
            "verseStringReplacedWithAllah": "And trust in Allah; and sufficient is Allah as Disposer of affairs."
        },
        {
            "verseNumber": 4,
            "verseString": "God didn’t place two hearts within any man’s body. He didn’t make your wives, whom you equate with your mothers, your actual mothers. Nor did He make your adopted children, your actual children. These are but words from your mouths. God speaks the truth, and He guides along the path.",
            "verseStringReplacedWithAllah": "Allah didn’t place two hearts within any man’s body. He didn’t make your wives, whom you equate with your mothers, your actual mothers. Nor did He make your adopted children, your actual children. These are but words from your mouths. Allah speaks the truth, and He guides along the path."
        },
        {
            "verseNumber": 5,
            "verseString": "Name them after their fathers; this is more equitable in God’s sight. If you don’t know their fathers, they are your brothers in faith and dependents. There is no blame upon you for the mistakes you make, but only for what your hearts purposely intend. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "Name them after their fathers; this is more equitable in Allah’s sight. If you don’t know their fathers, they are your brothers in faith and dependents. There is no blame upon you for the mistakes you make, but only for what your hearts purposely intend. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 6,
            "verseString": "The Prophet is closer to the believers than themselves, and his wives are mothers to them. As decreed by God, blood relatives have greater rights over each other than the believers and the emigrants. However, you are still obligated to treat your friends kindly. This is inscribed in the Scripture.",
            "verseStringReplacedWithAllah": "The Prophet is closer to the believers than themselves, and his wives are mothers to them. As decreed by Allah, blood relatives have greater rights over each other than the believers and the emigrants. However, you are still obligated to treat your friends kindly. This is inscribed in the Scripture."
        },
        {
            "verseNumber": 7,
            "verseString": "We received a solemn oath from the Prophets, including you, Noah, Abraham, Moses, and Jesus, son of Mary. We received from them a firm covenant."
        },
        {
            "verseNumber": 8,
            "verseString": "He will then question the truthful about their truthfulness, and He prepared a severe punishment for the unbelievers."
        },
        {
            "verseNumber": 9,
            "verseString": "O you who believe, remember God’s favor upon you, when armies advanced against you, and We sent upon them a wind and forces you didn’t see. God is watchful of all your actions.",
            "verseStringReplacedWithAllah": "O you who believe, remember Allah’s favor upon you, when armies advanced against you, and We sent upon them a wind and forces you didn’t see. Allah is watchful of all your actions."
        },
        {
            "verseNumber": 10,
            "verseString": "When they advanced upon you from above and below, your vision blurred, your hearts reached the throats, and you began to doubt God.",
            "verseStringReplacedWithAllah": "When they advanced upon you from above and below, your vision blurred, your hearts reached the throats, and you began to doubt Allah."
        },
        {
            "verseNumber": 11,
            "verseString": "There, the believers were tested and severely shaken."
        },
        {
            "verseNumber": 12,
            "verseString": "The hypocrites and those with diseased hearts said, “God and His Messenger promised us nothing but delusions.”",
            "verseStringReplacedWithAllah": "The hypocrites and those with diseased hearts said, “Allah and His Messenger promised us nothing but delusions.”"
        },
        {
            "verseNumber": 13,
            "verseString": "Among them, some said, “O people of Yathrib, you can’t withstand, so retreat.” Meanwhile, others sought permission from the Prophet, saying, “Our homes are exposed,” when they were not. They only intended to flee."
        },
        {
            "verseNumber": 14,
            "verseString": "If they had been invaded from all sides, and they were incited to sedition, they would’ve indulged in it."
        },
        {
            "verseNumber": 15,
            "verseString": "They had previously made a covenant with God that they wouldn’t turn their backs. The covenant with God must be answered for.",
            "verseStringReplacedWithAllah": "They had previously made a covenant with Allah that they wouldn’t turn their backs. The covenant with Allah must be answered for."
        },
        {
            "verseNumber": 16,
            "verseString": "Say, “Fleeing won’t benefit you, if you flee from death or killing. Even then, you would be indulged only a little.”"
        },
        {
            "verseNumber": 17,
            "verseString": "Say, “Who can protect you from God if He intends harm or mercy for you?” They will find no ally or helper besides God.",
            "verseStringReplacedWithAllah": "Say, “Who can protect you from Allah if He intends harm or mercy for you?” They will find no ally or helper besides Allah."
        },
        {
            "verseNumber": 18,
            "verseString": "God knows those among you who discourage others and those who say to their brethren, “Come to us,” yet they seldom engage in battle.",
            "verseStringReplacedWithAllah": "Allah knows those among you who discourage others and those who say to their brethren, “Come to us,” yet they seldom engage in battle."
        },
        {
            "verseNumber": 19,
            "verseString": "They are reluctant to support you. When danger looms, you see them staring at you, their eyes rolling, as if they are on the verge of death. Yet, when the threat subsides, they lash you with sharp tongues, greedy for the good. These were never believers, so God nullified their deeds, a task effortless for God.",
            "verseStringReplacedWithAllah": "They are reluctant to support you. When danger looms, you see them staring at you, their eyes rolling, as if they are on the verge of death. Yet, when the threat subsides, they lash you with sharp tongues, greedy for the good. These were never believers, so Allah nullified their deeds, a task effortless for Allah."
        },
        {
            "verseNumber": 20,
            "verseString": "They assumed that the Confederates wouldn’t retreat. If the Confederates were to return, they would wish they were amongst the Bedouins in the desert, seeking news about you. If they were with you, they would hardly engage in battle."
        },
        {
            "verseNumber": 21,
            "verseString": "In God’s Messenger, you have an excellent example for those who hope for God and the Last Day and remember God often.",
            "verseStringReplacedWithAllah": "In Allah’s Messenger, you have an excellent example for those who hope for Allah and the Last Day and remember Allah often."
        },
        {
            "verseNumber": 22,
            "verseString": "Upon seeing the Confederate forces, the believers said, “This is what God and His Messenger promised us; truly, God and His Messenger spoke the truth.” It only increased them in faith and submission.",
            "verseStringReplacedWithAllah": "Upon seeing the Confederate forces, the believers said, “This is what Allah and His Messenger promised us; truly, Allah and His Messenger spoke the truth.” It only increased them in faith and submission."
        },
        {
            "verseNumber": 23,
            "verseString": "Among the believers are men who have been true to their covenant with God. Some of them have met their obligations, and some are still waiting, unwavering in their commitment.",
            "verseStringReplacedWithAllah": "Among the believers are men who have been true to their covenant with Allah. Some of them have met their obligations, and some are still waiting, unwavering in their commitment."
        },
        {
            "verseNumber": 24,
            "verseString": "That God may reward the truthful for their truthfulness, and He may punish the hypocrites if He wills or accept their repentance. God is Forgiving, Most Merciful.",
            "verseStringReplacedWithAllah": "That Allah may reward the truthful for their truthfulness, and He may punish the hypocrites if He wills or accept their repentance. Allah is Forgiving, Most Merciful."
        },
        {
            "verseNumber": 25,
            "verseString": "And God repulsed those who disbelieved, in their rage; they gained no advantage. God was sufficient for the believers in battle. God is Powerful, Most Dignified.",
            "verseStringReplacedWithAllah": "And Allah repulsed those who disbelieved, in their rage; they gained no advantage. Allah was sufficient for the believers in battle. Allah is Powerful, Most Dignified."
        },
        {
            "verseNumber": 26,
            "verseString": "He brought down those who supported them among the People of the Scripture from their fortresses, and He cast terror into their hearts. You killed some and took others as captives."
        },
        {
            "verseNumber": 27,
            "verseString": "He let you inherit their lands, their houses, their wealth, and lands you had not trodden. God has power over all things.",
            "verseStringReplacedWithAllah": "He let you inherit their lands, their houses, their wealth, and lands you had not trodden. Allah has power over all things."
        },
        {
            "verseNumber": 28,
            "verseString": "O Prophet, tell your wives, “If you desire the worldly life and its glitter, then come; I will provide for you and release you honorably."
        },
        {
            "verseNumber": 29,
            "verseString": "But if you wish for God and His Messenger and the Home of the Hereafter, then indeed, God has prepared for those who do good among you an immense reward.",
            "verseStringReplacedWithAllah": "But if you wish for Allah and His Messenger and the Home of the Hereafter, then indeed, Allah has prepared for those who do good among you an immense reward."
        },
        {
            "verseNumber": 30,
            "verseString": "O wives of the Prophet, those who commit a clear immorality among you, doubled will be her suffering, and that is easy for God.",
            "verseStringReplacedWithAllah": "O wives of the Prophet, those who commit a clear immorality among you, doubled will be her suffering, and that is easy for Allah."
        },
        {
            "verseNumber": 31,
            "verseString": "And whoever of you devoutly obeys God and His messenger and does good, We will give her her reward twice over, and We have prepared for her a noble provision.",
            "verseStringReplacedWithAllah": "And whoever of you devoutly obeys Allah and His messenger and does good, We will give her her reward twice over, and We have prepared for her a noble provision."
        },
        {
            "verseNumber": 32,
            "verseString": "O wives of the Prophet, you are unlike any other women if you uphold righteousness. Therefore, don’t be seductive in speech, lest he in whose heart is a disease should desire, but speak with appropriate speech."
        },
        {
            "verseNumber": 33,
            "verseString": "Settle in your homes, and don’t flaunt your beauty, as in the former days of ignorance. Establish prayer, give the purifying charity, and obey God and His Messenger. God intends to remove all impurities from you, O People of the Household, and to purify you thoroughly.",
            "verseStringReplacedWithAllah": "Settle in your homes, and don’t flaunt your beauty, as in the former days of ignorance. Establish prayer, give the purifying charity, and obey Allah and His Messenger. Allah intends to remove all impurities from you, O People of the Household, and to purify you thoroughly."
        },
        {
            "verseNumber": 34,
            "verseString": "Be mindful of what’s recited in your homes of God’s verses and wisdom. God is always Kind and Well-Informed.",
            "verseStringReplacedWithAllah": "Be mindful of what’s recited in your homes of Allah’s verses and wisdom. Allah is always Kind and Well-Informed."
        },
        {
            "verseNumber": 35,
            "verseString": "The submissive men and women, the believing men and women, the devout men and women, the honest men and women, the patient men and women, the humble men and women, the charitable men and women, the fasting men and women, the men and women who guard their chastity, and the men and women who frequently remember God—for them, God has prepared forgiveness and a great reward.",
            "verseStringReplacedWithAllah": "The submissive men and women, the believing men and women, the devout men and women, the honest men and women, the patient men and women, the humble men and women, the charitable men and women, the fasting men and women, the men and women who guard their chastity, and the men and women who frequently remember Allah—for them, Allah has prepared forgiveness and a great reward."
        },
        {
            "verseNumber": 36,
            "verseString": "Believers, both men and women, have no right to question the decisions made by God and His Messenger. Those who disobey God and His Messenger have deviated into clear error.",
            "verseStringReplacedWithAllah": "Believers, both men and women, have no right to question the decisions made by Allah and His Messenger. Those who disobey Allah and His Messenger have deviated into clear error."
        },
        {
            "verseNumber": 37,
            "verseString": "You said to the one whom God had favored and you had favored, “Keep your wife and fear God,” while concealing within yourself what God was going to reveal. You feared people, but it is more appropriate that you fear God. Then, when Zaid had dissolved his marriage with her, We wedded her to you, so that there would be no fault in believers marrying the divorced wives of their adopted sons. God’s command is always fulfilled.",
            "verseStringReplacedWithAllah": "You said to the one whom Allah had favored and you had favored, “Keep your wife and fear Allah,” while concealing within yourself what Allah was going to reveal. You feared people, but it is more appropriate that you fear Allah. Then, when Zaid had dissolved his marriage with her, We wedded her to you, so that there would be no fault in believers marrying the divorced wives of their adopted sons. Allah’s command is always fulfilled."
        },
        {
            "verseNumber": 38,
            "verseString": "The Prophet is not liable for what God has ordained for him. This is God’s established way with those who came before. The command of God is a destiny determined.",
            "verseStringReplacedWithAllah": "The Prophet is not liable for what Allah has ordained for him. This is Allah’s established way with those who came before. The command of Allah is a destiny determined."
        },
        {
            "verseNumber": 39,
            "verseString": "Those who convey God’s messages, fear Him, and fear none but God. God is sufficient as a Reckoner.",
            "verseStringReplacedWithAllah": "Those who convey Allah’s messages, fear Him, and fear none but Allah. Allah is sufficient as a Reckoner."
        },
        {
            "verseNumber": 40,
            "verseString": "Muhammad is not the father of any man among you, but he is God’s Messenger and the Prophets’ seal. God has full knowledge of all things.",
            "verseStringReplacedWithAllah": "Muhammad is not the father of any man among you, but he is Allah’s Messenger and the Prophets’ seal. Allah has full knowledge of all things."
        },
        {
            "verseNumber": 41,
            "verseString": "O you who believe, remember God with much remembrance.",
            "verseStringReplacedWithAllah": "O you who believe, remember Allah with much remembrance."
        },
        {
            "verseNumber": 42,
            "verseString": "And praise Him morning and evening."
        },
        {
            "verseNumber": 43,
            "verseString": "It is He who reaches out to you, and His angels, to bring you from darkness into light. He is ever Merciful to the believers."
        },
        {
            "verseNumber": 44,
            "verseString": "Their greeting on the Day they meet Him will be “Peace,” and He prepared for them a generous reward."
        },
        {
            "verseNumber": 45,
            "verseString": "O Prophet, We sent you as a witness, a bearer of good news, and a warner."
        },
        {
            "verseNumber": 46,
            "verseString": "Inviting to God by His permission, and as a luminous lamp.",
            "verseStringReplacedWithAllah": "Inviting to Allah by His permission, and as a luminous lamp."
        },
        {
            "verseNumber": 47,
            "verseString": "Give the believers the good news of God’s abundant grace.",
            "verseStringReplacedWithAllah": "Give the believers the good news of Allah’s abundant grace."
        },
        {
            "verseNumber": 48,
            "verseString": "Don’t obey the unbelievers and the hypocrites; dismiss their annoyances, and rely on God. God is sufficient as a Protector.",
            "verseStringReplacedWithAllah": "Don’t obey the unbelievers and the hypocrites; dismiss their annoyances, and rely on Allah. Allah is sufficient as a Protector."
        },
        {
            "verseNumber": 49,
            "verseString": "O you who believe, when you marry believing women and then divorce them before you have touched them, you have no obligation to observe a waiting period for them. Provide for them, and release them graciously."
        },
        {
            "verseNumber": 50,
            "verseString": "O Prophet, We’ve made lawful for you your wives to whom you’ve given their due compensation, and what your right hand possesses from what God has granted you. Also, the daughters of your paternal uncle, and the daughters of your paternal aunts, and the daughters of your maternal uncle, and the daughters of your maternal aunts who migrated with you. Additionally, a believing woman who offered herself to the Prophet, if the Prophet desires to marry her—exclusively for you, not for the other believers. We certainly know what We ordained for them regarding their wives and those their right hands possess, so that there may be no discomfort for you. God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "O Prophet, We’ve made lawful for you your wives to whom you’ve given their due compensation, and what your right hand possesses from what Allah has granted you. Also, the daughters of your paternal uncle, and the daughters of your paternal aunts, and the daughters of your maternal uncle, and the daughters of your maternal aunts who migrated with you. Additionally, a believing woman who offered herself to the Prophet, if the Prophet desires to marry her—exclusively for you, not for the other believers. We certainly know what We ordained for them regarding their wives and those their right hands possess, so that there may be no discomfort for you. Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 51,
            "verseString": "You may postpone any of those you wish, and you may receive anyone you wish. There is no blame on you if you invite one whose turn you had previously set aside. This is more appropriate, so that they may be comforted, not saddened, and may all be pleased with what you give them. God knows what’s in your hearts. God is All-Knowing, Most Forbearing.",
            "verseStringReplacedWithAllah": "You may postpone any of those you wish, and you may receive anyone you wish. There is no blame on you if you invite one whose turn you had previously set aside. This is more appropriate, so that they may be comforted, not saddened, and may all be pleased with what you give them. Allah knows what’s in your hearts. Allah is All-Knowing, Most Forbearing."
        },
        {
            "verseNumber": 52,
            "verseString": "No women are lawful for you after this, nor can you exchange them for other wives, even if their beauty captivates you, except what your right hand possesses. God is watchful over everything.",
            "verseStringReplacedWithAllah": "No women are lawful for you after this, nor can you exchange them for other wives, even if their beauty captivates you, except what your right hand possesses. Allah is watchful over everything."
        },
        {
            "verseNumber": 53,
            "verseString": "O you who believe, don’t enter the Prophet’s homes for a meal, unless you are invited, and don’t wait for its preparation. But if you are invited, then enter. And when you have eaten, then disperse, not lingering for conversation. This behavior may cause the Prophet discomfort, and he would be shy to dismiss you, but God is not shy of the truth. When you ask his wives for something, do so from behind a partition. This is purer for your hearts and theirs. It is not suitable for you to offend God’s Messenger, nor should you ever marry his wives after him. Indeed, this would be a grave offense in God’s sight.",
            "verseStringReplacedWithAllah": "O you who believe, don’t enter the Prophet’s homes for a meal, unless you are invited, and don’t wait for its preparation. But if you are invited, then enter. And when you have eaten, then disperse, not lingering for conversation. This behavior may cause the Prophet discomfort, and he would be shy to dismiss you, but Allah is not shy of the truth. When you ask his wives for something, do so from behind a partition. This is purer for your hearts and theirs. It is not suitable for you to offend Allah’s Messenger, nor should you ever marry his wives after him. Indeed, this would be a grave offense in Allah’s sight."
        },
        {
            "verseNumber": 54,
            "verseString": "Whether you reveal something or conceal it, God is always aware of everything.",
            "verseStringReplacedWithAllah": "Whether you reveal something or conceal it, Allah is always aware of everything."
        },
        {
            "verseNumber": 55,
            "verseString": "There is no blame on them regarding their fathers, sons, brothers, brothers’ sons, sisters’ sons, their women, or those under their protection. So let them fear God. God is a witness to everything.",
            "verseStringReplacedWithAllah": "There is no blame on them regarding their fathers, sons, brothers, brothers’ sons, sisters’ sons, their women, or those under their protection. So let them fear Allah. Allah is a witness to everything."
        },
        {
            "verseNumber": 56,
            "verseString": "God and His angels send blessings upon the Prophet. O you who believe, invoke blessings and peace upon him.",
            "verseStringReplacedWithAllah": "Allah and His angels send blessings upon the Prophet. O you who believe, invoke blessings and peace upon him."
        },
        {
            "verseNumber": 57,
            "verseString": "Those who insult God and His Messenger, God has cursed them in this world and the Hereafter, and He prepared for them a humiliating punishment.",
            "verseStringReplacedWithAllah": "Those who insult Allah and His Messenger, Allah has cursed them in this world and the Hereafter, and He prepared for them a humiliating punishment."
        },
        {
            "verseNumber": 58,
            "verseString": "Those who harm believing men and women undeservedly, bear on themselves the guilt of slander and a manifest sin."
        },
        {
            "verseNumber": 59,
            "verseString": "O Prophet, instruct your wives, daughters, and the believers’ women to lengthen their garments, so they may be recognized and not be harassed. God is ever Forgiving, Most Merciful.",
            "verseStringReplacedWithAllah": "O Prophet, instruct your wives, daughters, and the believers’ women to lengthen their garments, so they may be recognized and not be harassed. Allah is ever Forgiving, Most Merciful."
        },
        {
            "verseNumber": 60,
            "verseString": "If the hypocrites, those in whose hearts is sickness, and those who spread malicious rumors in the city don’t cease, We will incite you against them; then they won’t be your neighbors therein except for a little while."
        },
        {
            "verseNumber": 61,
            "verseString": "Cursed they are. Wherever they are found, they are to be apprehended and executed promptly."
        },
        {
            "verseNumber": 62,
            "verseString": "This has been God’s established way with those who passed before. You will find no alteration in God’s way.",
            "verseStringReplacedWithAllah": "This has been Allah’s established way with those who passed before. You will find no alteration in Allah’s way."
        },
        {
            "verseNumber": 63,
            "verseString": "People ask you concerning the Hour. Say, “Knowledge of it is only with God. And what will make you know? Perhaps the Hour is near.”",
            "verseStringReplacedWithAllah": "People ask you concerning the Hour. Say, “Knowledge of it is only with Allah. And what will make you know? Perhaps the Hour is near.”"
        },
        {
            "verseNumber": 64,
            "verseString": "God has cursed the unbelievers and prepared for them a blazing Fire.",
            "verseStringReplacedWithAllah": "Allah has cursed the unbelievers and prepared for them a blazing Fire."
        },
        {
            "verseNumber": 65,
            "verseString": "There, they will remain forever, devoid of any protector or helper."
        },
        {
            "verseNumber": 66,
            "verseString": "On the Day when their faces are flipped in the Fire, they will cry out, “Oh, how we wish we had obeyed God and the Messenger.”",
            "verseStringReplacedWithAllah": "On the Day when their faces are flipped in the Fire, they will cry out, “Oh, how we wish we had obeyed Allah and the Messenger.”"
        },
        {
            "verseNumber": 67,
            "verseString": "And they will say, “Our Lord, we obeyed our leaders and great ones, but they led us astray from the path."
        },
        {
            "verseNumber": 68,
            "verseString": "Our Lord, give them double the punishment and curse them severely.”"
        },
        {
            "verseNumber": 69,
            "verseString": "O you who believe, don’t be like those who hurt Moses, yet God absolved him of what they said. And he was distinguished in God’s sight.",
            "verseStringReplacedWithAllah": "O you who believe, don’t be like those who hurt Moses, yet Allah absolved him of what they said. And he was distinguished in Allah’s sight."
        },
        {
            "verseNumber": 70,
            "verseString": "O you who have faith, revere God, and always speak with straightforward words.",
            "verseStringReplacedWithAllah": "O you who have faith, revere Allah, and always speak with straightforward words."
        },
        {
            "verseNumber": 71,
            "verseString": "He will correct your actions and forgive your sins. Whoever obeys God and His Messenger has achieved a magnificent triumph.",
            "verseStringReplacedWithAllah": "He will correct your actions and forgive your sins. Whoever obeys Allah and His Messenger has achieved a magnificent triumph."
        },
        {
            "verseNumber": 72,
            "verseString": "We presented the trust to the heavens, the earth, and the mountains, but they refused to bear it, fearing its consequences. However, man undertook it, being inherently unjust and ignorant."
        },
        {
            "verseNumber": 73,
            "verseString": "God will punish the hypocritical men and women, and the polytheistic men and women. And God pardons the believing men and women. God is always Forgiving, Most Merciful.",
            "verseStringReplacedWithAllah": "Allah will punish the hypocritical men and women, and the polytheistic men and women. And Allah pardons the believing men and women. Allah is always Forgiving, Most Merciful."
        }
    ],
    "chapterNumber": 33,
    "nameInEnglish": "The Confederates",
    "nameInTransliteration": "Al Ahzab",
    "nameInArabic": "الأحزاب",
    "numberOfVerses": 73
}