{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "A chapter that We revealed and made obligatory, containing clear verses, so that you may remember."
        },
        {
            "verseNumber": 2,
            "verseString": "Regarding the adulteress and the adulterer, administer one hundred lashes to each. Let not pity for them prevent you from implementing God’s Law—if you believe in God and the Last Day. Let a group of believers witness their punishment.",
            "verseStringReplacedWithAllah": "Regarding the adulteress and the adulterer, administer one hundred lashes to each. Let not pity for them prevent you from implementing Allah’s Law—if you believe in Allah and the Last Day. Let a group of believers witness their punishment."
        },
        {
            "verseNumber": 3,
            "verseString": "An adulterer may only marry an adulteress or a polytheistic woman, and an adulteress may only marry an adulterer or a polytheistic man. This is prohibited for the believers."
        },
        {
            "verseNumber": 4,
            "verseString": "Those who falsely accuse chaste women, yet fail to produce four witnesses, whip them with eighty lashes, and reject their testimony after that. These are the sinful ones."
        },
        {
            "verseNumber": 5,
            "verseString": "However, those who repent and reform afterwards—God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "However, those who repent and reform afterwards—Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 6,
            "verseString": "If a man accuses his wife, but has no witnesses except himself, he must swear by God four times that he is truthful.",
            "verseStringReplacedWithAllah": "If a man accuses his wife, but has no witnesses except himself, he must swear by Allah four times that he is truthful."
        },
        {
            "verseNumber": 7,
            "verseString": "On the fifth instance, he must invoke God’s curse upon himself if he’s lying.",
            "verseStringReplacedWithAllah": "On the fifth instance, he must invoke Allah’s curse upon himself if he’s lying."
        },
        {
            "verseNumber": 8,
            "verseString": "Her punishment will be averted if she swears four times by God that he’s lying.",
            "verseStringReplacedWithAllah": "Her punishment will be averted if she swears four times by Allah that he’s lying."
        },
        {
            "verseNumber": 9,
            "verseString": "On the fifth occasion, she must invoke God’s wrath upon herself, if he is truthful.",
            "verseStringReplacedWithAllah": "On the fifth occasion, she must invoke Allah’s wrath upon herself, if he is truthful."
        },
        {
            "verseNumber": 10,
            "verseString": "But for God’s grace and mercy upon you, and that God is Accepting of Repentance, Wise.",
            "verseStringReplacedWithAllah": "But for Allah’s grace and mercy upon you, and that Allah is Accepting of Repentance, Wise."
        },
        {
            "verseNumber": 11,
            "verseString": "Those who initiated the slander are a group among you. Don’t consider it harmful for you; it is beneficial for you. Each person involved will bear a portion of the sin, but the one who played the major role will face harsh punishment."
        },
        {
            "verseNumber": 12,
            "verseString": "When you heard it, the believing men and women should’ve thought positively of one another and said, “This is obviously a lie.”"
        },
        {
            "verseNumber": 13,
            "verseString": "Why didn’t they produce four witnesses for it? If they don’t produce the witnesses, then in the sight of God, they are the liars.",
            "verseStringReplacedWithAllah": "Why didn’t they produce four witnesses for it? If they don’t produce the witnesses, then in the sight of Allah, they are the liars."
        },
        {
            "verseNumber": 14,
            "verseString": "Were it not for God’s grace and mercy upon you, in this world and the Hereafter, a tremendous punishment would’ve befallen you for what you engaged in.",
            "verseStringReplacedWithAllah": "Were it not for Allah’s grace and mercy upon you, in this world and the Hereafter, a tremendous punishment would’ve befallen you for what you engaged in."
        },
        {
            "verseNumber": 15,
            "verseString": "You propagated it with your tongues and spoke with your mouths what you had no knowledge of, considering it trivial, while it was, in the sight of God, significant.",
            "verseStringReplacedWithAllah": "You propagated it with your tongues and spoke with your mouths what you had no knowledge of, considering it trivial, while it was, in the sight of Allah, significant."
        },
        {
            "verseNumber": 16,
            "verseString": "Upon hearing it, you should’ve said, “It is not for us to speak of this. Glory be to You, this is a serious slander.”"
        },
        {
            "verseNumber": 17,
            "verseString": "God admonishes you never to return to such a thing, if you are believers.",
            "verseStringReplacedWithAllah": "Allah admonishes you never to return to such a thing, if you are believers."
        },
        {
            "verseNumber": 18,
            "verseString": "God clarifies the verses for you. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "Allah clarifies the verses for you. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 19,
            "verseString": "Those who love to see immorality among the believers will face severe punishment in this life and the Hereafter. God knows, and you don’t know.",
            "verseStringReplacedWithAllah": "Those who love to see immorality among the believers will face severe punishment in this life and the Hereafter. Allah knows, and you don’t know."
        },
        {
            "verseNumber": 20,
            "verseString": "God extends His grace and mercy upon you. God is Kind and Merciful.",
            "verseStringReplacedWithAllah": "Allah extends His grace and mercy upon you. Allah is Kind and Merciful."
        },
        {
            "verseNumber": 21,
            "verseString": "O you who believe, don’t follow Satan’s footsteps. Whoever follows Satan’s footsteps—he orders immorality and what’s objectionable. If not for God’s grace and mercy upon you, none of you would ever be purified. But God purifies whom He wills. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "O you who believe, don’t follow Satan’s footsteps. Whoever follows Satan’s footsteps—he orders immorality and what’s objectionable. If not for Allah’s grace and mercy upon you, none of you would ever be purified. But Allah purifies whom He wills. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 22,
            "verseString": "And let those of abundance and ample means among you not swear to withhold their help from their relatives, the needy, and the emigrants in the cause of God. Let them forgive and overlook. Don’t you wish for God to forgive you? God is All-Forgiving, Most Merciful.",
            "verseStringReplacedWithAllah": "And let those of abundance and ample means among you not swear to withhold their help from their relatives, the needy, and the emigrants in the cause of Allah. Let them forgive and overlook. Don’t you wish for Allah to forgive you? Allah is All-Forgiving, Most Merciful."
        },
        {
            "verseNumber": 23,
            "verseString": "Those who falsely accuse innocent, unsuspecting, believing women are cursed in this world and in the Hereafter, and for them is a terrible punishment."
        },
        {
            "verseNumber": 24,
            "verseString": "On the Day when their own tongues, hands, and feet will testify against them as to what they used to do."
        },
        {
            "verseNumber": 25,
            "verseString": "On that Day, God will settle their accounts in full, and they will know that God is the Evident Truth.",
            "verseStringReplacedWithAllah": "On that Day, Allah will settle their accounts in full, and they will know that Allah is the Evident Truth."
        },
        {
            "verseNumber": 26,
            "verseString": "Wicked women are for wicked men, and evil men are for evil women. And good women are for good men, and virtuous men are for virtuous women. These are clear of what people say. For them, there is forgiveness and a generous provision."
        },
        {
            "verseNumber": 27,
            "verseString": "O you who believe, don’t enter homes other than your own until you have sought permission and greeted its inhabitants. This is better for you, that you may be mindful."
        },
        {
            "verseNumber": 28,
            "verseString": "If you find no one therein, don’t enter until your permission has been granted. If you’re asked to leave, then turn back. God is fully aware of what you do.",
            "verseStringReplacedWithAllah": "If you find no one therein, don’t enter until your permission has been granted. If you’re asked to leave, then turn back. Allah is fully aware of what you do."
        },
        {
            "verseNumber": 29,
            "verseString": "There is no fault in you for entering houses not inhabited, where there is convenience for you. God knows what you disclose and what you conceal.",
            "verseStringReplacedWithAllah": "There is no fault in you for entering houses not inhabited, where there is convenience for you. Allah knows what you disclose and what you conceal."
        },
        {
            "verseNumber": 30,
            "verseString": "Tell the believing men to lower their gaze and guard their privates. That is purer for them, and God fully knows what they do.",
            "verseStringReplacedWithAllah": "Tell the believing men to lower their gaze and guard their privates. That is purer for them, and Allah fully knows what they do."
        },
        {
            "verseNumber": 31,
            "verseString": "And tell the believing women to lower their gaze, to guard their chastity, and not to display their beauty beyond what appears thereof. They should draw their veils over their chests and not display their beauty except to their husbands, fathers, fathers-in-law, sons, stepsons, brothers, the sons of their sisters, female relatives, their dependents, male servants devoid of sexual desires, and children who are unaware of women’s nakedness. They shouldn’t stamp their feet to draw attention to their hidden beauty. O believers, turn to God in repentance, so you may succeed.",
            "verseStringReplacedWithAllah": "And tell the believing women to lower their gaze, to guard their chastity, and not to display their beauty beyond what appears thereof. They should draw their veils over their chests and not display their beauty except to their husbands, fathers, fathers-in-law, sons, stepsons, brothers, the sons of their sisters, female relatives, their dependents, male servants devoid of sexual desires, and children who are unaware of women’s nakedness. They shouldn’t stamp their feet to draw attention to their hidden beauty. O believers, turn to Allah in repentance, so you may succeed."
        },
        {
            "verseNumber": 32,
            "verseString": "Marry off the singles among you, and the righteous among your male and female servants. If they are poor, God will enrich them from His bounty. God is Bountiful, All-Knowing.",
            "verseStringReplacedWithAllah": "Marry off the singles among you, and the righteous among your male and female servants. If they are poor, Allah will enrich them from His bounty. Allah is Bountiful, All-Knowing."
        },
        {
            "verseNumber": 33,
            "verseString": "Let those who don’t find marriage abstain, until God enriches them from His grace. If any of your servants desire literacy, provide it, if you recognize any good in them. Give them from the wealth that God has given you. Don’t compel your maids into prostitution for worldly gains if they wish to remain virtuous. However, if anyone compels them, then after their compulsion, God is Forgiving and Merciful.",
            "verseStringReplacedWithAllah": "Let those who don’t find marriage abstain, until Allah enriches them from His grace. If any of your servants desire literacy, provide it, if you recognize any good in them. Give them from the wealth that Allah has given you. Don’t compel your maids into prostitution for worldly gains if they wish to remain virtuous. However, if anyone compels them, then after their compulsion, Allah is Forgiving and Merciful."
        },
        {
            "verseNumber": 34,
            "verseString": "We’ve sent down to you clear signs, narratives of those who preceded you, and an admonition for the righteous."
        },
        {
            "verseNumber": 35,
            "verseString": "God is the Light of the heavens and the earth. His light is like a niche in which there is a lamp. The lamp is encased in a crystal, glowing like a brilliant star, fueled by a blessed olive tree, neither of the East nor the West. Its oil would almost glow, even without fire touching it—light upon light. God guides to His Light whom He wills. God presents parables for humankind.",
            "verseStringReplacedWithAllah": "Allah is the Light of the heavens and the earth. His light is like a niche in which there is a lamp. The lamp is encased in a crystal, glowing like a brilliant star, fueled by a blessed olive tree, neither of the East nor the West. Its oil would almost glow, even without fire touching it—light upon light. Allah guides to His Light whom He wills. Allah presents parables for humankind."
        },
        {
            "verseNumber": 36,
            "verseString": "In houses that God authorized to be raised His name is mentioned, and His praises are proclaimed, morning and evening.",
            "verseStringReplacedWithAllah": "In houses that Allah authorized to be raised His name is mentioned, and His praises are proclaimed, morning and evening."
        },
        {
            "verseNumber": 37,
            "verseString": "Men, whom neither trade nor sale distracts from the remembrance of God, from performing prayers and giving charity. They fear a day when hearts and eyes will be overturned.",
            "verseStringReplacedWithAllah": "Men, whom neither trade nor sale distracts from the remembrance of Allah, from performing prayers and giving charity. They fear a day when hearts and eyes will be overturned."
        },
        {
            "verseNumber": 38,
            "verseString": "God will reward them for their best deeds and give them more from His grace. God provides without account for whom He wills.",
            "verseStringReplacedWithAllah": "Allah will reward them for their best deeds and give them more from His grace. Allah provides without account for whom He wills."
        },
        {
            "verseNumber": 39,
            "verseString": "But as for those who disbelieve, their deeds are like a mirage in a desert. The thirsty thinks it to be water, until, upon reaching it, finds nothing. Instead, he finds God there, to settle his account in full. God is swift in reckoning.",
            "verseStringReplacedWithAllah": "But as for those who disbelieve, their deeds are like a mirage in a desert. The thirsty thinks it to be water, until, upon reaching it, finds nothing. Instead, he finds Allah there, to settle his account in full. Allah is swift in reckoning."
        },
        {
            "verseNumber": 40,
            "verseString": "Or like darkness within a vast, deep sea, covered by wave upon wave, topped by clouds—layers upon layers of darkness. If one extends his hand, he can barely see it. For those whom God doesn’t grant light, there is no illumination.",
            "verseStringReplacedWithAllah": "Or like darkness within a vast, deep sea, covered by wave upon wave, topped by clouds—layers upon layers of darkness. If one extends his hand, he can barely see it. For those whom Allah doesn’t grant light, there is no illumination."
        },
        {
            "verseNumber": 41,
            "verseString": "Don’t you see that everything in the heavens and on earth glorifies God, including the birds, as they soar? Each knows its mode of prayer and praise. God is fully aware of what they do.",
            "verseStringReplacedWithAllah": "Don’t you see that everything in the heavens and on earth glorifies Allah, including the birds, as they soar? Each knows its mode of prayer and praise. Allah is fully aware of what they do."
        },
        {
            "verseNumber": 42,
            "verseString": "The sovereignty of the heavens and the earth belongs to God, and to God is the final return.",
            "verseStringReplacedWithAllah": "The sovereignty of the heavens and the earth belongs to Allah, and to Allah is the final return."
        },
        {
            "verseNumber": 43,
            "verseString": "Didn’t you see how God drives the clouds, gathers them, then stacks them up? From within their midst, you see raindrops emerge. He sends down abundant hail from the sky, striking with it whom He wills and averting it from whom He wills. The flash of its lightning almost snatches away the sight.",
            "verseStringReplacedWithAllah": "Didn’t you see how Allah drives the clouds, gathers them, then stacks them up? From within their midst, you see raindrops emerge. He sends down abundant hail from the sky, striking with it whom He wills and averting it from whom He wills. The flash of its lightning almost snatches away the sight."
        },
        {
            "verseNumber": 44,
            "verseString": "God alternates the night and the day. In this, there is a lesson for those who have insight.",
            "verseStringReplacedWithAllah": "Allah alternates the night and the day. In this, there is a lesson for those who have insight."
        },
        {
            "verseNumber": 45,
            "verseString": "God created every living creature from water—some crawl on their bellies, some walk on two legs, and others on four. God creates whatever He wills, for He is capable of all things.",
            "verseStringReplacedWithAllah": "Allah created every living creature from water—some crawl on their bellies, some walk on two legs, and others on four. Allah creates whatever He wills, for He is capable of all things."
        },
        {
            "verseNumber": 46,
            "verseString": "We revealed enlightening revelations, and God guides whom He wills to a straight path.",
            "verseStringReplacedWithAllah": "We revealed enlightening revelations, and Allah guides whom He wills to a straight path."
        },
        {
            "verseNumber": 47,
            "verseString": "They say, “We believe in God and the Messenger, and we obey.” But after that, some of them turn away; these are not believers.",
            "verseStringReplacedWithAllah": "They say, “We believe in Allah and the Messenger, and we obey.” But after that, some of them turn away; these are not believers."
        },
        {
            "verseNumber": 48,
            "verseString": "When they are called to God and His Messenger to judge among them, some of them hesitate.",
            "verseStringReplacedWithAllah": "When they are called to Allah and His Messenger to judge among them, some of them hesitate."
        },
        {
            "verseNumber": 49,
            "verseString": "However, if the judgment is in their favor, they come to it willingly."
        },
        {
            "verseNumber": 50,
            "verseString": "Is there illness in their hearts? Or are they plagued with doubt? Or do they fear that God and His Messenger will mistreat them? In reality, it is they who are the wrongdoers.",
            "verseStringReplacedWithAllah": "Is there illness in their hearts? Or are they plagued with doubt? Or do they fear that Allah and His Messenger will mistreat them? In reality, it is they who are the wrongdoers."
        },
        {
            "verseNumber": 51,
            "verseString": "When called upon by God and His Messenger to settle their disputes, the believers respond, saying, “We heard, and we obeyed.” These are the ones who will prosper.",
            "verseStringReplacedWithAllah": "When called upon by Allah and His Messenger to settle their disputes, the believers respond, saying, “We heard, and we obeyed.” These are the ones who will prosper."
        },
        {
            "verseNumber": 52,
            "verseString": "Those who obey God and His Messenger, who fear God and are mindful of Him, are the successful ones.",
            "verseStringReplacedWithAllah": "Those who obey Allah and His Messenger, who fear Allah and are mindful of Him, are the successful ones."
        },
        {
            "verseNumber": 53,
            "verseString": "They swear solemnly by God that they would mobilize if you were to command them. Say, “Don’t swear; true obedience will be recognized. God is fully aware of what you do.”",
            "verseStringReplacedWithAllah": "They swear solemnly by Allah that they would mobilize if you were to command them. Say, “Don’t swear; true obedience will be recognized. Allah is fully aware of what you do.”"
        },
        {
            "verseNumber": 54,
            "verseString": "Say, “Obey God and obey the Messenger.” But if they turn away, he is accountable for his duty, and you are accountable for yours. If you obey, you will be guided. It is only incumbent upon the Messenger to deliver the clear message.",
            "verseStringReplacedWithAllah": "Say, “Obey Allah and obey the Messenger.” But if they turn away, he is accountable for his duty, and you are accountable for yours. If you obey, you will be guided. It is only incumbent upon the Messenger to deliver the clear message."
        },
        {
            "verseNumber": 55,
            "verseString": "God promises those among you who believe and do good deeds that He will grant them sovereignty on earth, as He did to those before them. And He will establish for them their religion, which He has preferred for them, and replace their fear with security. They will worship Me alone, not associating anything with Me. However, those who disbelieve after this—these are the sinful.",
            "verseStringReplacedWithAllah": "Allah promises those among you who believe and do good deeds that He will grant them sovereignty on earth, as He did to those before them. And He will establish for them their religion, which He has preferred for them, and replace their fear with security. They will worship Me alone, not associating anything with Me. However, those who disbelieve after this—these are the sinful."
        },
        {
            "verseNumber": 56,
            "verseString": "Establish prayer, give charity, and obey the Messenger, so that you may receive mercy."
        },
        {
            "verseNumber": 57,
            "verseString": "Don’t think that those who disbelieve can escape on earth. Their final abode is the Fire—a terrible destination."
        },
        {
            "verseNumber": 58,
            "verseString": "O you who believe, let your dependents and those who haven’t reached puberty ask for permission in three instances: before the dawn prayer, when you undress at noon, and after the evening prayer. These are three occasions of privacy for you. At other times, it’s not improper for you or them to move about freely, mingling with each other. Thus, God clarifies His verses for you. God is All-Knowing, Most Wise.",
            "verseStringReplacedWithAllah": "O you who believe, let your dependents and those who haven’t reached puberty ask for permission in three instances: before the dawn prayer, when you undress at noon, and after the evening prayer. These are three occasions of privacy for you. At other times, it’s not improper for you or them to move about freely, mingling with each other. Thus, Allah clarifies His verses for you. Allah is All-Knowing, Most Wise."
        },
        {
            "verseNumber": 59,
            "verseString": "When your children reach puberty, they must also ask for permission, as those before them did. Thus, God makes His commandments clear to you. God is All-Knowing, Most Wise.",
            "verseStringReplacedWithAllah": "When your children reach puberty, they must also ask for permission, as those before them did. Thus, Allah makes His commandments clear to you. Allah is All-Knowing, Most Wise."
        },
        {
            "verseNumber": 60,
            "verseString": "Elderly women who are past the prospect of marriage can relax their dress code, provided they don’t flaunt their beauty. However, it’s better for them to maintain modesty. God is All-Hearing, All-Knowing.",
            "verseStringReplacedWithAllah": "Elderly women who are past the prospect of marriage can relax their dress code, provided they don’t flaunt their beauty. However, it’s better for them to maintain modesty. Allah is All-Hearing, All-Knowing."
        },
        {
            "verseNumber": 61,
            "verseString": "There is no blame on the blind, the disabled, the sick, nor upon yourselves if you eat in your own houses, or the houses of your fathers, mothers, brothers, sisters, paternal uncles and aunts, maternal uncles and aunts, or in houses whose keys you possess, or in your friends’ houses. There is no blame upon you whether you eat together or separately. When you enter houses, greet each other with a greeting blessed and pure from God. Thus, God clarifies His revelations to you, so you may understand.",
            "verseStringReplacedWithAllah": "There is no blame on the blind, the disabled, the sick, nor upon yourselves if you eat in your own houses, or the houses of your fathers, mothers, brothers, sisters, paternal uncles and aunts, maternal uncles and aunts, or in houses whose keys you possess, or in your friends’ houses. There is no blame upon you whether you eat together or separately. When you enter houses, greet each other with a greeting blessed and pure from Allah. Thus, Allah clarifies His revelations to you, so you may understand."
        },
        {
            "verseNumber": 62,
            "verseString": "True believers are those who have faith in God and His Messenger, and when they are with him on a matter of common interest, they don’t leave without seeking his permission. Those who ask your permission are the ones who believe in God and His Messenger. If they request your permission for some of their affairs, grant permission to whomever you wish among them, and ask God for forgiveness for them. God is Ever Forgiving, Most Merciful.",
            "verseStringReplacedWithAllah": "True believers are those who have faith in Allah and His Messenger, and when they are with him on a matter of common interest, they don’t leave without seeking his permission. Those who ask your permission are the ones who believe in Allah and His Messenger. If they request your permission for some of their affairs, grant permission to whomever you wish among them, and ask Allah for forgiveness for them. Allah is Ever Forgiving, Most Merciful."
        },
        {
            "verseNumber": 63,
            "verseString": "Don’t address the Messenger as you address each other. God surely knows those of you who slip away hiding themselves. Let those who defy His commands beware, lest a trial befall them or a grievous penalty be inflicted on them.",
            "verseStringReplacedWithAllah": "Don’t address the Messenger as you address each other. Allah surely knows those of you who slip away hiding themselves. Let those who defy His commands beware, lest a trial befall them or a grievous penalty be inflicted on them."
        },
        {
            "verseNumber": 64,
            "verseString": "Surely, to God belongs whatever is in the heavens and the earth. He knows what you’re upon. On the Day they are returned to Him, He will make them aware of what they did. And God is fully aware of everything.",
            "verseStringReplacedWithAllah": "Surely, to Allah belongs whatever is in the heavens and the earth. He knows what you’re upon. On the Day they are returned to Him, He will make them aware of what they did. And Allah is fully aware of everything."
        }
    ],
    "chapterNumber": 24,
    "nameInEnglish": "The Light",
    "nameInTransliteration": "An Nur",
    "nameInArabic": "النور",
    "numberOfVerses": 64
}