{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Ha. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "This Book is a revelation from God, the Almighty, the All-Wise.",
            "verseStringReplacedWithAllah": "This Book is a revelation from Allah, the Almighty, the All-Wise."
        },
        {
            "verseNumber": 3,
            "verseString": "In the heavens and the earth are signs for the believers."
        },
        {
            "verseNumber": 4,
            "verseString": "And in your creation, and in the various kinds of creatures He scattered, are signs for people who are sure."
        },
        {
            "verseNumber": 5,
            "verseString": "And in the alternation of night and day, in the sustenance that God sends down from the sky, reviving the earth after its death, and in His control of the winds, there are signs for people who reason.",
            "verseStringReplacedWithAllah": "And in the alternation of night and day, in the sustenance that Allah sends down from the sky, reviving the earth after its death, and in His control of the winds, there are signs for people who reason."
        },
        {
            "verseNumber": 6,
            "verseString": "These are God’s verses which We convey to you in truth. So, in what message, after God and His verses, will they believe?",
            "verseStringReplacedWithAllah": "These are Allah’s verses which We convey to you in truth. So, in what message, after Allah and His verses, will they believe?"
        },
        {
            "verseNumber": 7,
            "verseString": "Woe to every liar, sinful fabricator."
        },
        {
            "verseNumber": 8,
            "verseString": "Who hears God’s verses recited to him, persists in arrogance, as if he didn’t hear them. Inform him of a painful punishment.",
            "verseStringReplacedWithAllah": "Who hears Allah’s verses recited to him, persists in arrogance, as if he didn’t hear them. Inform him of a painful punishment."
        },
        {
            "verseNumber": 9,
            "verseString": "When he becomes aware of some of Our verses, he mocks them. For them, there is a humiliating punishment."
        },
        {
            "verseNumber": 10,
            "verseString": "Ahead of them lies Hell. Neither their wealth nor their allies besides God will avail them anything. For them, there is a tremendous punishment.",
            "verseStringReplacedWithAllah": "Ahead of them lies Hell. Neither their wealth nor their allies besides Allah will avail them anything. For them, there is a tremendous punishment."
        },
        {
            "verseNumber": 11,
            "verseString": "This is guidance. Those who reject their Lord’s signs will have a severe punishment of a humiliating nature."
        },
        {
            "verseNumber": 12,
            "verseString": "It is God who made the sea submissive to you, so that ships may traverse it by His decree, and you may seek His bounty, and perhaps you may express gratitude.",
            "verseStringReplacedWithAllah": "It is Allah who made the sea submissive to you, so that ships may traverse it by His decree, and you may seek His bounty, and perhaps you may express gratitude."
        },
        {
            "verseNumber": 13,
            "verseString": "He made everything in the heavens and on earth subservient to you—all is from Him. In this, there are signs for those who reflect."
        },
        {
            "verseNumber": 14,
            "verseString": "Tell those who believe to forgive those who don’t anticipate the days of God, for He repays people according to their deeds.",
            "verseStringReplacedWithAllah": "Tell those who believe to forgive those who don’t anticipate the days of Allah, for He repays people according to their deeds."
        },
        {
            "verseNumber": 15,
            "verseString": "Whoever works righteousness, it is for the good of his own soul; and whoever does evil, it is upon it. Then to your Lord you will be returned."
        },
        {
            "verseNumber": 16,
            "verseString": "We gave the Children of Israel the Scripture, wisdom, and prophethood; and We provided them with good things, and We favored them above all other nations."
        },
        {
            "verseNumber": 17,
            "verseString": "We provided them with clear proofs of the matter. They only began to dispute after knowledge came to them—out of mutual jealousy. Your Lord will judge between them on Resurrection Day regarding their disputes."
        },
        {
            "verseNumber": 18,
            "verseString": "Then We set you on the path of the ordinance, so follow it, and don’t follow the whims of those who don’t know."
        },
        {
            "verseNumber": 19,
            "verseString": "They won’t be able to protect you from God in anything. The wrongdoers are allies of each other, but God is the Ally of the righteous.",
            "verseStringReplacedWithAllah": "They won’t be able to protect you from Allah in anything. The wrongdoers are allies of each other, but Allah is the Ally of the righteous."
        },
        {
            "verseNumber": 20,
            "verseString": "These are insights for humankind, guidance, and mercy for people who have unwavering faith."
        },
        {
            "verseNumber": 21,
            "verseString": "Do those who commit evil deeds think that We will make them like those who have believed and done righteous deeds, both in their life and after their death? How ill they judge!"
        },
        {
            "verseNumber": 22,
            "verseString": "God created the heavens and the earth with truth. Each soul will be repaid for what it has earned, and they won’t be wronged.",
            "verseStringReplacedWithAllah": "Allah created the heavens and the earth with truth. Each soul will be repaid for what it has earned, and they won’t be wronged."
        },
        {
            "verseNumber": 23,
            "verseString": "Have you seen him who takes his own desires as his god? God, knowingly, allows him to stray, seals his hearing and heart, and places a covering over his sight. Who, then, can guide him after God? Won’t you then reflect?",
            "verseStringReplacedWithAllah": "Have you seen him who takes his own desires as his god? Allah, knowingly, allows him to stray, seals his hearing and heart, and places a covering over his sight. Who, then, can guide him after Allah? Won’t you then reflect?"
        },
        {
            "verseNumber": 24,
            "verseString": "They assert, “There is nothing but our worldly life; we live and we die, and time alone destroys us.” But they have no knowledge of this; they are only guessing."
        },
        {
            "verseNumber": 25,
            "verseString": "When Our clear verses are presented to them, their only argument is, “Bring our ancestors back, if you are truthful.”"
        },
        {
            "verseNumber": 26,
            "verseString": "Say, “God gives you life, then makes you die, then gathers you for the Day of Resurrection, about which there is no doubt. But most people don’t know.”",
            "verseStringReplacedWithAllah": "Say, “Allah gives you life, then makes you die, then gathers you for the Day of Resurrection, about which there is no doubt. But most people don’t know.”"
        },
        {
            "verseNumber": 27,
            "verseString": "To God belongs the dominion of the heavens and the earth. On the Day when the Hour is established, on that day, those who falsify will lose.",
            "verseStringReplacedWithAllah": "To Allah belongs the dominion of the heavens and the earth. On the Day when the Hour is established, on that day, those who falsify will lose."
        },
        {
            "verseNumber": 28,
            "verseString": "You will see every community kneeling, every community will be called to its record. “Today, you are being recompensed for what you used to do."
        },
        {
            "verseNumber": 29,
            "verseString": "This is our record which speaks against you with truth. We were recording what you used to do.”"
        },
        {
            "verseNumber": 30,
            "verseString": "Then, as for those who believed and did righteous deeds, their Lord will admit them into His Mercy. That is the clear triumph."
        },
        {
            "verseNumber": 31,
            "verseString": "As for those who disbelieved: “Weren’t My verses recited to you, but you were arrogant and were guilty people?”"
        },
        {
            "verseNumber": 32,
            "verseString": "When it was said, “God’s promise is true, and there is no doubt about the Hour,” you said, “We don’t know what the Hour is. We conceive it as nothing more than speculation, and we aren’t sure.”",
            "verseStringReplacedWithAllah": "When it was said, “Allah’s promise is true, and there is no doubt about the Hour,” you said, “We don’t know what the Hour is. We conceive it as nothing more than speculation, and we aren’t sure.”"
        },
        {
            "verseNumber": 33,
            "verseString": "The evils of what they earned will appear to them, and what they used to mock will surround them."
        },
        {
            "verseNumber": 34,
            "verseString": "And it will be said, “Today, We will forget you, as you forgot the meeting of this Day. And your dwelling will be the Fire, and you will have no helpers."
        },
        {
            "verseNumber": 35,
            "verseString": "That is because you took God’s verses lightly and the worldly life deceived you.” So today, they won’t be removed from it, nor will they be given the opportunity to make amends.",
            "verseStringReplacedWithAllah": "That is because you took Allah’s verses lightly and the worldly life deceived you.” So today, they won’t be removed from it, nor will they be given the opportunity to make amends."
        },
        {
            "verseNumber": 36,
            "verseString": "So, to God be all praise, Lord of the heavens and Lord of the earth, Lord of the worlds.",
            "verseStringReplacedWithAllah": "So, to Allah be all praise, Lord of the heavens and Lord of the earth, Lord of the worlds."
        },
        {
            "verseNumber": 37,
            "verseString": "And His is the greatness in the heavens and the earth, and He is the Mighty, the All-Wise."
        }
    ],
    "chapterNumber": 45,
    "nameInEnglish": "Kneeling",
    "nameInTransliteration": "Al Jathiyah",
    "nameInArabic": "الجاثية",
    "numberOfVerses": 37
}