{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Ha. Meem."
        },
        {
            "verseNumber": 2,
            "verseString": "A revelation from the Compassionate, the Merciful."
        },
        {
            "verseNumber": 3,
            "verseString": "A Book whose verses have been detailed. An Arabic Quran for people who understand."
        },
        {
            "verseNumber": 4,
            "verseString": "Bringing good news and warning, but most have turned away, so they don’t hear."
        },
        {
            "verseNumber": 5,
            "verseString": "They say, “Our hearts are covered from what you call us towards, in our ears is deafness, and there is a veil between you and us. So act, we too are acting.”"
        },
        {
            "verseNumber": 6,
            "verseString": "Say, “I am only a human like you, divinely inspired that your God is One God. Be upright towards Him and ask for His forgiveness.” Woe to those who associate others with Him!"
        },
        {
            "verseNumber": 7,
            "verseString": "Those who don’t give purity and deny the Hereafter."
        },
        {
            "verseNumber": 8,
            "verseString": "For those who believe and do good deeds, there is an endless reward."
        },
        {
            "verseNumber": 9,
            "verseString": "Say, “Do you deny the One who created the earth in two periods? And do you attribute equals to Him? He is the Lord of the realms.”"
        },
        {
            "verseNumber": 10,
            "verseString": "He placed anchors upon it, blessed it, and proportioned its sustenance in four equal intervals for all who ask."
        },
        {
            "verseNumber": 11,
            "verseString": "Then, He turned to the sky, which was smoke, and He said to it and the earth, “Come, willingly or unwillingly.” They responded, “We come willingly.”"
        },
        {
            "verseNumber": 12,
            "verseString": "Thus, He completed them as seven heavens in two periods, and He assigned to each heaven its duty. We adorned the nearest heaven with lamps and protection. Such is the decree of the Almighty, the All-Knowing."
        },
        {
            "verseNumber": 13,
            "verseString": "If they turn away, say, “I have warned you of a thunderbolt, similar to Aad’s and Thamud’s.”"
        },
        {
            "verseNumber": 14,
            "verseString": "When the messengers came to them, from in front and behind, saying, “Worship none but God,” they responded, “If our Lord had willed, He would’ve sent down angels. Therefore, we disbelieve in your message.”",
            "verseStringReplacedWithAllah": "When the messengers came to them, from in front and behind, saying, “Worship none but Allah,” they responded, “If our Lord had willed, He would’ve sent down angels. Therefore, we disbelieve in your message.”"
        },
        {
            "verseNumber": 15,
            "verseString": "As for Aad, they were arrogant on earth, denied the truth, and said, “Who is mightier than us?” Didn’t they see that God, who created them, is mightier than them? And they continued to deny Our revelations.",
            "verseStringReplacedWithAllah": "As for Aad, they were arrogant on earth, denied the truth, and said, “Who is mightier than us?” Didn’t they see that Allah, who created them, is mightier than them? And they continued to deny Our revelations."
        },
        {
            "verseNumber": 16,
            "verseString": "So We unleashed upon them a roaring wind, for a few unfortunate days, to make them taste the disgraceful punishment in this worldly life. However, the punishment of the Hereafter is more shameful, and they won’t be helped."
        },
        {
            "verseNumber": 17,
            "verseString": "As for Thamud, We offered them guidance, but they preferred blindness over guidance. Thus, the thunderbolt of a humiliating punishment seized them for their deeds."
        },
        {
            "verseNumber": 18,
            "verseString": "And We saved those who believed and were righteous."
        },
        {
            "verseNumber": 19,
            "verseString": "On the Day when God’s enemies are gathered and marshaled towards the Fire.",
            "verseStringReplacedWithAllah": "On the Day when Allah’s enemies are gathered and marshaled towards the Fire."
        },
        {
            "verseNumber": 20,
            "verseString": "When they reach it, their hearing, their eyes, and their skin will testify against them regarding what they used to do."
        },
        {
            "verseNumber": 21,
            "verseString": "They will ask their skins, “Why did you testify against us?” They will reply, “God, who gave everything the ability to speak, made us speak. He who first created you, and to Him, you will return.",
            "verseStringReplacedWithAllah": "They will ask their skins, “Why did you testify against us?” They will reply, “Allah, who gave everything the ability to speak, made us speak. He who first created you, and to Him, you will return."
        },
        {
            "verseNumber": 22,
            "verseString": "You could not shield yourselves from your hearing, sight, and skins testifying against you. And you thought that God didn’t know much of what you do.",
            "verseStringReplacedWithAllah": "You could not shield yourselves from your hearing, sight, and skins testifying against you. And you thought that Allah didn’t know much of what you do."
        },
        {
            "verseNumber": 23,
            "verseString": "Your misconception about your Lord caused your ruin, and now you are among the losers."
        },
        {
            "verseNumber": 24,
            "verseString": "If they endure patiently, the Fire is their destination. If they try to justify themselves, they won’t be pardoned."
        },
        {
            "verseNumber": 25,
            "verseString": "We’ve appointed partners for them, who make their past and future actions attractive to them, leading them towards a fate akin to that of previous generations of jinn and humans, all of whom ultimately met their loss."
        },
        {
            "verseNumber": 26,
            "verseString": "The unbelievers say, “Don’t listen to this Quran, and drown it in noise, so you may prevail.”"
        },
        {
            "verseNumber": 27,
            "verseString": "We will make those who disbelieve taste the severe punishment and reward them with the worst of what they used to do."
        },
        {
            "verseNumber": 28,
            "verseString": "This is the retribution for God’s enemies: the Fire, their eternal dwelling, a recompense because they used to deny Our signs.",
            "verseStringReplacedWithAllah": "This is the retribution for Allah’s enemies: the Fire, their eternal dwelling, a recompense because they used to deny Our signs."
        },
        {
            "verseNumber": 29,
            "verseString": "The disbelievers will plead, “Our Lord, show us those who misled us—both jinn and humans—so we may put them beneath our feet, reducing them to the lowest.”"
        },
        {
            "verseNumber": 30,
            "verseString": "Those who say, “Our Lord is God,” and then go straight, the angels will descend upon them: “Fear not, nor grieve, but rejoice in the Paradise that you’ve been promised.",
            "verseStringReplacedWithAllah": "Those who say, “Our Lord is Allah,” and then go straight, the angels will descend upon them: “Fear not, nor grieve, but rejoice in the Paradise that you’ve been promised."
        },
        {
            "verseNumber": 31,
            "verseString": "We are your allies in this life and in the Hereafter, where you will have everything your hearts could desire and everything you request."
        },
        {
            "verseNumber": 32,
            "verseString": "A hospitality from a Merciful Forgiver.”"
        },
        {
            "verseNumber": 33,
            "verseString": "Who speaks better than one who calls to God, acts righteously, and says, “I am among those who submit”?",
            "verseStringReplacedWithAllah": "Who speaks better than one who calls to Allah, acts righteously, and says, “I am among those who submit”?"
        },
        {
            "verseNumber": 34,
            "verseString": "Good and evil aren’t equal. Repel by what’s better, and your former enemy may become a dear friend."
        },
        {
            "verseNumber": 35,
            "verseString": "Yet, none will attain it except those who are patient. And none will attain it except the very fortunate."
        },
        {
            "verseNumber": 36,
            "verseString": "When a provocation from Satan assails you, seek refuge in God. He is the All-Hearing, the All-Knowing.",
            "verseStringReplacedWithAllah": "When a provocation from Satan assails you, seek refuge in Allah. He is the All-Hearing, the All-Knowing."
        },
        {
            "verseNumber": 37,
            "verseString": "Among His signs are the night and the day, and the sun and the moon. Don’t bow down to the sun or the moon, but bow down to God, who created them both, if it’s Him that you serve.",
            "verseStringReplacedWithAllah": "Among His signs are the night and the day, and the sun and the moon. Don’t bow down to the sun or the moon, but bow down to Allah, who created them both, if it’s Him that you serve."
        },
        {
            "verseNumber": 38,
            "verseString": "If they display arrogance, those who stand in your Lord’s presence praise Him night and day, and they never tire."
        },
        {
            "verseNumber": 39,
            "verseString": "Among His signs: you see the earth barren, but when We send down water upon it, it quivers and grows. Indeed, He who gave it life, is the Giver of Life to the dead; He has power over everything."
        },
        {
            "verseNumber": 40,
            "verseString": "Those who distort Our verses aren’t hidden from Us. Are those who are hurled into the Fire better, or those who arrive safe and sound on Resurrection Day? Do what you wish; He is Seeing of everything you do."
        },
        {
            "verseNumber": 41,
            "verseString": "Those who reject the Reminder when it comes to them—it’s an invincible Book."
        },
        {
            "verseNumber": 42,
            "verseString": "Falsehood can’t approach it, neither from before it, nor from behind it. It is a revelation from a Wise, Praiseworthy One."
        },
        {
            "verseNumber": 43,
            "verseString": "Nothing is said to you that wasn’t said to the messengers before you: your Lord is the Owner of forgiveness, and the Owner of painful retribution."
        },
        {
            "verseNumber": 44,
            "verseString": "Had We made the Quran in a foreign language, they would have said, “Why are its verses not explained clearly?” A foreign and Arabic?” Say, “It is guidance and healing for those who believe. Yet, those who disbelieve are deaf and blind to it. They are being called from a place far away.”"
        },
        {
            "verseNumber": 45,
            "verseString": "We gave Moses the Scripture, but disputes arose regarding it. If it wasn’t for a predetermined decision from your Lord, they would’ve been judged immediately. Yet they are in perplexing doubt about it."
        },
        {
            "verseNumber": 46,
            "verseString": "Whoever acts righteously is for his good, and whoever commits evil is to his detriment. Your Lord does not wrong the servants."
        },
        {
            "verseNumber": 47,
            "verseString": "To Him belongs the knowledge of the Hour. No fruit emerges from its sheath, nor does any female conceive or give birth, except with His knowledge. On the Day when He questions them, “Where are My partners?” They will reply, “We confess to You, not one of us can testify to that.”"
        },
        {
            "verseNumber": 48,
            "verseString": "What they used to invoke before will disappear from them, and they will realize that there is no refuge for them."
        },
        {
            "verseNumber": 49,
            "verseString": "Man never tires of praying for good, but if adversity touches him, he becomes despondent and despairing."
        },
        {
            "verseNumber": 50,
            "verseString": "And if we make him taste mercy from Us after harm has touched him, he will surely say, “This is for me, and I don’t think the Hour will come. And even if I’m returned to my Lord, surely, with Him, I will have the ultimate good.” But We will inform those who disbelieve of what they did, and We will make them taste a harsh punishment."
        },
        {
            "verseNumber": 51,
            "verseString": "When We bestow blessings upon a person, he turns away and withdraws. But when adversity touches him, he indulges in extensive prayers."
        },
        {
            "verseNumber": 52,
            "verseString": "Say, “Have you considered: if it is from God and you rejected it, who is more astray than one who is in extreme dissension?”",
            "verseStringReplacedWithAllah": "Say, “Have you considered: if it is from Allah and you rejected it, who is more astray than one who is in extreme dissension?”"
        },
        {
            "verseNumber": 53,
            "verseString": "We will show them Our signs on the horizons and within themselves, until it becomes clear to them that it’s the truth. Does it not suffice that your Lord is a Witness over everything?"
        },
        {
            "verseNumber": 54,
            "verseString": "Yes, they are in doubt about meeting their Lord. Yes, He fully encompasses all things."
        }
    ],
    "chapterNumber": 41,
    "nameInEnglish": "Detailed",
    "nameInTransliteration": "Fussilat",
    "nameInArabic": "فصلت",
    "numberOfVerses": 54
}