{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "Praise be to God, the Originator of the heavens and the earth, who makes the angels as messengers, having wings in twos, threes, and fours. He increases in creation what He wills. God is over all things competent.",
            "verseStringReplacedWithAllah": "Praise be to Allah, the Originator of the heavens and the earth, who makes the angels as messengers, having wings in twos, threes, and fours. He increases in creation what He wills. Allah is over all things competent."
        },
        {
            "verseNumber": 2,
            "verseString": "None can withhold the mercy God opens for people, and none can release it after He has withheld it. He is the All-Wise, the All-Powerful.",
            "verseStringReplacedWithAllah": "None can withhold the mercy Allah opens for people, and none can release it after He has withheld it. He is the All-Wise, the All-Powerful."
        },
        {
            "verseNumber": 3,
            "verseString": "O people, remember God’s blessings upon you. Is there any creator other than God who provides for you from the sky and the earth? There is no god but Him, so how are you led astray?",
            "verseStringReplacedWithAllah": "O people, remember Allah’s blessings upon you. Is there any creator other than Allah who provides for you from the sky and the earth? There is no god but Him, so how are you led astray?"
        },
        {
            "verseNumber": 4,
            "verseString": "If they reject you, messengers before you were also rejected. To God, all matters are returned.",
            "verseStringReplacedWithAllah": "If they reject you, messengers before you were also rejected. To Allah, all matters are returned."
        },
        {
            "verseNumber": 5,
            "verseString": "O people, the promise of God is truth, so let not the worldly life delude you, nor let the Deceiver deceive you about God.",
            "verseStringReplacedWithAllah": "O people, the promise of Allah is truth, so let not the worldly life delude you, nor let the Deceiver deceive you about Allah."
        },
        {
            "verseNumber": 6,
            "verseString": "Satan is an enemy to you, so treat him as an enemy. He only calls his party to be among the inhabitants of the Blaze."
        },
        {
            "verseNumber": 7,
            "verseString": "Those who disbelieve will have a severe punishment; but those who believe and do righteous deeds—they will have forgiveness and a great reward."
        },
        {
            "verseNumber": 8,
            "verseString": "Consider the one whose evil deeds are made appealing to him, so he sees them as good. God misguides whom He wills and guides whom He wills. So, don’t waste yourself over them in regret; God is fully aware of what they do.",
            "verseStringReplacedWithAllah": "Consider the one whose evil deeds are made appealing to him, so he sees them as good. Allah misguides whom He wills and guides whom He wills. So, don’t waste yourself over them in regret; Allah is fully aware of what they do."
        },
        {
            "verseNumber": 9,
            "verseString": "It is God who sends the winds, so they stir up clouds. We then drive them to a dead land, and with them, We revive the land after its death. Such is the Resurrection.",
            "verseStringReplacedWithAllah": "It is Allah who sends the winds, so they stir up clouds. We then drive them to a dead land, and with them, We revive the land after its death. Such is the Resurrection."
        },
        {
            "verseNumber": 10,
            "verseString": "Whoever desires honor—all honor belongs to God. To Him ascends good speech, and He uplifts righteous conduct. However, those who plot evils will have a severe punishment, and their plotting will fail.",
            "verseStringReplacedWithAllah": "Whoever desires honor—all honor belongs to Allah. To Him ascends good speech, and He uplifts righteous conduct. However, those who plot evils will have a severe punishment, and their plotting will fail."
        },
        {
            "verseNumber": 11,
            "verseString": "God created you from dust, then from a drop, and then He made you pairs. No female conceives or gives birth except with His knowledge. No one’s lifespan is extended or reduced, but it’s recorded in a decree. This is easy for God.",
            "verseStringReplacedWithAllah": "Allah created you from dust, then from a drop, and then He made you pairs. No female conceives or gives birth except with His knowledge. No one’s lifespan is extended or reduced, but it’s recorded in a decree. This is easy for Allah."
        },
        {
            "verseNumber": 12,
            "verseString": "The two seas aren’t the same. One is fresh, sweet, and satisfying to drink, while the other is salty and bitter. From each, you eat tender meat and derive jewels to wear. You see ships sailing through it, seeking His bounty, so you may give thanks."
        },
        {
            "verseNumber": 13,
            "verseString": "He merges the night into the day, and the day into the night. He subjected the sun and the moon, each running for a specified period. That is God, your Lord; to Him belongs all sovereignty. Those whom you invoke besides Him don’t possess a speck.",
            "verseStringReplacedWithAllah": "He merges the night into the day, and the day into the night. He subjected the sun and the moon, each running for a specified period. That is Allah, your Lord; to Him belongs all sovereignty. Those whom you invoke besides Him don’t possess a speck."
        },
        {
            "verseNumber": 14,
            "verseString": "If you pray to them, they can’t hear your prayer. And if they heard, they couldn’t respond to you. On Resurrection Day, they will deny your association. None can inform you like an Expert."
        },
        {
            "verseNumber": 15,
            "verseString": "O people, you are those in need of God, while God is the Free of need, the Praiseworthy.",
            "verseStringReplacedWithAllah": "O people, you are those in need of Allah, while Allah is the Free of need, the Praiseworthy."
        },
        {
            "verseNumber": 16,
            "verseString": "If He wills, He can eliminate you, and bring forth a new creation."
        },
        {
            "verseNumber": 17,
            "verseString": "And this is not difficult for God.",
            "verseStringReplacedWithAllah": "And this is not difficult for Allah."
        },
        {
            "verseNumber": 18,
            "verseString": "No bearer of burdens can bear the burdens of another. Even if a heavily laden soul cries out for relief, none of its burdens can be lifted, not even by a close relative. Your duty is to warn those who privately fear their Lord and establish prayer. Whoever purifies himself does so for his advantage. The final return is to God.",
            "verseStringReplacedWithAllah": "No bearer of burdens can bear the burdens of another. Even if a heavily laden soul cries out for relief, none of its burdens can be lifted, not even by a close relative. Your duty is to warn those who privately fear their Lord and establish prayer. Whoever purifies himself does so for his advantage. The final return is to Allah."
        },
        {
            "verseNumber": 19,
            "verseString": "The blind and the sighted aren’t equal."
        },
        {
            "verseNumber": 20,
            "verseString": "Nor are darkness and light."
        },
        {
            "verseNumber": 21,
            "verseString": "Nor are shadows and intense heat."
        },
        {
            "verseNumber": 22,
            "verseString": "And not equal are the living and the dead. God makes whom He wills hear, and you can’t make those in the graves hear.",
            "verseStringReplacedWithAllah": "And not equal are the living and the dead. Allah makes whom He wills hear, and you can’t make those in the graves hear."
        },
        {
            "verseNumber": 23,
            "verseString": "You are only a warner."
        },
        {
            "verseNumber": 24,
            "verseString": "We sent you with the truth, as a bringer of good news and a warner. Every community has had a warner pass through it."
        },
        {
            "verseNumber": 25,
            "verseString": "If they deny you, their predecessors also denied. Their messengers came to them with clear signs, scriptures, and the illuminating Book."
        },
        {
            "verseNumber": 26,
            "verseString": "Then, I seized those who disbelieved. So, how was my reproach?"
        },
        {
            "verseNumber": 27,
            "verseString": "Don’t you see that God sends down water from the sky? With it, We produce fruits of various colors. In the mountains are streaks white and red, of various shades, and jet-black.",
            "verseStringReplacedWithAllah": "Don’t you see that Allah sends down water from the sky? With it, We produce fruits of various colors. In the mountains are streaks white and red, of various shades, and jet-black."
        },
        {
            "verseNumber": 28,
            "verseString": "Similarly, humans, animals, and livestock are diverse in color. Among His servants, it’s the learned who fear God. God is Almighty and Forgiving.",
            "verseStringReplacedWithAllah": "Similarly, humans, animals, and livestock are diverse in color. Among His servants, it’s the learned who fear Allah. Allah is Almighty and Forgiving."
        },
        {
            "verseNumber": 29,
            "verseString": "Those who uphold God’s Scripture, perform the prayers, and give in charity from what We provide for them, secretly and openly, hope for a commerce that will never fail.",
            "verseStringReplacedWithAllah": "Those who uphold Allah’s Scripture, perform the prayers, and give in charity from what We provide for them, secretly and openly, hope for a commerce that will never fail."
        },
        {
            "verseNumber": 30,
            "verseString": "He will fully compensate them and increase them from His bounty. He is Forgiving and Appreciative."
        },
        {
            "verseNumber": 31,
            "verseString": "The Scripture we revealed to you is the absolute truth, confirming what preceded it. God is All-Knowing and Watchful over His beings.",
            "verseStringReplacedWithAllah": "The Scripture we revealed to you is the absolute truth, confirming what preceded it. Allah is All-Knowing and Watchful over His beings."
        },
        {
            "verseNumber": 32,
            "verseString": "We then passed the Scripture to Our chosen servants. Among them are those who wrong themselves, those who tread a middle path, and those who, by God’s grace, excel in good deeds—this is the greatest bounty.",
            "verseStringReplacedWithAllah": "We then passed the Scripture to Our chosen servants. Among them are those who wrong themselves, those who tread a middle path, and those who, by Allah’s grace, excel in good deeds—this is the greatest bounty."
        },
        {
            "verseNumber": 33,
            "verseString": "They will enter the Gardens of Eden, adorned therein with bracelets of gold and pearls, and their clothing therein will be made of silk."
        },
        {
            "verseNumber": 34,
            "verseString": "They will exclaim, “Praise be to God, who removed from us sadness. Our Lord is Forgiving and Appreciative.",
            "verseStringReplacedWithAllah": "They will exclaim, “Praise be to Allah, who removed from us sadness. Our Lord is Forgiving and Appreciative."
        },
        {
            "verseNumber": 35,
            "verseString": "He, who, out of His bounty, has settled us in the Eternal Home, where neither boredom nor fatigue touches us.”"
        },
        {
            "verseNumber": 36,
            "verseString": "But those who disbelieved, for them will be the fire of Hell, where they won’t die, and their punishment won’t be lightened. Thus do We recompense every disbeliever."
        },
        {
            "verseNumber": 37,
            "verseString": "There, they will scream, “Our Lord, release us from this, and we will act righteously, unlike our previous deeds.” Didn’t We give you a life long enough for whoever would remember to remember? And the warner did come to you. So taste! For the wrongdoers, there is no helper."
        },
        {
            "verseNumber": 38,
            "verseString": "God is the Knower of the unseen realms of the heavens and the earth, and He knows what’s in the hearts.",
            "verseStringReplacedWithAllah": "Allah is the Knower of the unseen realms of the heavens and the earth, and He knows what’s in the hearts."
        },
        {
            "verseNumber": 39,
            "verseString": "It is He who made you stewards of the earth. Whoever disbelieves, his disbelief is against him. The disbelief of unbelievers only increases their Lord’s displeasure of them. The disbelief of the disbelievers adds only to their loss."
        },
        {
            "verseNumber": 40,
            "verseString": "Say, “Consider those you deem as God’s equals. Show me what part of the earth they’ve created, or do they have a share in the heavens?” Or did We give them a book from which they derive clear evidence? The evildoers promise each other nothing but delusion.",
            "verseStringReplacedWithAllah": "Say, “Consider those you deem as Allah’s equals. Show me what part of the earth they’ve created, or do they have a share in the heavens?” Or did We give them a book from which they derive clear evidence? The evildoers promise each other nothing but delusion."
        },
        {
            "verseNumber": 41,
            "verseString": "God upholds the heavens and the earth, preventing them from vanishing. If any entity other than Him were to sustain them, they would surely fall into ruin. Indeed, He is ever Patient and Forgiving.",
            "verseStringReplacedWithAllah": "Allah upholds the heavens and the earth, preventing them from vanishing. If any entity other than Him were to sustain them, they would surely fall into ruin. Indeed, He is ever Patient and Forgiving."
        },
        {
            "verseNumber": 42,
            "verseString": "They swore their most solemn oaths by God, that if a warner came to them, they would be more guided than any other nation. Yet, when a warner came to them, it did not increase them except in aversion.",
            "verseStringReplacedWithAllah": "They swore their most solemn oaths by Allah, that if a warner came to them, they would be more guided than any other nation. Yet, when a warner came to them, it did not increase them except in aversion."
        },
        {
            "verseNumber": 43,
            "verseString": "They behave arrogantly in the land and scheme evil. But the evil scheme only ensnares its own authors. Can they await anything but the fate of the predecessors? You won’t find any change in God’s way nor any deviation from it.",
            "verseStringReplacedWithAllah": "They behave arrogantly in the land and scheme evil. But the evil scheme only ensnares its own authors. Can they await anything but the fate of the predecessors? You won’t find any change in Allah’s way nor any deviation from it."
        },
        {
            "verseNumber": 44,
            "verseString": "Didn’t they roam the earth and see how was the end of those before them? They were more powerful than them. Yet there is nothing in the heavens or on earth that can thwart God. Indeed, He is All-Knowing, Most Capable.",
            "verseStringReplacedWithAllah": "Didn’t they roam the earth and see how was the end of those before them? They were more powerful than them. Yet there is nothing in the heavens or on earth that can thwart Allah. Indeed, He is All-Knowing, Most Capable."
        },
        {
            "verseNumber": 45,
            "verseString": "If God were to seize people for their deeds, He wouldn’t leave a single living thing on its surface. But He delays them until a specified time. And when their time comes—God is Observant of His servants.",
            "verseStringReplacedWithAllah": "If Allah were to seize people for their deeds, He wouldn’t leave a single living thing on its surface. But He delays them until a specified time. And when their time comes—Allah is Observant of His servants."
        }
    ],
    "chapterNumber": 35,
    "nameInEnglish": "Originator",
    "nameInTransliteration": "Fatir",
    "nameInArabic": "فاطر",
    "numberOfVerses": 45
}