{
    "verses": [
        {
            "verseNumber": 0,
            "verseString": "In the name of God, the Gracious, the Merciful.",
            "verseStringReplacedWithAllah": "In the name of Allah, the Gracious, the Merciful."
        },
        {
            "verseNumber": 1,
            "verseString": "O people, beware of your Lord, for the quake of the Hour is something tremendous."
        },
        {
            "verseNumber": 2,
            "verseString": "On the Day you witness it, every nursing mother will forget her nursling, and every pregnant woman will miscarry. You will see people drunk, yet they are not drunk. The punishment of God is severe.",
            "verseStringReplacedWithAllah": "On the Day you witness it, every nursing mother will forget her nursling, and every pregnant woman will miscarry. You will see people drunk, yet they are not drunk. The punishment of Allah is severe."
        },
        {
            "verseNumber": 3,
            "verseString": "Some people argue about God without knowledge, guided by every rebellious devil.",
            "verseStringReplacedWithAllah": "Some people argue about Allah without knowledge, guided by every rebellious devil."
        },
        {
            "verseNumber": 4,
            "verseString": "It has been decreed about him, that whoever turns to him, he will mislead him and guide him to the suffering of the Blaze."
        },
        {
            "verseNumber": 5,
            "verseString": "O people, if you doubt the Resurrection, We created you from dust, then from a drop, then from a clinging clot, and then from a lump, formed and unformed, to show you. We settle in the wombs whom We will for a preordained term, then We bring you out as infants, until you reach your full strength. Some of you may pass away, while others are returned to the feeblest old age, so they know nothing after knowing much. You see the earth barren, but when We send down rain upon it, it stirs, swells, and produces every delightful pair."
        },
        {
            "verseNumber": 6,
            "verseString": "This is because God is the Ultimate Truth, revives the dead, and has power over all things.",
            "verseStringReplacedWithAllah": "This is because Allah is the Ultimate Truth, revives the dead, and has power over all things."
        },
        {
            "verseNumber": 7,
            "verseString": "The Hour is to come—there is no doubt about it—God will resurrect those who are in the graves.",
            "verseStringReplacedWithAllah": "The Hour is to come—there is no doubt about it—Allah will resurrect those who are in the graves."
        },
        {
            "verseNumber": 8,
            "verseString": "Some people argue about God without knowledge, guidance, or an enlightening Scripture.",
            "verseStringReplacedWithAllah": "Some people argue about Allah without knowledge, guidance, or an enlightening Scripture."
        },
        {
            "verseNumber": 9,
            "verseString": "They bend it to mislead others from God’s path. For them is humiliation in this world, and on Resurrection Day, We will make them taste the punishment of the Burning Fire.",
            "verseStringReplacedWithAllah": "They bend it to mislead others from Allah’s path. For them is humiliation in this world, and on Resurrection Day, We will make them taste the punishment of the Burning Fire."
        },
        {
            "verseNumber": 10,
            "verseString": "This is what your hands sent ahead, and God is never unjust to the servants.",
            "verseStringReplacedWithAllah": "This is what your hands sent ahead, and Allah is never unjust to the servants."
        },
        {
            "verseNumber": 11,
            "verseString": "Among people, there is one who worships God on edge. If good touches him, he is content, but if a trial strikes him, he reverts, losing both this world and the Hereafter. This is the clear loss.",
            "verseStringReplacedWithAllah": "Among people, there is one who worships Allah on edge. If good touches him, he is content, but if a trial strikes him, he reverts, losing both this world and the Hereafter. This is the clear loss."
        },
        {
            "verseNumber": 12,
            "verseString": "He prays to, instead of God, what neither harms nor benefits him. That is straying far.",
            "verseStringReplacedWithAllah": "He prays to, instead of Allah, what neither harms nor benefits him. That is straying far."
        },
        {
            "verseNumber": 13,
            "verseString": "He invokes one whose harm is closer than his benefit—what an evil patron and what an evil companion!"
        },
        {
            "verseNumber": 14,
            "verseString": "God will admit those who believe and act righteously into Gardens through which rivers flow. God does whatever He wills.",
            "verseStringReplacedWithAllah": "Allah will admit those who believe and act righteously into Gardens through which rivers flow. Allah does whatever He wills."
        },
        {
            "verseNumber": 15,
            "verseString": "Whoever thinks that God won’t help him in this life and the Hereafter, let him extend to the sky, cut, and see if his strategy eliminates what enrages him.",
            "verseStringReplacedWithAllah": "Whoever thinks that Allah won’t help him in this life and the Hereafter, let him extend to the sky, cut, and see if his strategy eliminates what enrages him."
        },
        {
            "verseNumber": 16,
            "verseString": "And thus, We sent it down as clear signs, and surely, God guides whom He wills.",
            "verseStringReplacedWithAllah": "And thus, We sent it down as clear signs, and surely, Allah guides whom He wills."
        },
        {
            "verseNumber": 17,
            "verseString": "Those who believe, the Jews, the Sabeans, the Christians, the Zoroastrians, and those who associate—God will judge between them on Resurrection Day. God is a Witness over all things.",
            "verseStringReplacedWithAllah": "Those who believe, the Jews, the Sabeans, the Christians, the Zoroastrians, and those who associate—Allah will judge between them on Resurrection Day. Allah is a Witness over all things."
        },
        {
            "verseNumber": 18,
            "verseString": "Don’t you see that everything in the heavens and the earth bows down to God—the sun, the moon, the stars, the mountains, the trees, the animals, and many people? Yet, many are deserving of suffering. Whomsoever God humiliates, none can honor. God does what He wills.",
            "verseStringReplacedWithAllah": "Don’t you see that everything in the heavens and the earth bows down to Allah—the sun, the moon, the stars, the mountains, the trees, the animals, and many people? Yet, many are deserving of suffering. Whomsoever Allah humiliates, none can honor. Allah does what He wills."
        },
        {
            "verseNumber": 19,
            "verseString": "These are two opponents who dispute concerning their Lord. For those who disbelieve, garments of fire will be tailored, and scalding water will be poured over their heads."
        },
        {
            "verseNumber": 20,
            "verseString": "Melting their insides and their skins."
        },
        {
            "verseNumber": 21,
            "verseString": "For them are iron maces."
        },
        {
            "verseNumber": 22,
            "verseString": "Every time they seek to escape their torment, they are returned to it: “Taste the punishment of the blazing Fire!”"
        },
        {
            "verseNumber": 23,
            "verseString": "However, God will admit those who believe and act righteously into Gardens beneath which rivers flow, where they’ll be adorned with bracelets of gold and pearls, and their clothing will be of silk.",
            "verseStringReplacedWithAllah": "However, Allah will admit those who believe and act righteously into Gardens beneath which rivers flow, where they’ll be adorned with bracelets of gold and pearls, and their clothing will be of silk."
        },
        {
            "verseNumber": 24,
            "verseString": "They’ve been guided to good speech and to the path of the Praiseworthy."
        },
        {
            "verseNumber": 25,
            "verseString": "Those who disbelieve and obstruct God’s path and the Sacred Mosque—which We’ve designated for all people, whether they reside nearby or are from afar—anyone who seeks to desecrate it with wickedness, We will make them taste a severe punishment.",
            "verseStringReplacedWithAllah": "Those who disbelieve and obstruct Allah’s path and the Sacred Mosque—which We’ve designated for all people, whether they reside nearby or are from afar—anyone who seeks to desecrate it with wickedness, We will make them taste a severe punishment."
        },
        {
            "verseNumber": 26,
            "verseString": "We showed Abraham the site of the House: “Don’t associate anything with Me, and purify My House for those who circumambulate it, stand in prayer, bow down, and prostrate.”"
        },
        {
            "verseNumber": 27,
            "verseString": "Announce the pilgrimage to humanity. They will come to you on foot and every mode of transport, coming from every distant pass."
        },
        {
            "verseNumber": 28,
            "verseString": "To witness benefits, and to commemorate God’s name during the known days, for providing them with livestock. So, eat from them and feed the destitute poor.",
            "verseStringReplacedWithAllah": "To witness benefits, and to commemorate Allah’s name during the known days, for providing them with livestock. So, eat from them and feed the destitute poor."
        },
        {
            "verseNumber": 29,
            "verseString": "Then, let them complete their rites, fulfill their vows, and circumambulate the Ancient House."
        },
        {
            "verseNumber": 30,
            "verseString": "That is the command. Whoever respects the sanctities of God, it’s best for him with his Lord. Livestock is permissible for you, except for those explicitly prohibited. Shun the filth of idols, and avoid false speech.",
            "verseStringReplacedWithAllah": "That is the command. Whoever respects the sanctities of Allah, it’s best for him with his Lord. Livestock is permissible for you, except for those explicitly prohibited. Shun the filth of idols, and avoid false speech."
        },
        {
            "verseNumber": 31,
            "verseString": "Being devoted to God, not associating anything with Him. Whoever associates partners with God, it is as though he has fallen from the sky and is either snatched by birds or carried away by the wind to a distant place.",
            "verseStringReplacedWithAllah": "Being devoted to Allah, not associating anything with Him. Whoever associates partners with Allah, it is as though he has fallen from the sky and is either snatched by birds or carried away by the wind to a distant place."
        },
        {
            "verseNumber": 32,
            "verseString": "So it is. Whoever venerates God’s symbols is from the purity of the hearts.",
            "verseStringReplacedWithAllah": "So it is. Whoever venerates Allah’s symbols is from the purity of the hearts."
        },
        {
            "verseNumber": 33,
            "verseString": "There are benefits for you in them for a specified term; their final destination is the Ancient House."
        },
        {
            "verseNumber": 34,
            "verseString": "We instituted a rite for every community so they may mention God’s name over the livestock He provided for them. Your God is One God, so surrender to Him, and give good news to the humble.",
            "verseStringReplacedWithAllah": "We instituted a rite for every community so they may mention Allah’s name over the livestock He provided for them. Your God is One God, so surrender to Him, and give good news to the humble."
        },
        {
            "verseNumber": 35,
            "verseString": "Those whose hearts tremble at the mention of God, those who persevere in patience in whatever afflicts them, who establish prayer, and who spend out of what We’ve provided them.",
            "verseStringReplacedWithAllah": "Those whose hearts tremble at the mention of Allah, those who persevere in patience in whatever afflicts them, who establish prayer, and who spend out of what We’ve provided them."
        },
        {
            "verseNumber": 36,
            "verseString": "We designated the sacrificial animals among God’s symbols for you. They hold benefits for you. When they are lined up, pronounce God’s name over them. Once they have fallen on their sides, eat from them and feed those in need, whether they ask or not. Thus, We tamed them to you, so you may give thanks.",
            "verseStringReplacedWithAllah": "We designated the sacrificial animals among Allah’s symbols for you. They hold benefits for you. When they are lined up, pronounce Allah’s name over them. Once they have fallen on their sides, eat from them and feed those in need, whether they ask or not. Thus, We tamed them to you, so you may give thanks."
        },
        {
            "verseNumber": 37,
            "verseString": "Neither their flesh nor their blood reaches God, but your piety does. He tamed them to you, to extol God’s greatness for guiding you. Give good news to the doers of good.",
            "verseStringReplacedWithAllah": "Neither their flesh nor their blood reaches Allah, but your piety does. He tamed them to you, to extol Allah’s greatness for guiding you. Give good news to the doers of good."
        },
        {
            "verseNumber": 38,
            "verseString": "God defends the believers. God has no love for any ungrateful traitor.",
            "verseStringReplacedWithAllah": "Allah defends the believers. Allah has no love for any ungrateful traitor."
        },
        {
            "verseNumber": 39,
            "verseString": "Permission is given to those who were fought against because they were wronged; indeed, God can grant them victory.",
            "verseStringReplacedWithAllah": "Permission is given to those who were fought against because they were wronged; indeed, Allah can grant them victory."
        },
        {
            "verseNumber": 40,
            "verseString": "Those who were unjustly evicted from their homes, simply for saying, “Our Lord is God.” Had God not repelled some people by means of others, numerous monasteries, churches, synagogues, and mosques, where God’s name is frequently invoked, would’ve been demolished. God will support those who support His cause. God is Powerful and Mighty.",
            "verseStringReplacedWithAllah": "Those who were unjustly evicted from their homes, simply for saying, “Our Lord is Allah.” Had Allah not repelled some people by means of others, numerous monasteries, churches, synagogues, and mosques, where Allah’s name is frequently invoked, would’ve been demolished. Allah will support those who support His cause. Allah is Powerful and Mighty."
        },
        {
            "verseNumber": 41,
            "verseString": "Those who, when We empower them on earth, establish prayer, give charity, promote what’s right, and forbid what’s wrong. The final decision in all matters belongs to God.",
            "verseStringReplacedWithAllah": "Those who, when We empower them on earth, establish prayer, give charity, promote what’s right, and forbid what’s wrong. The final decision in all matters belongs to Allah."
        },
        {
            "verseNumber": 42,
            "verseString": "If they reject you, so before them, the people of Noah and Aad and Thamud had rejected."
        },
        {
            "verseNumber": 43,
            "verseString": "And the people of Abraham, and the people of Lot."
        },
        {
            "verseNumber": 44,
            "verseString": "And the inhabitants of Midian. Moses, too, was accused of lying. I granted delay to the unbelievers, then I seized them. So how terrible was My condemnation?"
        },
        {
            "verseNumber": 45,
            "verseString": "How many a town did We destroy while it was committing wrong? They now lie in ruins, with abandoned wells and lofty mansions."
        },
        {
            "verseNumber": 46,
            "verseString": "Didn’t they travel through the earth and use their intellect to understand, and their ears to listen? It’s not the eyes that go blind, but it’s the hearts in the chests that do."
        },
        {
            "verseNumber": 47,
            "verseString": "They challenge you to hasten the punishment, but God will never fail in His promise. A day with your Lord is like a thousand years by your calculations.",
            "verseStringReplacedWithAllah": "They challenge you to hasten the punishment, but Allah will never fail in His promise. A day with your Lord is like a thousand years by your calculations."
        },
        {
            "verseNumber": 48,
            "verseString": "And how many a town did I prolong while it was committing wrong? To Me is the ultimate return."
        },
        {
            "verseNumber": 49,
            "verseString": "Say, “O people, I am only a clear warner to you.”"
        },
        {
            "verseNumber": 50,
            "verseString": "Those who believe and perform righteous deeds will receive forgiveness and a generous reward."
        },
        {
            "verseNumber": 51,
            "verseString": "But those who strive to frustrate Our revelations will be inhabitants of Hell."
        },
        {
            "verseNumber": 52,
            "verseString": "We never sent a messenger or a prophet before you without Satan attempting to interfere with his desires. Yet, God nullifies what Satan insinuates, and God reinforces His revelations. God is All-Knowing, All-Wise.",
            "verseStringReplacedWithAllah": "We never sent a messenger or a prophet before you without Satan attempting to interfere with his desires. Yet, Allah nullifies what Satan insinuates, and Allah reinforces His revelations. Allah is All-Knowing, All-Wise."
        },
        {
            "verseNumber": 53,
            "verseString": "Satan’s insinuations are a trial for those with diseased and hardened hearts. The wrongdoers are in profound discord."
        },
        {
            "verseNumber": 54,
            "verseString": "Those endowed with knowledge recognize the truth from your Lord; they believe in it, and their hearts humble to it. God guides those who believe to a straight path.",
            "verseStringReplacedWithAllah": "Those endowed with knowledge recognize the truth from your Lord; they believe in it, and their hearts humble to it. Allah guides those who believe to a straight path."
        },
        {
            "verseNumber": 55,
            "verseString": "But the unbelievers will remain in doubt until the Hour suddenly overtakes them—or the punishment of a barren day befalls them."
        },
        {
            "verseNumber": 56,
            "verseString": "On that Day, the dominion will belong exclusively to God; He will judge between them. Those who believed and did righteous deeds will be in the Gardens of Bliss.",
            "verseStringReplacedWithAllah": "On that Day, the dominion will belong exclusively to Allah; He will judge between them. Those who believed and did righteous deeds will be in the Gardens of Bliss."
        },
        {
            "verseNumber": 57,
            "verseString": "But those who disbelieved and denied Our signs—for those there will be a humiliating punishment."
        },
        {
            "verseNumber": 58,
            "verseString": "Those who emigrated for God’s cause and were then killed or died, God will provide for them a good provision. God is the best of providers.",
            "verseStringReplacedWithAllah": "Those who emigrated for Allah’s cause and were then killed or died, Allah will provide for them a good provision. Allah is the best of providers."
        },
        {
            "verseNumber": 59,
            "verseString": "He will admit them to an entrance they will find pleasing. God is All-Knowing, Most Forbearing.",
            "verseStringReplacedWithAllah": "He will admit them to an entrance they will find pleasing. Allah is All-Knowing, Most Forbearing."
        },
        {
            "verseNumber": 60,
            "verseString": "That is so. If anyone retaliates in equivalence to the harm inflicted upon him, and is transgressed upon, God will assist him. God is Pardoning and forgiving.",
            "verseStringReplacedWithAllah": "That is so. If anyone retaliates in equivalence to the harm inflicted upon him, and is transgressed upon, Allah will assist him. Allah is Pardoning and forgiving."
        },
        {
            "verseNumber": 61,
            "verseString": "That is because God merges night into day and day into night; God is Hearing and Seeing.",
            "verseStringReplacedWithAllah": "That is because Allah merges night into day and day into night; Allah is Hearing and Seeing."
        },
        {
            "verseNumber": 62,
            "verseString": "That is because God is the Reality, while what they call upon besides Him is falsehood; and because God is the Most High, the Grand.",
            "verseStringReplacedWithAllah": "That is because Allah is the Reality, while what they call upon besides Him is falsehood; and because Allah is the Most High, the Grand."
        },
        {
            "verseNumber": 63,
            "verseString": "Didn’t you see how God sends down water from the sky, causing the earth to become green? God is Subtle and Aware.",
            "verseStringReplacedWithAllah": "Didn’t you see how Allah sends down water from the sky, causing the earth to become green? Allah is Subtle and Aware."
        },
        {
            "verseNumber": 64,
            "verseString": "To Him belongs everything in the heavens and the earth. God is the Self-Sufficient, the Praiseworthy.",
            "verseStringReplacedWithAllah": "To Him belongs everything in the heavens and the earth. Allah is the Self-Sufficient, the Praiseworthy."
        },
        {
            "verseNumber": 65,
            "verseString": "Didn’t you see how God made everything on earth subservient to you? Ships sail the sea by His laws. He holds the sky from falling on earth, unless by His permission. God is Compassionate and Merciful to humankind.",
            "verseStringReplacedWithAllah": "Didn’t you see how Allah made everything on earth subservient to you? Ships sail the sea by His laws. He holds the sky from falling on earth, unless by His permission. Allah is Compassionate and Merciful to humankind."
        },
        {
            "verseNumber": 66,
            "verseString": "It is He who gave you life, will cause you to die, and will then revive you. Yet, man is ungrateful."
        },
        {
            "verseNumber": 67,
            "verseString": "For every community, We established certain rites which they follow, so don’t let their disputes entangle you. Instead, invite to your Lord. You are on a straight path."
        },
        {
            "verseNumber": 68,
            "verseString": "If they argue with you, say, “God knows best about what you’re doing.”",
            "verseStringReplacedWithAllah": "If they argue with you, say, “Allah knows best about what you’re doing.”"
        },
        {
            "verseNumber": 69,
            "verseString": "On the Day of Resurrection, God will judge between you, resolving all your disputes.",
            "verseStringReplacedWithAllah": "On the Day of Resurrection, Allah will judge between you, resolving all your disputes."
        },
        {
            "verseNumber": 70,
            "verseString": "Don’t you know that God is aware of everything in the heavens and the earth? All of this is recorded in a book; this is easy for God.",
            "verseStringReplacedWithAllah": "Don’t you know that Allah is aware of everything in the heavens and the earth? All of this is recorded in a book; this is easy for Allah."
        },
        {
            "verseNumber": 71,
            "verseString": "They worship, besides God, what He didn’t authorize, which they have no knowledge of. The wrongdoers will have no supporter.",
            "verseStringReplacedWithAllah": "They worship, besides Allah, what He didn’t authorize, which they have no knowledge of. The wrongdoers will have no supporter."
        },
        {
            "verseNumber": 72,
            "verseString": "When Our clear verses are conveyed to them, you will notice disdain on the faces of the unbelievers. They nearly assault those who convey Our verses to them. Say, “Shall I inform you of something worse than that? The Fire which God has promised those who disbelieve, and wretched is the destination!”",
            "verseStringReplacedWithAllah": "When Our clear verses are conveyed to them, you will notice disdain on the faces of the unbelievers. They nearly assault those who convey Our verses to them. Say, “Shall I inform you of something worse than that? The Fire which Allah has promised those who disbelieve, and wretched is the destination!”"
        },
        {
            "verseNumber": 73,
            "verseString": "O people, a parable is presented; listen to it attentively: those you call upon besides God can’t even create a fly, even if they combined their efforts. And if a fly were to snatch something away from them, they would be unable to retrieve it. Both the seeker and the sought are weak.",
            "verseStringReplacedWithAllah": "O people, a parable is presented; listen to it attentively: those you call upon besides Allah can’t even create a fly, even if they combined their efforts. And if a fly were to snatch something away from them, they would be unable to retrieve it. Both the seeker and the sought are weak."
        },
        {
            "verseNumber": 74,
            "verseString": "They don’t appreciate God as He ought to be appreciated. God is Powerful and Mighty.",
            "verseStringReplacedWithAllah": "They don’t appreciate Allah as He ought to be appreciated. Allah is Powerful and Mighty."
        },
        {
            "verseNumber": 75,
            "verseString": "God chooses messengers from among angels and humans. God is All-Hearing, All-Seeing.",
            "verseStringReplacedWithAllah": "Allah chooses messengers from among angels and humans. Allah is All-Hearing, All-Seeing."
        },
        {
            "verseNumber": 76,
            "verseString": "He knows their past and their future. All matters will return to God.",
            "verseStringReplacedWithAllah": "He knows their past and their future. All matters will return to Allah."
        },
        {
            "verseNumber": 77,
            "verseString": "O you who believe, bow and prostrate yourselves, and worship your Lord, and do good, so that you may succeed."
        },
        {
            "verseNumber": 78,
            "verseString": "Strive for God with the striving due to Him. He has chosen you and imposed no difficulty upon you in religion—the way of your forefather Abraham. He named you ‘Submitters’ from before, and in this, so that the Messenger may bear witness over you, and you may bear witness over the people. Therefore, establish prayers, give charity, and hold fast to God. He is your Protector—a splendid Guardian and a superb Helper.",
            "verseStringReplacedWithAllah": "Strive for Allah with the striving due to Him. He has chosen you and imposed no difficulty upon you in religion—the way of your forefather Abraham. He named you ‘Submitters’ from before, and in this, so that the Messenger may bear witness over you, and you may bear witness over the people. Therefore, establish prayers, give charity, and hold fast to Allah. He is your Protector—a splendid Guardian and a superb Helper."
        }
    ],
    "chapterNumber": 22,
    "nameInEnglish": "The Pilgrimage",
    "nameInTransliteration": "Al Hajj",
    "nameInArabic": "الحج",
    "numberOfVerses": 78
}